[
  {
    "nivell": "Fàcil 🟢",
    "pregunta": "El model 3-2-1 recomana mantenir tres còpies en dos suports diferents i una fora del lloc.",
    "resposta_boolean": true,
    "context": "És la norma bàsica de seguretat de dades per evitar la pèrdua total davant errors locals o desastres físics."
  },
  {
    "nivell": "Fàcil 🟢",
    "pregunta": "Un backup complet només copia els fitxers modificats des de l'últim backup.",
    "resposta_boolean": false,
    "context": "El backup complet copia totes les dades cada vegada, no només les modificades."
  },
  {
    "nivell": "Normal 🟡",
    "pregunta": "Les còpies air-gapped estan connectades contínuament a la xarxa per sincronitzar-se.",
    "resposta_boolean": false,
    "context": "Les còpies air-gapped estan aïllades o desconnectades de la xarxa per evitar infeccions per ransomware."
  },
  {
    "nivell": "Normal 🟡",
    "pregunta": "El model 3-2-1-1-0 inclou una còpia immutable i verificació sense errors.",
    "resposta_boolean": true,
    "context": "Afegint una còpia immutable i validacions sense errors es millora la seguretat davant ransomware."
  },
  {
    "nivell": "Normal 🟡",
    "pregunta": "El xifratge en els backups protegeix la confidencialitat de les dades en trànsit i en repòs.",
    "resposta_boolean": true,
    "context": "El xifratge evita que tercers accedeixin o alterin dades mentre viatgen o estan emmagatzemades."
  },
  {
    "nivell": "Difícil 🔵",
    "pregunta": "El RAID substitueix la necessitat de fer còpies de seguretat.",
    "resposta_boolean": false,
    "context": "El RAID només aporta redundància de maquinari; no conserva versions històriques ni protegeix contra ransomware."
  },
  {
    "nivell": "Difícil 🔵",
    "pregunta": "El RGPD (article 32) obliga a poder restaurar dades personals en cas d'incident tècnic o físic.",
    "resposta_boolean": true,
    "context": "L'article 32 del RGPD estableix l'obligació de garantir la capacitat de restaurar dades personals quan hi hagi incidents."
  },
  {
    "nivell": "Difícil 🔵",
    "pregunta": "Les còpies immutables poden ser modificades abans que acabi el període de retenció.",
    "resposta_boolean": false,
    "context": "Per definició, les còpies immutables no poden alterar-se ni esborrar-se fins que expira el seu període de conservació."
  },
  {
    "nivell": "Difícil 🔵",
    "pregunta": "El model WORM (Write Once Read Many) garanteix que les dades només es poden escriure una vegada i llegir moltes.",
    "resposta_boolean": true,
    "context": "El WORM evita l'esborrat o modificació d'arxius, assegurant la integritat de les còpies a llarg termini."
  },
  {
    "nivell": "Difícil 🔵",
    "pregunta": "El ransomware no pot afectar còpies connectades al sistema.",
    "resposta_boolean": false,
    "context": "Qualsevol còpia connectada pot ser xifrada o esborrada pel malware, per això cal mantenir còpies offline o air-gapped."
  }
]



