[
{"nivell": "Fàcil 🟢", "pregunta": "El pla de continuïtat del negoci (BCP) i el pla de recuperació davant desastres (DRP) són exactament el mateix.", "resposta_boolean": false, "context": "El BCP és estratègic i cobreix tot el negoci; el DRP és tècnic i se centra en la recuperació TIC."},
{"nivell": "Fàcil 🟢", "pregunta": "El RTO indica quant temps pot estar inactiu un servei abans que afecti el negoci.", "resposta_boolean": true, "context": "El Recovery Time Objective estableix el temps màxim per restablir un servei després d’una fallada."},
{"nivell": "Fàcil 🟢", "pregunta": "El RPO mesura la quantitat màxima de dades que es poden perdre sense danys inacceptables.", "resposta_boolean": true, "context": "El Recovery Point Objective defineix fins on podem recuperar dades després d’un incident."},
{"nivell": "Fàcil 🟢", "pregunta": "El MTD sempre és més petit que el RTO.", "resposta_boolean": false, "context": "El MTD (temps màxim tolerable d’inactivitat) és més gran o igual que el RTO, mai més petit."},
{"nivell": "Normal 🟡", "pregunta": "Un Cold Site és la solució més ràpida per recuperar un servei crític.", "resposta_boolean": false, "context": "Un Cold Site és lent perquè no té maquinari ni dades preinstal·lades."},
{"nivell": "Normal 🟡", "pregunta": "El cicle de Deming (PDCA) s’utilitza en la millora contínua dels plans de continuïtat.", "resposta_boolean": true, "context": "PDCA significa Planificar, Fer, Verificar i Actuar; és aplicable a la millora contínua segons ISO 22301."},
{"nivell": "Normal 🟡", "pregunta": "La ISO 22301 és l’estàndard principal de la gestió de la continuïtat del negoci.", "resposta_boolean": true, "context": "ISO 22301 estableix requisits per implementar un sistema de gestió de continuïtat del negoci (BCMS)."},
{"nivell": "Normal 🟡", "pregunta": "Segons l’ENS, les administracions públiques no estan obligades a disposar de plans de contingència.", "resposta_boolean": false, "context": "L’Esquema Nacional de Seguretat exigeix disposar de plans de contingència i proves periòdiques per a sistemes crítics."},
{"nivell": "Difícil 🔵", "pregunta": "La norma ISO/IEC 27031 proporciona directrius específiques per a la preparació de la recuperació TIC.", "resposta_boolean": true, "context": "ISO/IEC 27031 complementa la ISO 22301 centrant-se en la preparació tecnològica i el Disaster Recovery."},
{"nivell": "Difícil 🔵", "pregunta": "La replicació asíncrona és més costosa però més segura que la replicació síncrona.", "resposta_boolean": false, "context": "La replicació síncrona és la més segura perquè manté la consistència immediata, però té més cost."},
{"nivell": "Difícil 🔵", "pregunta": "Un pla de continuïtat no provat periòdicament és igualment efectiu.", "resposta_boolean": false, "context": "Sense proves regulars, un pla pot contenir errors no detectats i ser ineficaç en una emergència real."},
{"nivell": "Difícil 🔵", "pregunta": "El DRaaS (Disaster Recovery as a Service) permet recuperar sistemes al núvol de forma automàtica i escalable.", "resposta_boolean": true, "context": "DRaaS ofereix una alternativa flexible i ràpida a la recuperació tradicional, aprofitant la infraestructura cloud."},
{"nivell": "Difícil 🔵", "pregunta": "En un CPD TIER IV segons l’ANSI/TIA-942 no hi ha redundància d’alimentació ni xarxa.", "resposta_boolean": false, "context": "El nivell TIER IV requereix manteniment concurrent i tolerància a fallades amb redundància completa."},
{"nivell": "Avançat 🔵", "pregunta": "L’ENS estableix que la disponibilitat és un dels principis bàsics de la seguretat.", "resposta_boolean": true, "context": "La disponibilitat és un dels tres pilars de la seguretat juntament amb la confidencialitat i la integritat."},
{"nivell": "Avançat 🔵", "pregunta": "El procés de Gestió de la Continuïtat del Servei d’ITIL pertany a la fase d’Operació del Servei.", "resposta_boolean": false, "context": "En ITIL, la gestió de la continuïtat s’inclou dins de la fase de Disseny del Servei."},
{"nivell": "Avançat 🔵", "pregunta": "El pla DRP pot considerar-se complet sense definir rols i responsabilitats.", "resposta_boolean": false, "context": "Els rols i responsabilitats són essencials per garantir una resposta coordinada en cas de desastre."},
{"nivell": "Avançat 🔵", "pregunta": "Els entorns híbrids cloud faciliten la implementació de DR gràcies a la seva escalabilitat.", "resposta_boolean": true, "context": "Els entorns híbrids permeten replicar dades i sistemes en temps real entre diferents ubicacions."},
{"nivell": "Avançat 🔵", "pregunta": "Un Cold Site pot mantenir la disponibilitat del servei sense necessitat de configuració prèvia.", "resposta_boolean": false, "context": "El Cold Site no està preparat per operar immediatament; necessita instal·lació i configuració abans d’usar-se."},
{"nivell": "Avançat 🔵", "pregunta": "Les còpies 3-2-1 impliquen tenir tres còpies de dades, en dos suports diferents i una fora de la ubicació principal.", "resposta_boolean": true, "context": "És la millor pràctica estàndard per assegurar la recuperació davant pèrdues de dades."},
{"nivell": "Avançat 🔵", "pregunta": "El pla BCP ha de revisar-se només després d’un desastre real.", "resposta_boolean": false, "context": "El pla BCP ha de revisar-se periòdicament o després de qualsevol canvi significatiu en els sistemes o processos."},
{"nivell": "Avançat 🔵", "pregunta": "La ISO 20000, tot i ser una norma de gestió de serveis, inclou requisits relacionats amb la continuïtat i disponibilitat.", "resposta_boolean": true, "context": "La ISO 20000, basada en ITIL, exigeix processos de disponibilitat i continuïtat del servei TI."},
{"nivell": "Avançat 🔵", "pregunta": "Un simulacre complet de DRP implica la restauració real de sistemes i dades en un entorn controlat.", "resposta_boolean": true, "context": "Aquest tipus de prova permet verificar l’eficàcia real del pla de recuperació i la capacitat de resposta del personal."}
]