[
{"nivell":"Fàcil 🟢","pregunta":"El Wi-Fi està basat en l’estàndard IEEE 802.11.","resposta_boolean": true,"context":"Correcte. L’estàndard IEEE 802.11 defineix les xarxes locals sense fils (WLAN)."},
{"nivell":"Fàcil 🟢","pregunta":"El SSID és el nom visible de la xarxa Wi-Fi.","resposta_boolean": true,"context":"El SSID (Service Set Identifier) identifica la xarxa i apareix als dispositius per connectar-se."},
{"nivell":"Fàcil 🟢","pregunta":"El BSSID és una contrasenya que protegeix la xarxa Wi-Fi.","resposta_boolean": false,"context":"El BSSID és l’adreça MAC del punt d’accés, no una contrasenya."},
{"nivell":"Fàcil 🟢","pregunta":"WEP és el protocol de seguretat més segur actualment.","resposta_boolean": false,"context":"WEP és obsolet i vulnerable a atacs, substituït per WPA2 i WPA3."},
{"nivell":"Fàcil 🟢","pregunta":"Un punt d’accés connecta la xarxa cablejada amb la xarxa sense fils.","resposta_boolean": true,"context":"L’Access Point actua com a pont entre xarxes LAN i WLAN."},
{"nivell":"Fàcil 🟢","pregunta":"Wi-Fi 6 també és conegut com a estàndard IEEE 802.11ax.","resposta_boolean": true,"context":"Wi-Fi 6 correspon a l’estàndard 802.11ax i millora l’eficiència i la latència."},
{"nivell":"Fàcil 🟢","pregunta":"Les xarxes Ad-hoc necessiten un punt d’accés per funcionar.","resposta_boolean": false,"context":"El mode Ad-hoc permet connexió directa entre dispositius sense punt d’accés."},
{"nivell":"Fàcil 🟢","pregunta":"La banda de 2,4 GHz té més abast que la de 5 GHz.","resposta_boolean": true,"context":"Les ones de 2,4 GHz travessen millor parets i obstacles, tot i tenir més interferències."},
{"nivell":"Fàcil 🟢","pregunta":"El protocol WPA3 utilitza el mètode d’autenticació SAE.","resposta_boolean": true,"context":"WPA3 millora la seguretat utilitzant el sistema Simultaneous Authentication of Equals (SAE)."},
{"nivell":"Fàcil 🟢","pregunta":"El filtrat MAC és un mètode altament segur per limitar dispositius a una xarxa Wi-Fi.","resposta_boolean": false,"context":"El filtrat MAC és fàcil de falsificar i només serveix com a mesura bàsica."},

{"nivell":"Normal 🟡","pregunta":"L’estàndard 802.11g funciona a la banda de 5 GHz.","resposta_boolean": false,"context":"802.11g funciona a 2,4 GHz amb velocitats de fins a 54 Mbps."},
{"nivell":"Normal 🟡","pregunta":"El Wi-Fi 5 correspon a l’estàndard 802.11ac.","resposta_boolean": true,"context":"Wi-Fi 5 utilitza la banda de 5 GHz i canals de fins a 160 MHz."},
{"nivell":"Normal 🟡","pregunta":"El protocol 802.1X permet autenticar usuaris de manera centralitzada.","resposta_boolean": true,"context":"S’utilitza amb servidors RADIUS en entorns corporatius per gestionar l’accés."},
{"nivell":"Normal 🟡","pregunta":"El Beamforming permet concentrar el senyal cap al dispositiu receptor.","resposta_boolean": true,"context":"Aquesta tècnica millora la qualitat i potència del senyal en Wi-Fi 5 i 6."},
{"nivell":"Normal 🟡","pregunta":"El WPA2 utilitza RC4 com a algoritme de xifrat principal.","resposta_boolean": false,"context":"WPA2 utilitza AES-CCMP, mentre que RC4 s’utilitzava en WEP i WPA (TKIP)."},
{"nivell":"Normal 🟡","pregunta":"Els canals 1, 6 i 11 de 2,4 GHz no se solapen entre ells.","resposta_boolean": true,"context":"Aquests tres canals són els recomanats per minimitzar interferències."},
{"nivell":"Normal 🟡","pregunta":"L’OFDMA és una tecnologia introduïda amb Wi-Fi 6 per millorar l’eficiència.","resposta_boolean": true,"context":"Divideix els canals en subportadores per gestionar diversos usuaris alhora."},
{"nivell":"Normal 🟡","pregunta":"WMM (Wi-Fi Multimedia) serveix per millorar la seguretat de la connexió.","resposta_boolean": false,"context":"WMM regula la qualitat de servei (QoS), no la seguretat."},
{"nivell":"Normal 🟡","pregunta":"La banda de 5 GHz ofereix més canals i menys interferències que la de 2,4 GHz.","resposta_boolean": true,"context":"És ideal per entorns amb molts dispositius i menys obstacles."},
{"nivell":"Normal 🟡","pregunta":"Les xarxes Mesh requereixen que tots els nodes estiguin connectats per cable.","resposta_boolean": false,"context":"Els nodes Mesh es comuniquen sense fils entre ells per ampliar cobertura."},
{"nivell":"Normal 🟡","pregunta":"Els punts d’accés gestionats per un controlador poden compartir configuració automàticament.","resposta_boolean": true,"context":"Els controladors centralitzen la gestió, actualització i política de seguretat dels APs."},
{"nivell":"Normal 🟡","pregunta":"El roaming Wi-Fi permet moure’s entre punts d’accés sense perdre connexió.","resposta_boolean": true,"context":"És una funcionalitat essencial per xarxes d’alta mobilitat com hospitals o universitats."},
{"nivell":"Normal 🟡","pregunta":"WPA3 és menys segur que WPA2.","resposta_boolean": false,"context":"WPA3 millora la protecció davant atacs de força bruta i xifratge més robust."},
{"nivell":"Normal 🟡","pregunta":"La tecnologia MU-MIMO permet a un punt d’accés enviar dades a diversos dispositius alhora.","resposta_boolean": true,"context":"Millora la capacitat total del sistema i redueix la latència."},
{"nivell":"Normal 🟡","pregunta":"Un site survey s’utilitza per optimitzar la configuració de seguretat de la xarxa.","resposta_boolean": false,"context":"Un site survey serveix per analitzar cobertura i interferències, no seguretat."},
{"nivell":"Normal 🟡","pregunta":"La Wi-Fi Alliance és l’organisme que defineix els estàndards tècnics IEEE.","resposta_boolean": false,"context":"IEEE defineix els estàndards; la Wi-Fi Alliance certifica la interoperabilitat."},

{"nivell":"Difícil 🔵","pregunta":"L’estàndard 802.11e defineix la qualitat de servei (QoS) en xarxes Wi-Fi.","resposta_boolean": true,"context":"Permet prioritzar trànsit multimèdia com veu i vídeo."},
{"nivell":"Difícil 🔵","pregunta":"El 802.11n va ser el primer estàndard que va introduir canals de 40 MHz.","resposta_boolean": true,"context":"Aquesta ampliació de canal va duplicar la velocitat respecte als 20 MHz anteriors."},
{"nivell":"Difícil 🔵","pregunta":"Els canals DFS serveixen per reduir el consum energètic del punt d’accés.","resposta_boolean": false,"context":"DFS (Dynamic Frequency Selection) evita interferir amb radars meteorològics o militars."},
{"nivell":"Difícil 🔵","pregunta":"Wi-Fi 7 utilitza modulació 4096-QAM per augmentar la capacitat de dades.","resposta_boolean": true,"context":"Cada símbol pot codificar més bits, millorant la velocitat de transmissió."},
{"nivell":"Difícil 🔵","pregunta":"802.11k ajuda al dispositiu a conèixer els punts d’accés veïns per millorar el roaming.","resposta_boolean": true,"context":"Forma part dels mecanismes d’optimització de la mobilitat Wi-Fi."},
{"nivell":"Difícil 🔵","pregunta":"El protocol 802.11a opera exclusivament a 2,4 GHz.","resposta_boolean": false,"context":"802.11a opera a 5 GHz amb 54 Mbps i menys interferències."},
{"nivell":"Difícil 🔵","pregunta":"L’ESS (Extended Service Set) està format per diversos BSS interconnectats.","resposta_boolean": true,"context":"Permet ampliar cobertura sense perdre el mateix SSID."},
{"nivell":"Difícil 🔵","pregunta":"El Beamforming redueix la potència total d’emissió per complir la normativa europea.","resposta_boolean": false,"context":"El Beamforming dirigeix el senyal cap al dispositiu, no redueix potència global."},
{"nivell":"Difícil 🔵","pregunta":"WPA2 utilitza el mètode de xifrat AES-CCMP.","resposta_boolean": true,"context":"AES-CCMP garanteix confidencialitat i integritat de dades en WPA2."},
{"nivell":"Difícil 🔵","pregunta":"L’OFDMA és exclusiu de Wi-Fi 7.","resposta_boolean": false,"context":"OFDMA es va introduir amb Wi-Fi 6 (802.11ax) per millorar l’eficiència."},

{"nivell":"Avançada 🟣","pregunta":"Target Wake Time (TWT) redueix el consum energètic dels dispositius Wi-Fi 6.","resposta_boolean": true,"context":"TWT permet programar quan els dispositius s’activen per comunicar-se."},
{"nivell":"Avançada 🟣","pregunta":"El Wi-Fi Sensing permet detectar moviment utilitzant variacions del senyal Wi-Fi.","resposta_boolean": true,"context":"Aquesta tecnologia s’aplica en seguretat o detecció de presència."},
{"nivell":"Avançada 🟣","pregunta":"Wi-Fi 7 funciona exclusivament a la banda de 6 GHz.","resposta_boolean": false,"context":"Wi-Fi 7 pot utilitzar 2,4, 5 i 6 GHz simultàniament."},
{"nivell":"Avançada 🟣","pregunta":"L’estàndard 802.11ax millora el rendiment especialment en entorns amb molts dispositius connectats.","resposta_boolean": true,"context":"Wi-Fi 6 optimitza la gestió d’usuaris simultanis amb OFDMA i MU-MIMO."},
{"nivell":"Avançada 🟣","pregunta":"Les xarxes Wi-Fi Mesh necessiten configuració manual entre tots els nodes.","resposta_boolean": false,"context":"Els nodes Mesh s’autoconfiguren per mantenir la connectivitat automàticament."},
{"nivell":"Avançada 🟣","pregunta":"WPA3 utilitza una autenticació oberta sense contrasenya en tots els casos.","resposta_boolean": false,"context":"Només el mode 'Enhanced Open' de WPA3 permet connexió sense contrasenya, però amb xifrat."},
{"nivell":"Avançada 🟣","pregunta":"El 802.11r redueix el temps de traspàs durant el roaming entre punts d’accés.","resposta_boolean": true,"context":"802.11r optimitza el handoff, millorant la continuïtat de connexió en moviments ràpids."},
{"nivell":"Avançada 🟣","pregunta":"Wi-Fi 6E utilitza canals de fins a 320 MHz.","resposta_boolean": false,"context":"Els canals de 320 MHz s’introdueixen amb Wi-Fi 7, no amb Wi-Fi 6E."},
{"nivell":"Avançada 🟣","pregunta":"El Wi-Fi 6 suporta compatibilitat enrere amb dispositius Wi-Fi 5 i Wi-Fi 4.","resposta_boolean": true,"context":"Els estàndards IEEE mantenen compatibilitat retroactiva per facilitar la transició."},
{"nivell":"Avançada 🟣","pregunta":"El BSS és la zona coberta per un conjunt de punts d’accés interconnectats.","resposta_boolean": false,"context":"El BSS correspon a la cobertura d’un sol punt d’accés; diversos BSS formen un ESS."}
]
