[
  {
    "nivell": "Fàcil 🟢",
    "pregunta": "La UNE 178104 defineix les capes tècniques i d'interoperabilitat de les ciutats intel·ligents.",
    "resposta_boolean": true,
    "context": "La UNE 178104 és la norma que estableix l'arquitectura en capes (adquisició, serveis, Open Data, coneixement)."
  },
  {
    "nivell": "Fàcil 🟢",
    "pregunta": "Sentilo forma part de la capa d’Open Data de la UNE 178104.",
    "resposta_boolean": false,
    "context": "Sentilo està a la capa d’adquisició (IoT), que recull dades dels sensors, no a la d’Open Data."
  },
  {
    "nivell": "Normal 🟡",
    "pregunta": "La UNE 178201 defineix indicadors i mètriques per mesurar la intel·ligència d’una ciutat.",
    "resposta_boolean": true,
    "context": "Aquesta norma fixa indicadors per governança, mobilitat, sostenibilitat i qualitat de vida."
  },
  {
    "nivell": "Normal 🟡",
    "pregunta": "La UNE 178501 és una norma de seguretat informàtica per a ciutats intel·ligents.",
    "resposta_boolean": false,
    "context": "La UNE 178501 regula el Sistema de Gestió Integral de Ciutat (SGCI), similar a una ISO 9001."
  },
  {
    "nivell": "Fàcil 🟢",
    "pregunta": "La UNE 178108 tracta la seguretat i la privadesa en entorns Smart City.",
    "resposta_boolean": true,
    "context": "És la norma de seguretat complementària a l'ENS i al RGPD."
  },
  {
    "nivell": "Normal 🟡",
    "pregunta": "La interoperabilitat i la integració signifiquen exactament el mateix.",
    "resposta_boolean": false,
    "context": "Interoperabilitat implica compatibilitat semàntica i tècnica; integració és només connexió tècnica."
  },
  {
    "nivell": "Difícil 🔵",
    "pregunta": "Les dades obertes (Open Data) no estan subjectes al RGPD.",
    "resposta_boolean": false,
    "context": "Les dades obertes han d’estar anonimitzades abans de la publicació per complir el RGPD."
  },
  {
    "nivell": "Normal 🟡",
    "pregunta": "La UNE 178102 regula els requisits d’interoperabilitat entre plataformes urbanes.",
    "resposta_boolean": true,
    "context": "És la norma tècnica que assegura que diferents sistemes puguin intercanviar informació."
  },
  {
    "nivell": "Difícil 🔵",
    "pregunta": "La UNE 178301 només s’aplica a ciutats costaneres amb turisme de platja.",
    "resposta_boolean": false,
    "context": "Aplica a qualsevol destinació turística intel·ligent, urbana o rural."
  },
  {
    "nivell": "Normal 🟡",
    "pregunta": "El Sistema de Gestió Integral de Ciutat (UNE 178501) busca la millora contínua.",
    "resposta_boolean": true,
    "context": "Funciona com un model de gestió de qualitat per a ciutats, basat en millora contínua."
  },
  {
    "nivell": "Difícil 🔵",
    "pregunta": "Els indicadors de la UNE 178201 provenen de la ISO 9001 sobre qualitat.",
    "resposta_boolean": false,
    "context": "Provenen de la ISO 37120, dedicada a indicadors urbans i qualitat de vida."
  },
  {
    "nivell": "Fàcil 🟢",
    "pregunta": "Una ciutat és intel·ligent només quan té molts sensors instal·lats.",
    "resposta_boolean": false,
    "context": "No n'hi ha prou amb tecnologia; cal gestió, sostenibilitat i participació ciutadana."
  },
  {
    "nivell": "Normal 🟡",
    "pregunta": "El Big Data permet analitzar grans volums de dades urbanes.",
    "resposta_boolean": true,
    "context": "És essencial per transformar dades de sensors en informació útil per a la ciutat."
  },
  {
    "nivell": "Difícil 🔵",
    "pregunta": "La UNE 178104 estableix que la capa de coneixement recull dades dels sensors.",
    "resposta_boolean": false,
    "context": "La capa d’adquisició recull dades; la capa de coneixement genera anàlisi i valor."
  },
  {
    "nivell": "Avançada 🟣",
    "pregunta": "Les normes UNE 178 substitueixen les ISO 9001 i 20000 dins de les ciutats intel·ligents.",
    "resposta_boolean": false,
    "context": "No les substitueixen; les UNE178 s’hi alineen i les complementen."
  },
  {
    "nivell": "Normal 🟡",
    "pregunta": "La governança oberta és un principi clau dins de la UNE 178501.",
    "resposta_boolean": true,
    "context": "El sistema de gestió integral inclou transparència, participació i sostenibilitat."
  },
  {
    "nivell": "Difícil 🔵",
    "pregunta": "La capa d’interoperabilitat és la responsable de publicar dades obertes.",
    "resposta_boolean": false,
    "context": "La publicació de dades obertes correspon a la capa d’Open Data, no la d’interoperabilitat."
  },
  {
    "nivell": "Fàcil 🟢",
    "pregunta": "L’ordre tecnològic correcte és IoT, després Big Data i finalment BI.",
    "resposta_boolean": true,
    "context": "És la seqüència funcional típica en una Smart City: captació → anàlisi → decisió."
  },
  {
    "nivell": "Avançada 🟣",
    "pregunta": "Una ciutat pot obtenir la certificació UNE 178501 sense integrar Open Data.",
    "resposta_boolean": false,
    "context": "L’ús d’Open Data és un requisit fonamental dins del Sistema de Gestió Integral de Ciutat."
  },
  {
    "nivell": "Normal 🟡",
    "pregunta": "La UNE 178108 requereix l’anàlisi de riscos i impacte sobre privadesa.",
    "resposta_boolean": true,
    "context": "És un dels requisits clau de la norma per protegir la informació urbana i personal."
  }
]
