{
  "subjectId": "T63",
  "origin": "notebooklm",
  "flashcards": [
    {
      "f": "¿Qué es un protocolo en el contexto de redes?",
      "b": "Un conjunto de reglas que definen cómo se comunican los dispositivos dentro de una red."
    },
    {
      "f": "¿Cuál es el objetivo principal de los modelos de red como OSI y TCP/IP?",
      "b": "Permitir la interoperabilidad entre sistemas de diferentes fabricantes."
    },
    {
      "f": "¿Cuántas capas tiene el modelo OSI y cuántas tiene el modelo TCP/IP?",
      "b": "El modelo OSI tiene 7 capas, mientras que el modelo TCP/IP tiene 4 capas."
    },
    {
      "f": "En el modelo TCP/IP, ¿qué capas del modelo OSI se fusionan en la Capa de aplicación?",
      "b": "Las capas de Aplicación, Presentación y Sesión del modelo OSI."
    },
    {
      "f": "¿Cuál es la función principal de la Capa de transporte en el modelo TCP/IP?",
      "b": "Gestionar el control de flujo y las conexiones entre aplicaciones."
    },
    {
      "f": "Menciona dos protocolos de la Capa de transporte del modelo TCP/IP.",
      "b": "TCP (Transmission Control Protocol) y UDP (User Datagram Protocol)."
    },
    {
      "f": "¿De qué se encarga la Capa de internet en el modelo TCP/IP?",
      "b": "Del direccionamiento y encaminamiento de paquetes."
    },
    {
      "f": "¿Qué función cumple la Capa de acceso a la red en el modelo TCP/IP?",
      "b": "Se encarga de la transmisión física y el acceso al medio."
    },
    {
      "f": "El protocolo IP (Internet Protocol) es responsable de la fiabilidad y el orden de los paquetes. ¿Verdadero o falso?",
      "b": "Falso. El protocolo IP no garantiza la fiabilidad ni el orden; de eso se encarga TCP."
    },
    {
      "f": "¿Cuál es la longitud de una dirección IPv4 y una dirección IPv6?",
      "b": "IPv4 tiene 32 bits y IPv6 tiene 128 bits."
    },
    {
      "f": "¿Qué define la máscara de subred (subnet mask) en el direccionamiento IPv4?",
      "b": "Define qué parte de la dirección IP corresponde a la red y qué parte al host."
    },
    {
      "f": "El protocolo que traduce una dirección IP a una dirección MAC se llama _____.",
      "b": "ARP (Address Resolution Protocol)."
    },
    {
      "f": "¿Para qué se utiliza el protocolo ICMP (Internet Control Message Protocol)?",
      "b": "Para enviar mensajes de control y error, como los utilizados por el comando 'ping'."
    },
    {
      "f": "El protocolo _____ asigna direcciones IP de forma automática a los dispositivos en una red.",
      "b": "DHCP (Dynamic Host Configuration Protocol)."
    },
    {
      "f": "¿Cuál es la función del DNS (Domain Name System)?",
      "b": "Resolver o traducir nombres de dominio (ej. www.google.com) a direcciones IP."
    },
    {
      "f": "Entre TCP y UDP, ¿cuál es orientado a conexión y garantiza la entrega ordenada de paquetes?",
      "b": "TCP (Transmission Control Protocol)."
    },
    {
      "f": "¿En qué casos de uso es preferible utilizar UDP en lugar de TCP?",
      "b": "En aplicaciones donde la velocidad es más importante que la fiabilidad, como streaming de video, VoIP o juegos en línea."
    },
    {
      "f": "¿Cuál es el objetivo principal de MPLS (Multiprotocol Label Switching)?",
      "b": "Mejorar la velocidad y la eficiencia del encaminamiento de paquetes en la red."
    },
    {
      "f": "En lugar de usar direcciones IP, MPLS toma decisiones de encaminamiento basándose en _____ que asigna a los paquetes.",
      "b": "Etiquetas (labels)."
    },
    {
      "f": "¿Qué componente de una red MPLS añade y elimina las etiquetas de los paquetes en los bordes de la red?",
      "b": "El LER (Label Edge Router)."
    },
    {
      "f": "¿Qué función realiza un LSR (Label Switch Router) en una red MPLS?",
      "b": "Reenvía los paquetes basándose únicamente en el valor de la etiqueta MPLS, sin consultar la dirección IP."
    },
    {
      "f": "Una de las principales ventajas de MPLS es su capacidad para implementar _____ y _____.",
      "b": "VPNs (Redes Privadas Virtuales) y QoS (Calidad de Servicio)."
    },
    {
      "f": "¿Qué herramienta de diagnóstico se utiliza para comprobar la conectividad entre dos dispositivos usando el protocolo ICMP?",
      "b": "ping."
    },
    {
      "f": "¿Qué comando muestra la ruta completa (los saltos o routers intermedios) que sigue un paquete hasta su destino?",
      "b": "traceroute (en Linux/macOS) o tracert (en Windows)."
    },
    {
      "f": "El comando `ipconfig` (en Windows) o `ifconfig` (en Linux) sirve para _____.",
      "b": "Mostrar la configuración IP del equipo local."
    },
    {
      "f": "¿Qué herramienta se utiliza para comprobar la resolución de nombres de dominio (DNS)?",
      "b": "nslookup o dig."
    },
    {
      "f": "En la capa de Presentación (capa 6) del modelo OSI, ¿qué funciones se realizan?",
      "b": "Codificación de datos y cifrado (por ejemplo, SSL/TLS)."
    },
    {
      "f": "Cada paquete IP transporta un valor llamado TTL. ¿Qué significa y para qué sirve?",
      "b": "Significa Time To Live (Tiempo de Vida) y evita bucles infinitos descartando el paquete después de un número máximo de saltos."
    },
    {
      "f": "¿A qué clase de dirección IPv4 pertenece la IP 150.214.94.1?",
      "b": "Clase B, ya que el rango para la Clase B es de 128.0.0.0 a 191.255.255.255."
    },
    {
      "f": "¿Qué rango de direcciones IP está reservado para multicast?",
      "b": "El rango de la Clase D (224.0.0.0 a 239.255.255.255)."
    },
    {
      "f": "La dirección IP 127.0.0.1 se conoce como dirección de _____.",
      "b": "loopback (bucle local)."
    },
    {
      "f": "¿Qué es el subnetting (creación de subredes)?",
      "b": "Es el proceso de dividir una red grande en varias redes más pequeñas y manejables."
    },
    {
      "f": "Con una máscara de subred 255.255.255.0, ¿cuál es la dirección de broadcast para la IP 192.168.1.15?",
      "b": "192.168.1.255."
    },
    {
      "f": "¿Qué significa la notación CIDR, por ejemplo, /24?",
      "b": "Indica el número de bits que se utilizan para la porción de red de la dirección IP. /24 equivale a una máscara 255.255.255.0."
    },
    {
      "f": "Menciona uno de los rangos de direcciones IP privadas.",
      "b": "10.0.0.0/8, 172.16.0.0/12, o 192.168.0.0/16."
    },
    {
      "f": "¿Qué tecnología permite que múltiples dispositivos con IPs privadas en una LAN salgan a Internet usando una única IP pública?",
      "b": "NAT (Network Address Translation)."
    },
    {
      "f": "El protocolo _____ se utilizaba antiguamente para traducir una dirección MAC a una IP, siendo el inverso de ARP.",
      "b": "RARP (Reverse Address Resolution Protocol)."
    },
    {
      "f": "En el contexto de TCP, ¿qué es un ACK?",
      "b": "Es un acuse de recibo (acknowledgement) que se envía para confirmar la recepción correcta de un paquete."
    },
    {
      "f": "En MPLS, ¿qué es una FEC (Forwarding Equivalence Class)?",
      "b": "Es un grupo de paquetes que reciben el mismo tratamiento y siguen el mismo camino a través de la red MPLS."
    },
    {
      "f": "¿Qué es la Ingeniería de Tráfico (Traffic Engineering) en el contexto de MPLS?",
      "b": "Es la capacidad de definir rutas específicas y predeterminadas (LSP) para los flujos de datos, evitando congestiones y optimizando el uso de la red."
    },
    {
      "f": "Un LSP (Label Switched Path) en MPLS es _____.",
      "b": "Una ruta predefinida de alto rendimiento que siguen los paquetes con una etiqueta específica."
    },
    {
      "f": "¿Qué protocolo utiliza la herramienta `netstat` para mostrar información?",
      "b": "Muestra información sobre conexiones y puertos abiertos de los protocolos TCP y UDP."
    },
    {
      "f": "ERROR COMÚN: El modelo OSI es el que se implementa de forma práctica en Internet.",
      "b": "Falso. El modelo OSI es un modelo de referencia teórico; el que se implementa en la práctica es el modelo TCP/IP."
    },
    {
      "f": "PREGUNTA TRAMPA: ¿El protocolo IP asegura que los paquetes lleguen en orden?",
      "b": "No, IP no garantiza el orden. La ordenación de paquetes es una función de TCP, en la capa de transporte."
    },
    {
      "f": "ERROR COMÚN: La dirección IP 127.0.0.1 es una IP pública para pruebas.",
      "b": "Falso. Es una dirección de loopback, reservada para la comunicación local con el propio dispositivo y no es pública."
    },
    {
      "f": "PREGUNTA TRAMPA: ¿El protocolo ARP funciona para resolver IPs de dispositivos en otras redes remotas?",
      "b": "No, ARP solo funciona para resolver direcciones IP a MAC dentro de la misma red local (LAN)."
    },
    {
      "f": "ERROR COMÚN: Se confunde DNS con DHCP. ¿Qué hace cada uno?",
      "b": "DNS traduce nombres de dominio a IP. DHCP asigna configuraciones de red (incluida la IP) automáticamente."
    },
    {
      "f": "PREGUNTA TRAMPA: ¿El protocolo `ping` utiliza TCP para verificar la conectividad?",
      "b": "Falso. `ping` utiliza el protocolo ICMP."
    },
    {
      "f": "ERROR COMÚN: MPLS sustituye al protocolo IP.",
      "b": "Falso. MPLS no sustituye a IP, sino que se añade como una capa de conmutación inteligente sobre la infraestructura IP para optimizar el enrutamiento."
    },
    {
      "f": "PREGUNTA TRAMPA: ¿Un router LSR es el encargado de asignar y eliminar etiquetas MPLS?",
      "b": "Falso. El que asigna y elimina etiquetas es el LER (Label Edge Router) en los bordes de la red. El LSR solo conmuta (intercambia) etiquetas."
    },
    {
      "f": "PREGUNTA TRAMPA: ¿La principal ventaja de MPLS es el cifrado de datos para crear VPNs seguras?",
      "b": "Falso. MPLS permite crear VPNs, pero su principal ventaja es la eficiencia y la QoS. MPLS por sí mismo no cifra el tráfico."
    },
    {
      "f": "¿Qué es la fragmentación IP?",
      "b": "Es el proceso de dividir un paquete IP grande en fragmentos más pequeños para que pueda ser transmitido por una red con una MTU (Maximum Transmission Unit) menor."
    },
    {
      "f": "El protocolo _____ se usa para el encaminamiento entre grandes sistemas autónomos (proveedores de Internet), mientras que _____ se usa para encaminamiento interno dentro de una organización.",
      "b": "BGP (Border Gateway Protocol) y OSPF (Open Shortest Path First)."
    },
    {
      "f": "Un puerto TCP/UDP sirve para _____.",
      "b": "Identificar el servicio o aplicación específica dentro de un dispositivo al que va destinado un paquete (ej. puerto 80 para HTTP)."
    },
    {
      "f": "¿En qué capa del modelo TCP/IP operan los protocolos HTTP, FTP y SMTP?",
      "b": "En la Capa de aplicación."
    },
    {
      "f": "El encaminamiento (routing) se produce en la capa de _____ y se basa en direcciones _____, mientras que la conmutación (switching) ocurre en la capa de _____ y se basa en direcciones _____.",
      "b": "Internet (IP), Enlace de datos (MAC)."
    },
    {
      "f": "¿Cuál es el rango de direcciones privadas definido en la RFC 1918 para redes de tamaño mediano?",
      "b": "172.16.0.0 a 172.31.255.255 (notación CIDR: 172.16.0.0/12)."
    },
    {
      "f": "En el modelo OSI, ¿cuál es la función de la Capa de Sesión (capa 5)?",
      "b": "Gestionar el establecimiento, mantenimiento y terminación de las conexiones (sesiones) entre aplicaciones."
    },
    {
      "f": "¿Qué significa que TCP realiza un 'three-way handshake'?",
      "b": "Es el proceso de tres pasos (SYN, SYN-ACK, ACK) que utiliza para establecer una conexión fiable antes de enviar datos."
    },
    {
      "f": "Si un paquete tiene como destino la dirección 255.255.255.255, ¿a quién va dirigido?",
      "b": "Es una dirección de broadcast general, dirigida a todos los dispositivos en la misma red local."
    }
  ]
}