[
  {
    "nivell": "Fcil ",
    "fitxer": "OPOS23_preguntes_practic.pdf",
    "pregunta": "Per tal de definir el nou plec, es defineix que l'estrat猫gia tecnol貌gica corporativa passa per disposar d'un datacenter definit per software. En aquest context, qu猫 茅s un datacenter definit per software?",
    "resposta_correcta": "Un centre de dades en el qual la infraestructura es virtualitza mitjan莽ant l'abstracci贸, la creaci贸 de grups de recursos i l'automatitzaci贸.",
    "respostes_incorrectes": [
      "Un centre de dades en el qual s'utilitzen 煤nicament servidors f铆sics per emmagatzemar i processar dades.",
      "Un centre de dades on tots els recursos es troben definits al meta-verso mitjan莽ant un programari.",
      "Un centre de dades en el qual s'utilitzen 煤nicament dispositius porttils per emmagatzemar i processar dades."
    ],
    "context": "Pregunta conceptual sobre la definici贸 de SDDC. El SDDC implica virtualitzaci贸 completa dels recursos del CPD (clcul, emmagatzematge, xarxes) amb gesti贸 centralitzada per software i automatitzaci贸. La clau 茅s la desconnexi贸 entre maquinari f铆sic i la seva gesti贸 l貌gica."
  },
  {
    "nivell": "Normal ",
    "fitxer": "OPOS23_preguntes_practic.pdf",
    "pregunta": "Amb quina tecnologia podem desacoblar el programari d'emmagatzematge del maquinari subjacents i proporcionar una plataforma de gesti贸 comuna i serveis de dades en una infraestructura de TI (tecnologia de la informaci贸)?",
    "resposta_correcta": "SDS (Software-defined storage).",
    "respostes_incorrectes": [
      "VPC (Virtual Private Cloud).",
      "SDN (Software defined networking).",
      "Hypervisor."
    ],
    "context": "Pregunta sobre un component clau del SDDC: el Software Defined Storage (SDS). Aquesta tecnologia permet gestionar lemmagatzematge com a servei virtual independent del hardware, amb pol铆tiques de rendiment, disponibilitat i redundncia definides per programari."
  },
  {
    "nivell": "Normal ",
    "fitxer": "OPOS23_preguntes_practic.pdf",
    "pregunta": "Per tal de donar suport a l'equip, et demanen la revisi贸 de les seccions que descriuen els requisits dels serveis d'emmagatzemament. Uns dels requeriments principals por donar suport a lemmagatzematge, 茅s la definici贸 duna xarxa per la transfer猫ncia de dades entre sistemes informtics i elements d'emmagatzematge. Sota aquesta definici贸 estem demanant:",
    "resposta_correcta": "Una Storage Area Network (SAN).",
    "respostes_incorrectes": [
      "Una cabina dobjectes S3.",
      "Una xarxa MPLS (Multiprotocol Label Switching).",
      "Una connexi贸 privada Lan to Lan."
    ],
    "context": "Pregunta aplicada dins del context de virtualitzaci贸 demmagatzematge. La SAN 茅s la infraestructura f铆sica que suporta el SDS, proporcionant alta velocitat i connectivitat entre servidors i discos. s essencial per implementar un SDDC eficient."
  }
]
