[
  {
    "guid": "f69c7e42-3481-46de-8573-8e60d5b194f7",
    "subjectId": "T02",
    "difficulty": 2,
    "origin": "OPOS21_preguntes_especific.pdf",
    "type": "opos21",
    "question": "En què es caracteritza la Transformació Digital? (Identifiqueu l’afirmació FALSA)",
    "answerOptions": [
      {
        "text": "A. Trasllada els processos existents a una organització al món digital de manera ràpida i sense canvis significatius.",
        "isCorrect": true,
        "rationale": "Aquesta opció és falsa, ja que la transformació digital no consisteix només a digitalitzar processos existents sinó a repensar-los i innovar."
      },
      {
        "text": "B. Té per objectiu adaptar-se a la persona usuària en l’era digital, millorant la seva experiència.",
        "isCorrect": false,
        "rationale": "És cert: la transformació digital busca centrar-se en l’experiència de l’usuari."
      },
      {
        "text": "C. Aprofundeix en les tècniques d’anàlisi de dades com a instrument clau per a la presa de decisions.",
        "isCorrect": false,
        "rationale": "Correcte: la transformació digital impulsa la gestió basada en dades."
      },
      {
        "text": "D. Impulsa la innovació i el treball col·laboratiu com a instruments de millora contínua de les organitzacions.",
        "isCorrect": false,
        "rationale": "Cert: innovació i col·laboració són pilars bàsics de la transformació digital."
      }
    ],
    "hint": "Pensa que la transformació digital va més enllà de la simple digitalització de processos."
  },
  {
    "guid": "e9a4be31-c63b-4f84-9518-4ef6de7b782b",
    "subjectId": "T02",
    "difficulty": 3,
    "origin": "OPOS21_preguntes_especific.pdf",
    "type": "opos21",
    "question": "Quin NO és un principi i/o directriu general dels que despleguen l’Estratègia de transformació digital àgil de l’Ajuntament de Barcelona i els estàndards de serveis digitals, pel que fa al seu disseny, desenvolupament i manteniment?",
    "answerOptions": [
      {
        "text": "A. Adreçat a la ciutadania.",
        "isCorrect": false,
        "rationale": "Correcte: l’estratègia està orientada a la ciutadania."
      },
      {
        "text": "B. Principi d'eficiència.",
        "isCorrect": false,
        "rationale": "Sí, és un principi essencial de la transformació digital municipal."
      },
      {
        "text": "C. Serveis integrats i integrals.",
        "isCorrect": false,
        "rationale": "Forma part dels objectius de transformació digital: integració i interoperabilitat."
      },
      {
        "text": "D. Claredat en objectius i recursos.",
        "isCorrect": true,
        "rationale": "És la incorrecta: tot i ser desitjable, no forma part explícita dels principis de l’estratègia digital àgil de BCN."
      }
    ],
    "hint": "Busca el principi que no forma part explícitament dels estàndards de disseny digital de l’Ajuntament."
  },
  {
    "guid": "cf0b83f4-8148-4981-8e3d-24d3b86a62de",
    "subjectId": "T02",
    "difficulty": 2,
    "origin": "OPOS23_preguntes_especific.pdf",
    "type": "opos23",
    "question": "La Transformació Digital és un concepte que vincula l’ús de les tecnologies de la informació amb les organitzacions. Quina diferència o relació existeix entre Transformació Digital i Digitalització?",
    "answerOptions": [
      {
        "text": "A. Són sinònims.",
        "isCorrect": false,
        "rationale": "Fals: la transformació digital és un procés més ampli que la simple digitalització."
      },
      {
        "text": "B. La digitalització fa referència a l’adopció de tecnologies de la informació i la comunicació (TIC) i és una activitat continguda en els projectes de Transformació Digital.",
        "isCorrect": true,
        "rationale": "Correcte: la digitalització és una part dins de la transformació digital."
      },
      {
        "text": "C. La transformació digital trasllada els actuals processos de negoci de les empreses al món digital sense considerar cap canvi addicional en la seva manera de funcionar.",
        "isCorrect": false,
        "rationale": "Incorrecte: precisament implica repensar i innovar processos."
      },
      {
        "text": "D. La digitalització només afecta als processos interns de l’organització.",
        "isCorrect": false,
        "rationale": "No és correcte: també impacta en clients, proveïdors i ciutadans."
      }
    ],
    "hint": "La digitalització és un subconcepte dins la transformació digital, que és molt més global."
  },
  {
    "guid": "b4c2dca2-26a4-4f8c-84b8-98077d836a12",
    "subjectId": "T02",
    "difficulty": 3,
    "origin": "OPOS23_preguntes_especific.pdf",
    "type": "opos23",
    "question": "Pel que fa a l’impacte en les Tecnologies i Sistemes d’una organització que impulsa la Transformació Digital, quina d’aquestes afirmacions és CORRECTA?",
    "answerOptions": [
      {
        "text": "A. S’ha de mantenir la segmentació dels equips dels departaments de Tecnologies de la Informació (TI), treballant de manera diferenciada per a garantir i assolir els objectius de cadascun d’ells per separat.",
        "isCorrect": false,
        "rationale": "Fals: la transformació digital promou equips integrats i col·laboratius."
      },
      {
        "text": "B. Cal enfocar-se en adaptar de manera precisa i singular les solucions que es posen a disposició de l’organització, independentment dels esforços o dificultats que suposi el manteniment posterior.",
        "isCorrect": false,
        "rationale": "Fals: l’objectiu és l’eficiència i sostenibilitat, no la complexitat."
      },
      {
        "text": "C. Proporcionar una base tècnica estable i adequada per als objectius a curt i llarg termini, així com obrir-se a adoptar tecnologies estàndards obertes i interoperables.",
        "isCorrect": true,
        "rationale": "Correcte: les tecnologies obertes i interoperables són fonamentals per a la transformació digital sostenible."
      },
      {
        "text": "D. El Departament de TI ha de liderar les iniciatives de transformació que s’identifiquin a l’organització, de manera que alliberi d’aquesta tasca als àmbits responsables dels serveis.",
        "isCorrect": false,
        "rationale": "Fals: la transformació digital és transversal i compartida, no exclusiva de TI."
      }
    ],
    "hint": "La clau és la interoperabilitat i l’estabilitat tècnica com a base del canvi."
  }
]
