[
  {
    "guid": "e7fbbcd1-bd6a-4b77-8a4f-f9a2e64caa3a",
    "subjectId": "T3",
    "difficulty": 2,
    "origin": "OPOS19_preguntes_especific.pdf",
    "type": "opos19",
    "question": "Respecte a la construcció del Bussines Case d’un projecte, quina de les següents opcions és CERTA?",
    "answerOptions": [
      {
        "text": "A. Cal considerar només aspectes econòmic – financers.",
        "isCorrect": false,
        "rationale": "Incorrecte — el business case ha d’incloure també criteris qualitatius i estratègics, no només econòmics."
      },
      {
        "text": "B. Cal considerar aspectes no financers, però intentar reduir-los a una valoració econòmica.",
        "isCorrect": true,
        "rationale": "Correcte — els aspectes no financers poden tenir un valor intangible, però es recomana traduir-los a una valoració econòmica per facilitar la comparació."
      },
      {
        "text": "C. No es poden introduir aspectes que necessitin establir suposicions. Només es basa en certeses.",
        "isCorrect": false,
        "rationale": "Incorrecte — un business case pot contenir estimacions o hipòtesis raonables."
      },
      {
        "text": "D. Els aspectes socials no hi tenen cabuda.",
        "isCorrect": false,
        "rationale": "Incorrecte — els aspectes socials i organitzatius són part de la justificació del projecte, especialment al sector públic."
      }
    ],
    "hint": "Recorda que un Business Case inclou tant aspectes econòmics com no econòmics, sempre que aportin valor a la decisió."
  },
  {
    "guid": "d2ae42b8-54c1-45a0-bb87-bf38a94d94db",
    "subjectId": "T3",
    "difficulty": 1,
    "origin": "OPOS19_preguntes_practic.pdf",
    "type": "opos19",
    "question": "Un “bussines case” es crea com a resultat d’una necessitat de l’organització, una petició de client o per un requeriment legal, entre d’altres. Quins dels següents continguts haurà de contenir típicament? (Assenyala dues respostes).",
    "answerOptions": [
      {
        "text": "A. Les necessitats de negoci.",
        "isCorrect": true,
        "rationale": "Correcte — un business case sempre descriu les necessitats o oportunitats de negoci que justifiquen la inversió."
      },
      {
        "text": "B. L’anàlisi de cost-benefici.",
        "isCorrect": true,
        "rationale": "Correcte — l’anàlisi de cost-benefici és part fonamental per comparar opcions i avaluar la viabilitat econòmica."
      },
      {
        "text": "C. Detall de les tasques a realitzar en el projecte.",
        "isCorrect": false,
        "rationale": "Incorrecte — això correspon al pla de projecte, no al business case."
      },
      {
        "text": "D. Anàlisi de la variància.",
        "isCorrect": false,
        "rationale": "Incorrecte — l’anàlisi de variància s’utilitza en control de projectes, no en la justificació inicial."
      }
    ],
    "hint": "Pensa en què conté un business case: justificació estratègica, costos i beneficis, no detalls d’execució."
  },
  {
    "guid": "ef4bc1a1-8e9a-462c-bbb9-7b1ee6d8c848",
    "subjectId": "T3",
    "difficulty": 3,
    "origin": "OPOS19_preguntes_especific.pdf",
    "type": "opos19",
    "question": "El principi de Sobirania Tecnològica, aplicat a l’adquisició d’una solució TIC fa referència a:",
    "answerOptions": [
      {
        "text": "A. La capacitat de l’Administració de decidir quina marca o producte vol comprar.",
        "isCorrect": false,
        "rationale": "Incorrecte — la sobirania tecnològica no implica llibertat absoluta de marca, sinó independència i sostenibilitat."
      },
      {
        "text": "B. L’adopció de mesures orientades a la reducció del bloqueig tecnològic.",
        "isCorrect": true,
        "rationale": "Correcte — la sobirania tecnològica cerca evitar dependències de proveïdors o tecnologies tancades."
      },
      {
        "text": "C. La identificació de les millors solucions per cobrir una necessitat prèvies a la seva adquisició.",
        "isCorrect": false,
        "rationale": "Incorrecte — això correspon a la prospecció de solucions, no al principi de sobirania tecnològica."
      },
      {
        "text": "D. L’adquisició de tecnologia per part del comandament per a la gestió de l’organització.",
        "isCorrect": false,
        "rationale": "Incorrecte — no està relacionat amb la gestió jeràrquica, sinó amb la llibertat tecnològica."
      }
    ],
    "hint": "La sobirania tecnològica vol evitar dependències de proveïdors i garantir control sobre la tecnologia."
  },
  {
    "guid": "a3279c5b-2db3-48b2-9c1c-5489f8ee55cd",
    "subjectId": "T3",
    "difficulty": 2,
    "origin": "OPOS21_preguntes_especific.pdf",
    "type": "opos21",
    "question": "54. En relació amb el procés per determinar el cost d’un projecte, d’acord amb el PMBOK, quina d’aquestes afirmacions és FALSA?",
    "answerOptions": [
      {
        "text": "A. Caldrà sumar els costos estimats de les activitats individuals o paquets de treball de cara a establir una línia base de costos autoritzada.",
        "isCorrect": false,
        "rationale": "Correcte segons PMBOK — aquest és el procés d’estimació de costos que permet definir la línia base."
      },
      {
        "text": "B. El pressupost del projecte serà la suma de la línia base de costos i la reserva per a contingències.",
        "isCorrect": false,
        "rationale": "Correcte — el pressupost inclou la línia base més les reserves de contingència."
      },
      {
        "text": "C. La línia base de costos és la versió aprovada del pressupost del projecte, però no inclou les reserves de gestió.",
        "isCorrect": false,
        "rationale": "Correcte — la línia base de costos no incorpora les reserves de gestió segons PMBOK."
      },
      {
        "text": "D. El pressupost d’un projecte preveu tots els fons autoritzats per executar el projecte.",
        "isCorrect": true,
        "rationale": "Falsa — el pressupost pot excloure fons no autoritzats o no relacionats amb el projecte aprovat."
      }
    ],
    "hint": "Repasa la diferència entre línia base de costos i pressupost complet amb reserves."
  },
  {
    "guid": "b53191a1-3472-49e4-9984-74b9e870a8d0",
    "subjectId": "T3",
    "difficulty": 3,
    "origin": "OPOS21_preguntes_especific.pdf",
    "type": "opos21",
    "question": "57. D’acord amb el PMBOK, quin és el procés de formalitzar l’acceptació dels lliurables del projecte que s’hagin completat?",
    "answerOptions": [
      {
        "text": "A. Validar l’abast.",
        "isCorrect": true,
        "rationale": "Correcte — el procés de validar l’abast consisteix en l’acceptació formal dels lliurables completats."
      },
      {
        "text": "B. Gestionar l’abast.",
        "isCorrect": false,
        "rationale": "Incorrecte — gestionar l’abast és controlar els canvis i assegurar-se que el treball inclòs està dins del pla."
      },
      {
        "text": "C. Monitorar i controlar el treball del projecte.",
        "isCorrect": false,
        "rationale": "Incorrecte — aquest procés supervisa l’avanç global, però no formalitza l’acceptació."
      },
      {
        "text": "D. Inspecció.",
        "isCorrect": false,
        "rationale": "Incorrecte — la inspecció és una tècnica usada dins del procés, però no és un procés en si."
      }
    ],
    "hint": "El procés de validació implica una aprovació formal per part del client o patrocinador."
  },
  {
    "guid": "ea20c9e1-0f4b-4ce7-8c22-30ddcf84f4b3",
    "subjectId": "T3",
    "difficulty": 2,
    "origin": "OPOS23_preguntes_practic.pdf",
    "type": "opos23",
    "question": "1. La primera decisió a prendre és sota quin marc de treball de Gestió de qualitat de Serveis TIC treballar. Es pren la decisió d’utilitzar ITIL v3 donat que la seva filosofia és globalment reconeguda i perquè proporciona un conjunt de bones pràctiques per a la gestió de serveis TI. Segons ITIL v3, el Cicle de Vida té com a finalitat implementar i gestionar serveis per a que funcionin de manera fluida i amb la màxima eficiència, segons 5 etapes que són:",
    "answerOptions": [
      {
        "text": "A. Planificació – Realització – Verificació – Validació – Millora continua del servei.",
        "isCorrect": false,
        "rationale": "Incorrecte — això correspon al cicle PDCA, no a ITIL."
      },
      {
        "text": "B. Gestió del Catàleg – Disseny – Transició – Operació – Millora continua del servei.",
        "isCorrect": false,
        "rationale": "Incorrecte — la fase inicial d’ITIL és Estratègia, no Gestió del Catàleg."
      },
      {
        "text": "C. Estratègia – Disseny – Transició – Operació – Millora continua del servei.",
        "isCorrect": true,
        "rationale": "Correcte — aquestes són les cinc etapes del cicle de vida ITIL v3."
      },
      {
        "text": "D. Estratègia – Disponibilitat – Capacitat – Continuïtat – Millora continua del servei.",
        "isCorrect": false,
        "rationale": "Incorrecte — aquestes són funcions de disseny del servei, no fases."
      }
    ],
    "hint": "Recorda que ITIL defineix cinc fases del cicle de vida dels serveis."
  },
  {
    "guid": "2c9ad635-7d0b-4633-8bb3-540be5b4b97b",
    "subjectId": "T3",
    "difficulty": 3,
    "origin": "OPOS23_preguntes_practic.pdf",
    "type": "opos23",
    "question": "3. Durant la revisió del Catàleg de Serveis, que va ser desenvolupat per l’equip de TI amb l’objectiu d’estructurar, mesurar, posicionar, optimitzar i crear nous serveis per als clients finals, detectes informació no actualitzada, incompleta o fins i tot errònia. Quina seria la millor actuació segons ITIL v3?",
    "answerOptions": [
      {
        "text": "A. Eliminar la informació incorrecta i publicar una nova versió sense validació.",
        "isCorrect": false,
        "rationale": "Incorrecte — qualsevol canvi al Catàleg de Serveis requereix control de canvis i validació formal."
      },
      {
        "text": "B. Corregir les dades amb el suport del Gestor del Catàleg de Serveis i del Gestor del Nivell de Servei.",
        "isCorrect": true,
        "rationale": "Correcte — ITIL estableix que aquests rols són responsables de la precisió del Catàleg."
      },
      {
        "text": "C. Escalar-ho al Comitè de Direcció per a la seva revisió i aprovació.",
        "isCorrect": false,
        "rationale": "Incorrecte — l’escalat és posterior si el gestor no pot resoldre-ho."
      },
      {
        "text": "D. Mantenir la informació per no afectar la percepció del servei.",
        "isCorrect": false,
        "rationale": "Incorrecte — ITIL promou la transparència i la informació acurada."
      }
    ],
    "hint": "Recorda qui és el responsable d’actualitzar i validar el Catàleg de Serveis en ITIL."
  }
]
