[
  {
    "guid": "c98f3c92-7c14-4f7d-9238-3b0e79d18a55",
    "subjectId": "T04",
    "difficulty": 2,
    "origin": "OPOS23_preguntes_especific.pdf",
    "type": "opos23",
    "question": "38. Segons la norma UNE 166002, quines són les principals etapes dels projectes de I+D+I?",
    "answerOptions": [
      {
        "text": "A. Reservar Pressupost, Identificar Oportunitats, Crear Conceptes, Validar Conceptes, Desenvolupar Solucions.",
        "isCorrect": false,
        "rationale": "Incorrecta: 'Reservar pressupost' no és una etapa formal dins la UNE 166002; forma part de la planificació econòmica, no del procés d’innovació."
      },
      {
        "text": "B. Identificar Oportunitats, Crear Conceptes,  Desenvolupar Solucions, Gestionar el Canvi.",
        "isCorrect": false,
        "rationale": "Incorrecta: manca l’etapa de validació de conceptes i la d’explotació de resultats."
      },
      {
        "text": "C. Identificar Oportunitats, Desenvolupar Solucions, Implantar Serveis.",
        "isCorrect": false,
        "rationale": "Incorrecta: és massa resumida i omet fases essencials com la creació i validació de conceptes."
      },
      {
        "text": "D. Identificar Oportunitats, Crear Conceptes, Validar Conceptes, Desenvolupar Solucions, Explotar Resultats.",
        "isCorrect": true,
        "rationale": "Correcta: aquestes són les etapes definides a la norma UNE 166002 per al cicle complet dels projectes d’R+D+i, des de la identificació d’oportunitats fins a l’explotació dels resultats obtinguts."
      }
    ],
    "hint": "Recorda que la UNE 166002 estructura el procés d’R+D+i des de la detecció d’oportunitats fins a la seva explotació o transferència de resultats."
  },
  {
    "guid": "c98f3c92-7c14-4f7d-9238-3b0e79d18a55",
    "subjectId": "T04",
    "difficulty": 2,
    "origin": "OPOS23_preguntes_especific.pdf",
    "type": "opos23",
    "question": "38. Segons la norma UNE 166002, quines són les principals etapes dels projectes de I+D+I?",
    "answerOptions": [
      {
        "text": "A. Reservar Pressupost, Identificar Oportunitats, Crear Conceptes, Validar Conceptes, Desenvolupar Solucions.",
        "isCorrect": false,
        "rationale": "Incorrecta: 'Reservar pressupost' no és una etapa formal dins la UNE 166002; és part de la planificació econòmica, no del cicle de vida d’innovació."
      },
      {
        "text": "B. Identificar Oportunitats, Crear Conceptes,  Desenvolupar Solucions, Gestionar el Canvi.",
        "isCorrect": false,
        "rationale": "Incorrecta: manca l’etapa de validació i explotació de resultats."
      },
      {
        "text": "C. Identificar Oportunitats, Desenvolupar Solucions, Implantar Serveis.",
        "isCorrect": false,
        "rationale": "Incorrecta: massa resumida; omet fases essencials com la creació i validació de conceptes."
      },
      {
        "text": "D. Identificar Oportunitats, Crear Conceptes, Validar Conceptes, Desenvolupar Solucions, Explotar Resultats.",
        "isCorrect": true,
        "rationale": "Correcta: són les etapes establertes per la UNE 166002 per al procés complet d’R+D+i."
      }
    ],
    "hint": "Recorda que la UNE 166002 estructura el procés d’innovació des de la detecció d’oportunitats fins a l’explotació dels resultats."
  },
  {
    "guid": "f2a15b8b-02cd-4d11-83cf-53b4a64d72f3",
    "subjectId": "T04",
    "difficulty": 2,
    "origin": "OPOS23_preguntes_especific.pdf",
    "type": "opos23",
    "question": "39. Quines modalitats de compra pública d’innovació hi ha?",
    "answerOptions": [
      {
        "text": "A. Compra Pública Avançada (CPA) i Compra Pública Consolidada (CPC).",
        "isCorrect": false,
        "rationale": "Incorrecta: aquestes no són modalitats reconegudes per la normativa espanyola."
      },
      {
        "text": "B. Compra Pública de Prototips (CPP) i Compra Pública d’Assajos (CPA).",
        "isCorrect": false,
        "rationale": "Incorrecta: termes no oficials dins la classificació CPI."
      },
      {
        "text": "C. Compra Pública Precomercial (CPP) i Compra Pública de Tecnologia Innovadora (CPTI).",
        "isCorrect": true,
        "rationale": "Correcta: són les dues modalitats regulades a Espanya per fomentar la innovació des de la contractació pública."
      },
      {
        "text": "D. Compra Pública de Recerca (CPR) i Compra Pública de Desenvolupament (CPD).",
        "isCorrect": false,
        "rationale": "Incorrecta: aquests termes no apareixen com a modalitats reconegudes."
      }
    ],
    "hint": "Recorda: CPP → desenvolupament precomercial; CPTI → adquisició de tecnologia ja desenvolupada però innovadora."
  },
  {
    "guid": "4d0dca60-7fd8-4bcb-a88d-d2922cc1d81b",
    "subjectId": "T36",
    "difficulty": 2,
    "origin": "OPOS23_preguntes_especific.pdf",
    "type": "opos23",
    "question": "40. Referent al programa Horizon Europe de la Unió Europea, com s’anomena el contracte que es signa un cop el projecte ha estat adjudicat?",
    "answerOptions": [
      {
        "text": "A. Consortium agreement.",
        "isCorrect": false,
        "rationale": "Incorrecta: és l’acord intern entre socis, no el contracte de finançament amb la Comissió Europea."
      },
      {
        "text": "B. Funding agreement.",
        "isCorrect": false,
        "rationale": "Incorrecta: denominació genèrica però no oficial dins Horizon Europe."
      },
      {
        "text": "C. Project agreement.",
        "isCorrect": false,
        "rationale": "Incorrecta: no és el terme legal emprat en el marc del programa."
      },
      {
        "text": "D. Grant agreement.",
        "isCorrect": true,
        "rationale": "Correcta: és el contracte de subvenció que es formalitza entre la Comissió Europea i els beneficiaris del projecte Horizon Europe."
      }
    ],
    "hint": "En els projectes europeus, el 'Grant Agreement' és el contracte legal de finançament entre la UE i els participants."
  },
  {
    "guid": "c38de37f-9683-4a24-ae26-6d1e69d41c01",
    "subjectId": "T04",
    "difficulty": 3,
    "origin": "OPOS23_preguntes_especific.pdf",
    "type": "opos23",
    "question": "41. Segons la guia de Compra pública TIC, què són les consultes preliminars?",
    "answerOptions": [
      {
        "text": "A. Conjunt d'actuacions orientades a mantenir un diàleg entre els poders adjudicadors i el mercat, després de la finalització del contracte, per tal d'auditar la correcta implementació de la solució.",
        "isCorrect": false,
        "rationale": "Incorrecta: es fan abans de la contractació, no després."
      },
      {
        "text": "B. Conjunt d'actuacions orientades a mantenir un diàleg entre els diferents departaments interns, previ a l'inici de l'expedient de contractació, per tal de garantir els requisits tècnics del programari.",
        "isCorrect": false,
        "rationale": "Incorrecta: no és entre departaments interns, sinó entre Administració i mercat."
      },
      {
        "text": "C. Conjunt d'actuacions orientades a mantenir un diàleg entre els diferents departaments interns, previ a l'inici del desenvolupament, per tal de garantir l’alineament del equips tècnics.",
        "isCorrect": false,
        "rationale": "Incorrecta: confon el procés de consultes amb coordinació interna."
      },
      {
        "text": "D. Conjunt d'actuacions orientades a mantenir un diàleg entre els poders adjudicadors i el mercat, previ a l'inici de l'expedient de contractació, amb l'objectiu d'estudiar i avaluar el nombre més ampli possible de solucions.",
        "isCorrect": true,
        "rationale": "Correcta: definició oficial de les consultes preliminars segons la Guia de Compra Pública TIC i la Llei 9/2017 de Contractes del Sector Públic."
      }
    ],
    "hint": "Les consultes preliminars serveixen per informar el mercat i rebre informació abans de redactar els plecs d’un contracte innovador."
  }
]