[
	{
		"guid": "b3c25d77-6120-4d7e-9c6e-8f08e57c915d",
		"subjectId": "T5",
		"difficulty": 2,
		"origin": "OPOS19_preguntes_especific.pdf",
		"type": "oposXX",
		"question": "Quan s’entén practicada una notificació d’un acte administratiu per mitjans electrònics?",
		"answerOptions": [
			{
				"text": "A. Quan es rebi en el correu electrònic de la persona interessada.",
				"isCorrect": false,
				"rationale": "El correu electrònic pot avisar però no és mitjà legal de notificació segons la Llei 39/2015."
			},
			{
				"text": "B. Quan es produeixi l’accés al seu contingut.",
				"isCorrect": true,
				"rationale": "Segons l’article 43 de la Llei 39/2015, la notificació es considera practicada quan la persona accedeix al seu contingut."
			},
			{
				"text": "C. Quan es generi des de les aplicacions informàtiques de l’Ajuntament.",
				"isCorrect": false,
				"rationale": "La generació no implica recepció efectiva."
			},
			{
				"text": "D. Quan la notificació es deixa a la bústia de correus de l’interessat.",
				"isCorrect": false,
				"rationale": "Només s’aplica a notificacions en paper, no electròniques."
			}
		],
		"hint": "Pensa en quin moment la persona realment 'accedeix' a la informació, no només quan l’Administració l’envia."
	},
	{
		"guid": "c4ff3b5d-6241-4a7e-925a-3d1d917a98d7",
		"subjectId": "T5",
		"difficulty": 2,
		"origin": "OPOS19_preguntes_especific.pdf",
		"type": "oposXX",
		"question": "El servei de Via Oberta, és el servei de la Consorci d’Administració Oberta de Catalunya que permet...",
		"answerOptions": [
			{
				"text": "A. L’intercanvi d’informació entre administracions públiques catalanes de manera segura i automatitzada.",
				"isCorrect": true,
				"rationale": "Via Oberta és la plataforma de l’AOC per interoperabilitat entre administracions catalanes."
			},
			{
				"text": "B. El registre electrònic d’entrada i sortida de documents.",
				"isCorrect": false,
				"rationale": "Aquesta és funció del registre electrònic, no de Via Oberta."
			},
			{
				"text": "C. La comunicació amb ciutadans per mitjà de notificacions electròniques.",
				"isCorrect": false,
				"rationale": "Les notificacions s’efectuen mitjançant sistemes com eNotum o DEHú."
			},
			{
				"text": "D. L’autenticació d’usuaris dins el portal EACAT.",
				"isCorrect": false,
				"rationale": "EACAT és el canal d’accés, però Via Oberta s’encarrega de l’intercanvi de dades."
			}
		],
		"hint": "Recorda: Via Oberta és sinònim d’interoperabilitat entre administracions catalanes."
	},
	{
		"guid": "e781d8a5-d2f8-4426-8f5e-4b3cb52c8f11",
		"subjectId": "T5",
		"difficulty": 3,
		"origin": "OPOS21_preguntes_practic.pdf",
		"type": "oposXX",
		"question": "Segons la Llei 29/2010, de l’ús dels mitjans electrònics al sector públic de Catalunya, amb quin servei proporcionat pel Consorci AOC caldria integrar el nostre sistema per realitzar l'intercanvi d’informació per mitjans telemàtics amb altres administracions públiques de l’Àrea Metropolitana?",
		"answerOptions": [
			{
				"text": "A. Caldria integrar-se amb SARA, el Sistema d’Aplicacions i Xarxes per a les Administracions.",
				"isCorrect": false,
				"rationale": "SARA és una xarxa estatal, no específica de Catalunya."
			},
			{
				"text": "B. Caldria integrar-se amb Via Oberta, el servei del Consorci AOC.",
				"isCorrect": true,
				"rationale": "Via Oberta és la passarel·la d’interoperabilitat per a l’intercanvi de dades entre administracions públiques catalanes."
			},
			{
				"text": "C. Caldria integrar-se amb EACAT Direct, el servei de signatura electrònica del Consorci AOC.",
				"isCorrect": false,
				"rationale": "EACAT és la plataforma de tramitació, no d’intercanvi de dades."
			},
			{
				"text": "D. Caldria integrar-se amb la Carpeta del Ciutadà.",
				"isCorrect": false,
				"rationale": "La Carpeta del Ciutadà és un servei d’accés ciutadà, no d’interoperabilitat entre administracions."
			}
		],
		"hint": "Busca quin servei és la 'xarxa de dades' entre AAPP catalanes."
	},
	{
		"guid": "f48b7c77-5103-4378-93b5-1e8fdd51533c",
		"subjectId": "T5",
		"difficulty": 2,
		"origin": "OPOS21_preguntes_especific.pdf",
		"type": "oposXX",
		"question": "Cal identificar-se digitalment per fer tràmits telemàtics amb:",
		"answerOptions": [
			{
				"text": "A. L'idCAT Mòbil, perquè es pot utilitzar per identificar-se en la majoria de tràmits amb les administracions catalanes i des de qualsevol dispositiu (no cal instal·lar res).",
				"isCorrect": true,
				"rationale": "L’idCAT Mòbil és el sistema d’identificació i autenticació homologat per la Generalitat i el Consorci AOC."
			},
			{
				"text": "B. La identitat digital per a la ciutadania per als seus tràmits a Catalunya és idCAT o idCAT Mòbil, però en cap cas amb el DNIe.",
				"isCorrect": false,
				"rationale": "El DNI electrònic també és vàlid per identificar-se segons el reglament eIDAS."
			},
			{
				"text": "C. La T-CAT, perquè és la targeta intel·ligent de què pot disposar la ciutadania per als seus tràmits a Catalunya.",
				"isCorrect": false,
				"rationale": "La T-CAT és per a personal de les administracions públiques, no per ciutadans particulars."
			},
			{
				"text": "D. No cal identificar-se digitalment, perquè l’administració té mitjans per comprovar l’autenticitat de la persona sol·licitant durant el procediment administratiu.",
				"isCorrect": false,
				"rationale": "Segons la Llei 39/2015, cal autenticació segura per fer tràmits electrònics."
			}
		],
		"hint": "Recorda quin sistema permet identificar-se sense lector de targetes."
	}
]