[
  {
    "guid": "b7c1d9a2-4e6f-4f5a-9c2d-1a8e3f6b9001",
    "subjectId": "T5",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Quina relació correcta existeix entre el nivell de garantia d’identificació (baix, mitjà, alt) i el tipus de firma electrònica segons eIDAS?",
    "answerOptions": [
      {
        "text": "Un nivell alt d’identificació implica automàticament una firma electrònica qualificada",
        "isCorrect": false,
        "rationale": "El nivell d’identificació no determina per si sol el tipus de firma; cal dispositiu qualificat."
      },
      {
        "text": "El tipus de firma electrònica és independent del nivell de garantia d’identificació",
        "isCorrect": true,
        "rationale": "Identificació i firma són conceptes diferents i regulats separadament per eIDAS."
      },
      {
        "text": "Només amb nivell mitjà es pot generar firma avançada",
        "isCorrect": false,
        "rationale": "La firma avançada no està limitada a un nivell concret d’identificació."
      },
      {
        "text": "La firma qualificada només pot generar-se amb identificació de nivell mitjà",
        "isCorrect": false,
        "rationale": "La firma qualificada requereix certificat i dispositiu qualificats, no un nivell concret d’identificació."
      }
    ],
    "hint": "Identificació i firma són capes diferents."
  },
  {
    "guid": "d2f4a7c9-1e5b-4d8a-92f6-3c7a1e8b9002",
    "subjectId": "T5",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Segons eIDAS 2.0, quina obligació tenen les Administracions Públiques respecte a la European Digital Identity Wallet?",
    "answerOptions": [
      {
        "text": "Obligar la ciutadania a utilitzar-la en tots els tràmits electrònics",
        "isCorrect": false,
        "rationale": "La Wallet no és obligatòria per a la ciutadania."
      },
      {
        "text": "Acceptar-la com a mitjà d’identificació electrònica",
        "isCorrect": true,
        "rationale": "Les AAPP han d’acceptar la Wallet com a mecanisme d’identificació reconegut."
      },
      {
        "text": "Substituir els seus sistemes d’identificació actuals",
        "isCorrect": false,
        "rationale": "eIDAS 2 no obliga a eliminar sistemes existents."
      },
      {
        "text": "Utilitzar-la exclusivament per a firmes qualificades",
        "isCorrect": false,
        "rationale": "La Wallet pot suportar diferents tipus de firma."
      }
    ],
    "hint": "Obligació d’acceptació, no d’ús."
  },
  {
    "guid": "f9a3c2e1-6b5d-4c7a-91e8-2f4d8b3a9003",
    "subjectId": "T5",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Quina afirmació és correcta respecte a l’ús de la EUDI Wallet en el sector privat segons eIDAS 2.0?",
    "answerOptions": [
      {
        "text": "Només les Administracions Públiques estan obligades a acceptar-la",
        "isCorrect": false,
        "rationale": "Els grans prestadors de serveis privats també tenen obligació d’acceptació."
      },
      {
        "text": "Els grans prestadors de serveis essencials hauran d’acceptar la Wallet",
        "isCorrect": true,
        "rationale": "eIDAS 2 amplia l’obligació d’acceptació al sector privat rellevant."
      },
      {
        "text": "Cap entitat privada pot acceptar la Wallet",
        "isCorrect": false,
        "rationale": "La Wallet està pensada també per a l’ús privat."
      },
      {
        "text": "La Wallet només és vàlida dins l’Estat membre d’emissió",
        "isCorrect": false,
        "rationale": "La Wallet és interoperable a tota la UE."
      }
    ],
    "hint": "eIDAS 2 amplia l’abast més enllà del sector públic."
  },
  {
    "guid": "a1e8d4b6-9f2c-4a7d-83c1-5f9b2e7a9004",
    "subjectId": "T5",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Quina diferència fonamental existeix entre la ORAE i el registre electrònic?",
    "answerOptions": [
      {
        "text": "La ORAE és un sistema informàtic i el registre electrònic és una oficina física",
        "isCorrect": false,
        "rationale": "És just al revés conceptualment."
      },
      {
        "text": "La ORAE presta assistència a la ciutadania i el registre electrònic gestiona assentaments",
        "isCorrect": true,
        "rationale": "La ORAE té funció d’assistència; el registre electrònic és un sistema."
      },
      {
        "text": "La ORAE substitueix el registre electrònic",
        "isCorrect": false,
        "rationale": "No substitueix cap sistema."
      },
      {
        "text": "La ORAE només existeix en entorns digitals",
        "isCorrect": false,
        "rationale": "Pot ser física i/o organitzativa."
      }
    ],
    "hint": "Assistència vs sistema."
  },
  {
    "guid": "c6f8b9a2-1d4e-4b7f-93a5-2e1d8c9a9005",
    "subjectId": "T5",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Quina afirmació és correcta respecte a la relació entre la EUDI Wallet i el dispositiu qualificat de creació de firma?",
    "answerOptions": [
      {
        "text": "La Wallet és sempre el dispositiu qualificat de creació de firma",
        "isCorrect": false,
        "rationale": "La Wallet pot ser només la interfície."
      },
      {
        "text": "La Wallet pot actuar com a interfície d’un dispositiu qualificat",
        "isCorrect": true,
        "rationale": "La qualificació depèn d’on resideix la clau privada."
      },
      {
        "text": "La Wallet elimina la necessitat de dispositius qualificats",
        "isCorrect": false,
        "rationale": "eIDAS 2 manté els requisits criptogràfics."
      },
      {
        "text": "La Wallet només pot generar firmes simples",
        "isCorrect": false,
        "rationale": "Pot generar firmes avançades i qualificades."
      }
    ],
    "hint": "La clau privada és la clau."
  },
  {
    "guid": "9f7b9f4a-2b42-4d8c-9b4b-3c2d4d8e1a01",
    "subjectId": "T5",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Segons el Reglament eIDAS, quina condició addicional és imprescindible perquè una firma electrònica avançada sigui considerada una firma electrònica qualificada?",
    "answerOptions": [
      {
        "text": "Que la firma es realitzi mitjançant un certificat digital reconegut per l’Administració",
        "isCorrect": false,
        "rationale": "Un certificat reconegut no implica necessàriament que sigui un certificat qualificat ni que s’utilitzi un dispositiu qualificat."
      },
      {
        "text": "Que la clau privada de signatura estigui protegida en un dispositiu qualificat de creació de firma",
        "isCorrect": true,
        "rationale": "La firma qualificada exigeix l’ús d’un dispositiu qualificat que garanteixi que la clau privada no pot ser extreta ni copiada."
      },
      {
        "text": "Que el sistema d’identificació tingui un nivell alt segons eIDAS",
        "isCorrect": false,
        "rationale": "El nivell d’identificació no és suficient per si sol per assolir el nivell de firma qualificada."
      },
      {
        "text": "Que la firma es realitzi des d’una seu electrònica",
        "isCorrect": false,
        "rationale": "El canal de tramitació no determina el nivell de la firma electrònica."
      }
    ],
    "hint": "Pensa on resideix la clau privada i si pot ser extreta."
  },
  {
    "guid": "a1c6e2d4-7a9e-4f5d-9b3e-8c1d2e7f4b22",
    "subjectId": "T5",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Quina afirmació descriu correctament la relació entre la European Digital Identity Wallet i la firma electrònica qualificada?",
    "answerOptions": [
      {
        "text": "Qualsevol firma realitzada amb la Wallet és automàticament una firma qualificada",
        "isCorrect": false,
        "rationale": "La Wallet pot actuar com a interfície, però la qualificació depèn del certificat i del dispositiu utilitzat."
      },
      {
        "text": "La Wallet pot permetre firmes qualificades només si integra un certificat qualificat i un dispositiu qualificat",
        "isCorrect": true,
        "rationale": "eIDAS 2 manté els requisits de la firma qualificada, encara que la interfície sigui una wallet."
      },
      {
        "text": "La Wallet substitueix els requisits criptogràfics de la firma qualificada",
        "isCorrect": false,
        "rationale": "eIDAS 2 no elimina ni rebaixa els requisits de seguretat de la firma qualificada."
      },
      {
        "text": "La Wallet només pot generar firmes electròniques simples",
        "isCorrect": false,
        "rationale": "La Wallet pot suportar firmes avançades i qualificades si es compleixen els requisits."
      }
    ],
    "hint": "La wallet és un contenidor/interfície, no el criteri jurídic."
  },
  {
    "guid": "c3b1e9d8-4f6a-42a7-8d2b-7e9a1c3f0d33",
    "subjectId": "T5",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Un ciutadà signa un tràmit amb idCAT Mòbil (nivell mitjà d’identificació). Quin és el nivell jurídic de la firma generada?",
    "answerOptions": [
      {
        "text": "Firma electrònica simple",
        "isCorrect": false,
        "rationale": "La firma amb idCAT Mòbil identifica el signant i garanteix la integritat."
      },
      {
        "text": "Firma electrònica avançada",
        "isCorrect": true,
        "rationale": "idCAT Mòbil permet firma avançada però no compleix els requisits de dispositiu qualificat."
      },
      {
        "text": "Firma electrònica qualificada",
        "isCorrect": false,
        "rationale": "No s’utilitza cap dispositiu qualificat de creació de firma."
      },
      {
        "text": "No és una firma electrònica segons eIDAS",
        "isCorrect": false,
        "rationale": "Sí que compleix els requisits de firma electrònica avançada."
      }
    ],
    "hint": "No confonguis nivell d’identificació amb nivell de firma."
  },
  {
    "guid": "e5a8b7d2-91f4-4c6d-b3e2-2f9a4c1d8e44",
    "subjectId": "T5",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Quina afirmació és correcta respecte al Registre d’Apoderaments segons la Llei 39/2015?",
    "answerOptions": [
      {
        "text": "És un registre únic i centralitzat per a totes les Administracions Públiques",
        "isCorrect": false,
        "rationale": "Cada Administració pot tenir el seu registre propi."
      },
      {
        "text": "Ha de ser interoperable per permetre la consulta de poders entre administracions",
        "isCorrect": true,
        "rationale": "La interoperabilitat és un requisit legal del Registre d’Apoderaments."
      },
      {
        "text": "Substitueix el registre electrònic general",
        "isCorrect": false,
        "rationale": "Té una funció diferent: acreditar representació."
      },
      {
        "text": "Només admet apoderaments generals",
        "isCorrect": false,
        "rationale": "També admet apoderaments per tràmit concret o per organisme."
      }
    ],
    "hint": "Pensa en la paraula clau: interoperabilitat."
  },
  {
    "guid": "f8d1c4b9-6e3a-4c5f-9a72-3d9e5b2c1a55",
    "subjectId": "T5",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Quina és la funció principal de l’ORAE en el marc de l’Administració Electrònica?",
    "answerOptions": [
      {
        "text": "Practicar notificacions electròniques en nom de l’Administració",
        "isCorrect": false,
        "rationale": "Les notificacions es practiquen mitjançant sistemes electrònics, no des de l’ORAE."
      },
      {
        "text": "Assistir la ciutadania en l’ús de mitjans electrònics i en la presentació de sol·licituds",
        "isCorrect": true,
        "rationale": "L’ORAE garanteix l’accés i la inclusió digital."
      },
      {
        "text": "Actuar com a seu electrònica de l’Administració",
        "isCorrect": false,
        "rationale": "La seu electrònica és un canal digital, no una oficina d’assistència."
      },
      {
        "text": "Centralitzar tots els registres electrònics",
        "isCorrect": false,
        "rationale": "L’ORAE no substitueix ni centralitza els sistemes de registre."
      }
    ],
    "hint": "Relaciona ORAE amb inclusió digital."
  },
  {
    "guid": "1a2b3c4d-5e6f-4789-a0b1-c2d3e4f5a666",
    "subjectId": "T5",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Quina afirmació descriu correctament el PAPER del PAGE (Punt d’Accés General Electrònic)?",
    "answerOptions": [
      {
        "text": "És el sistema on es realitzen les firmes electròniques",
        "isCorrect": false,
        "rationale": "El PAGE no és un sistema de signatura."
      },
      {
        "text": "És el portal general des del qual s’accedeix a la seu electrònica i als serveis digitals",
        "isCorrect": true,
        "rationale": "El PAGE actua com a porta d’entrada als serveis electrònics."
      },
      {
        "text": "Substitueix la carpeta ciutadana",
        "isCorrect": false,
        "rationale": "La carpeta ciutadana és un espai personal diferent."
      },
      {
        "text": "És el registre electrònic general de l’Administració",
        "isCorrect": false,
        "rationale": "El registre electrònic és un sistema diferent del PAGE."
      }
    ],
    "hint": "PAGE = porta d’entrada, no canal de tramitació."
  }
]
