[
  {
    "guid": "f9e9a96e-7b3c-4a82-bd88-0b235b97a2af",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "OPOS19_preguntes_especific.pdf",
    "type": "oposXX",
    "question": "Qui cal considerar com a implicat en un projecte, atenent els criteris de la guia Project management Body of Knowledge?",
    "answerOptions": [
      {
        "text": "A. Tota persona, grup o organització que pot afectar el projecte, resultar afectat pel projecte o percebre’s a sí mateix com afectat per una decisió, activitat o resultat d’un projecte.",
        "isCorrect": true,
        "rationale": "És la definició oficial de Stakeholder segons el PMBOK: qualsevol persona, grup o organització que pugui afectar o ser afectada pel projecte."
      },
      {
        "text": "B. Tota persona individual que pot afectar el projecte, resultar afectat pel projecte o percebre’s a sí mateix com afectat per una decisió, activitat o resultat d’un projecte però no els grups o organitzacions.",
        "isCorrect": false,
        "rationale": "Incorrecte: la definició inclou també grups i organitzacions, no només individus."
      },
      {
        "text": "C. Només l’equip assignat al projecte per part del proveïdor subcontractat per desenvolupar-lo, l’esponsor del projecte i els usuaris als quals va dirigit el servei.",
        "isCorrect": false,
        "rationale": "Incorrecte: aquesta opció limita massa el concepte d’implicat a un subconjunt concret."
      },
      {
        "text": "D. Només els membres de l’organització que treballaran directament en el projecte, l’equip assignat per part del proveïdor subcontractat per desenvolupar-lo, l’esponsor del projecte i els usuaris als quals va dirigit el servei.",
        "isCorrect": false,
        "rationale": "Incorrecte: la definició del PMBOK inclou també parts externes i grups que poden percebre’s com afectats."
      }
    ],
    "hint": "Recorda que ‘implicat’ (stakeholder) no és només qui participa directament, sinó també qui pot veure’s afectat."
  },
  {
    "guid": "87a1477c-23bb-4a2b-a3a8-7a8a17a8282b",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "OPOS19_preguntes_practic.pdf",
    "type": "oposXX",
    "question": "Com a visió estratègica, d’acord amb l’especificació tècnica PMBOK, la Direcció de Serveis Informàtics de l’Ajuntament identifica els Interessats (Stakeholders) del sistema d’informació de contractació com a:",
    "answerOptions": [
      {
        "text": "A. Els grups de persones que obtenen un guany econòmic com ara els adjudicataris de la licitació pública.",
        "isCorrect": false,
        "rationale": "Aquesta opció és massa reduïda: no tots els implicats obtenen un guany econòmic."
      },
      {
        "text": "B. Els grups de persones que tenen una relació directa o indirecta durant tot el cicle de vida del sistema d’informació.",
        "isCorrect": true,
        "rationale": "És la definició correcta segons el PMBOK: inclou qualsevol actor amb interès o influència en qualsevol fase del projecte."
      },
      {
        "text": "C. Els grups de persones implicats directament en la construcció del sistema d’informació.",
        "isCorrect": false,
        "rationale": "Només inclou els participants tècnics, però no altres implicats rellevants."
      },
      {
        "text": "D. Els diferents grups d’usuaris i usuàries del sistema d’informació tret dels proveïdors de serveis externs.",
        "isCorrect": false,
        "rationale": "Exclou els proveïdors i altres parts interessades, per tant no és completa."
      }
    ],
    "hint": "Pensa que el PMBOK parla d’interès o influència, no només de participació directa."
  },
  {
    "guid": "49eae783-ec48-40fc-8726-96a26b8dd6c7",
    "subjectId": "T10",
    "difficulty": 1,
    "origin": "OPOS21_preguntes_practic.pdf",
    "type": "oposXX",
    "question": "Quin dels següents enunciats descriu millor com “els interessats” participen en un projecte segons PMBOK?",
    "answerOptions": [
      {
        "text": "A. Ajudar a determinar el cronograma, els entregables i els requeriments del projecte.",
        "isCorrect": true,
        "rationale": "Correcte: els implicats contribueixen a definir requisits i lliurables, aspectes clau del projecte."
      },
      {
        "text": "B. Ajudar a determinar les restriccions del projecte i els entregables del producte.",
        "isCorrect": false,
        "rationale": "Tot i que poden identificar restriccions, no és la seva funció principal segons PMBOK."
      },
      {
        "text": "C. Ajudar a determinar les necessitats dels recursos i les restriccions dels recursos en el projecte.",
        "isCorrect": false,
        "rationale": "Això correspon més a la gestió de recursos que no pas a la d’implicats."
      },
      {
        "text": "D. Aproven l’acta de constitució del projecte, ajuden a proporcionar els supòsits i crear els plans de gestió.",
        "isCorrect": false,
        "rationale": "L’aprovació de l’acta recau en el patrocinador o direcció, no en tots els implicats."
      }
    ],
    "hint": "Els implicats ajuden a definir què cal fer i què s’ha de lliurar, no a autoritzar el projecte."
  },



  {
    "guid": "8d1df6cb-934a-4f86-9463-5d2d7a2b2a3c",
    "subjectId": "T10",
    "difficulty": 1,
    "origin": "OPOS24_gpt",
    "type": "fillgap",
    "question": "Segons el PMBOK, un ______________ és qualsevol persona, grup o organització que pot afectar o ser afectada pel projecte.",
    "answerOptions": [
      {
        "text": "implicat (stakeholder)",
        "isCorrect": true,
        "rationale": "El PMBOK defineix 'stakeholder' com qualsevol persona, grup o organització que pugui afectar o ser afectada pel projecte."
      },
      {
        "text": "recurs humà",
        "isCorrect": false,
        "rationale": "Els recursos humans són una part interna de l’equip, però no tots els implicats són membres del projecte."
      },
      {
        "text": "proveïdor extern",
        "isCorrect": false,
        "rationale": "Un proveïdor pot ser un implicat, però no tots els implicats són proveïdors."
      },
      {
        "text": "usuari final",
        "isCorrect": false,
        "rationale": "L’usuari final és només un tipus d’implicat, no la definició general."
      }
    ],
    "hint": "Pensa en un terme que inclou tothom que pot influir o ser influït pel projecte."
  },
  {
    "guid": "b6b1c425-13f4-4c5c-8c71-57e6b5c1fb38",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "OPOS24_gpt",
    "type": "fillgap",
    "question": "El document que conté la llista, interès, poder i actitud dels implicats s’anomena ______________.",
    "answerOptions": [
      {
        "text": "registre d’implicats (Stakeholder Register)",
        "isCorrect": true,
        "rationale": "El registre d’implicats és la sortida del procés Identify Stakeholders i conté aquesta informació."
      },
      {
        "text": "pla de comunicacions",
        "isCorrect": false,
        "rationale": "El pla de comunicacions defineix canals i freqüències, no la informació dels implicats."
      },
      {
        "text": "acta de constitució",
        "isCorrect": false,
        "rationale": "El Project Charter pot ajudar a identificar implicats inicials, però no els documenta."
      },
      {
        "text": "pla de qualitat",
        "isCorrect": false,
        "rationale": "El pla de qualitat tracta d’estàndards i verificacions, no d’imlicats."
      }
    ],
    "hint": "És un document que es crea al principi del projecte i s’actualitza sovint."
  },
  {
    "guid": "b58de5e9-11af-472a-a748-7bff789d0022",
    "subjectId": "T10",
    "difficulty": 3,
    "origin": "OPOS24_gpt",
    "type": "fillgap",
    "question": "A la matriu de poder/interès, els implicats amb **alt poder** i **alt interès** s’han de ______________.",
    "answerOptions": [
      {
        "text": "gestionar activament",
        "isCorrect": true,
        "rationale": "Són els implicats més crítics, i el PMBOK recomana una gestió activa i personalitzada."
      },
      {
        "text": "mantenir satisfets",
        "isCorrect": false,
        "rationale": "Aquesta estratègia és per a implicats amb alt poder però baix interès."
      },
      {
        "text": "mantenir informats",
        "isCorrect": false,
        "rationale": "Els implicats amb alt interès però poc poder s’han de mantenir informats, no gestionats activament."
      },
      {
        "text": "supervisar mínimament",
        "isCorrect": false,
        "rationale": "Aquesta estratègia és per implicats amb baix interès i poc poder."
      }
    ],
    "hint": "Són els implicats clau: tenen influència i interès alt."
  },
  {
    "guid": "bc6de7f2-05e3-4cc4-bd06-987f3b4e84df",
    "subjectId": "T10",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "fillgap",
    "question": "El procés que assegura que la implicació dels implicats és efectiva i alineada amb els objectius del projecte s’anomena ______________.",
    "answerOptions": [
      {
        "text": "gestionar la implicació dels implicats (Manage Stakeholder Engagement)",
        "isCorrect": true,
        "rationale": "Aquest procés s’encarrega d’interactuar i comunicar-se activament amb els implicats per mantenir el seu compromís."
      },
      {
        "text": "controlar el cronograma",
        "isCorrect": false,
        "rationale": "El control del cronograma pertany a la gestió del temps, no dels implicats."
      },
      {
        "text": "planificar la comunicació",
        "isCorrect": false,
        "rationale": "El pla de comunicació és un procés complementari, no el principal d’implicació."
      },
      {
        "text": "identificar riscos",
        "isCorrect": false,
        "rationale": "La identificació de riscos és una altra àrea de coneixement del PMBOK."
      }
    ],
    "hint": "Aquest procés pertany a la fase d’execució del projecte."
  },
  {
    "guid": "e2f8ac49-8657-4a93-8dfc-4db45b27da2f",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "OPOS24_gpt",
    "type": "fillgap",
    "question": "Quan un implicat canvia d’actitud o de nivell d’influència, cal ______________ el registre d’implicats.",
    "answerOptions": [
      {
        "text": "actualitzar",
        "isCorrect": true,
        "rationale": "El registre d’implicats s’ha d’actualitzar sempre que hi hagi canvis per mantenir la informació al dia."
      },
      {
        "text": "tancar",
        "isCorrect": false,
        "rationale": "El registre no es tanca fins al final del projecte."
      },
      {
        "text": "esborrar",
        "isCorrect": false,
        "rationale": "Els implicats no s’eliminen del registre, només s’actualitzen les seves dades."
      },
      {
        "text": "duplicar",
        "isCorrect": false,
        "rationale": "Duplicar la informació generaria incoherències i confusió."
      }
    ],
    "hint": "Recorda: és un document viu durant tot el projecte."
  },
  {
    "guid": "a3dcb72b-21e7-4a67-bb30-85a4eb14e7dc",
    "subjectId": "T10",
    "difficulty": 3,
    "origin": "OPOS24_gpt",
    "type": "fillgap",
    "question": "L’estratègia de ______________ s’aplica als implicats amb alt poder però baix interès.",
    "answerOptions": [
      {
        "text": "mantenir satisfets",
        "isCorrect": true,
        "rationale": "Aquests implicats poden influir molt, tot i que no segueixin el projecte de prop."
      },
      {
        "text": "mantenir informats",
        "isCorrect": false,
        "rationale": "Correspon als implicats amb baix poder però alt interès."
      },
      {
        "text": "gestionar activament",
        "isCorrect": false,
        "rationale": "És l’estratègia per als implicats amb alt poder i alt interès."
      },
      {
        "text": "supervisar mínimament",
        "isCorrect": false,
        "rationale": "S’aplica a implicats amb poc poder i interès baix."
      }
    ],
    "hint": "Són persones d’alt nivell jeràrquic però poc involucrades diàriament."
  },


  {
    "guid": "d2ef39a1-174e-4a22-9c13-4b1f1b1ac215",
    "subjectId": "T10",
    "difficulty": 1,
    "origin": "OPOS24_gpt",
    "type": "truefalse",
    "question": "Els implicats (stakeholders) inclouen només les persones que treballen directament en el projecte.",
    "answerOptions": [
      {
        "text": "Cert",
        "isCorrect": false,
        "rationale": "Fals. Segons PMBOK, els implicats inclouen qualsevol persona, grup o organització que pot afectar o ser afectada pel projecte, encara que no hi treballi directament."
      },
      {
        "text": "Fals",
        "isCorrect": true,
        "rationale": "Correcte. També poden ser externs, com usuaris, ciutadania o proveïdors."
      }
    ],
    "hint": "Pensa que ‘implicat’ no és sinònim d’equip de projecte."
  },
  {
    "guid": "e21a9143-bb2e-4051-a4b4-b4f3b7de5f59",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "OPOS24_gpt",
    "type": "truefalse",
    "question": "El registre d’implicats (Stakeholder Register) és una sortida del procés 'Identify Stakeholders'.",
    "answerOptions": [
      {
        "text": "Cert",
        "isCorrect": true,
        "rationale": "Correcte. El registre d’implicats es crea en el procés d’identificació i recull la informació clau sobre cada stakeholder."
      },
      {
        "text": "Fals",
        "isCorrect": false,
        "rationale": "Incorrecte. El registre no és una entrada ni un document de planificació, sinó una sortida inicial de la identificació."
      }
    ],
    "hint": "Recorda l’ordre dels processos del PMBOK."
  },
  {
    "guid": "b84f6cc5-dc13-4e5b-bcc8-497b73dd8f34",
    "subjectId": "T10",
    "difficulty": 3,
    "origin": "OPOS24_gpt",
    "type": "truefalse",
    "question": "Controlar la implicació dels implicats significa restringir la seva participació per evitar conflictes.",
    "answerOptions": [
      {
        "text": "Cert",
        "isCorrect": false,
        "rationale": "Fals. Controlar la implicació no és limitar-la, sinó monitoritzar i ajustar l’estratègia per mantenir-los compromesos."
      },
      {
        "text": "Fals",
        "isCorrect": true,
        "rationale": "Correcte. El procés ‘Monitor Stakeholder Engagement’ busca assegurar que la implicació és efectiva, no restringir-la."
      }
    ],
    "hint": "Controlar en PMBOK vol dir avaluar i ajustar, no limitar."
  },
  {
    "guid": "6a5b4c62-c5ce-4d5d-8891-92a4b60b6f8f",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "OPOS24_gpt",
    "type": "truefalse",
    "question": "El pla de gestió d’implicats i el pla de comunicacions són documents totalment independents entre si.",
    "answerOptions": [
      {
        "text": "Cert",
        "isCorrect": false,
        "rationale": "Fals. Estan estretament relacionats: el pla de comunicacions dona suport al pla de gestió d’implicats, ja que la comunicació és la principal eina per gestionar-los."
      },
      {
        "text": "Fals",
        "isCorrect": true,
        "rationale": "Correcte. Tots dos plans treballen conjuntament per assegurar una comunicació eficaç amb cada stakeholder."
      }
    ],
    "hint": "Tots dos plans s’alimenten mútuament; pensa en la comunicació com l’eina principal."
  },
  {
    "guid": "1df63a91-0a2f-4a7b-9330-bba5dfd4c2f4",
    "subjectId": "T10",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "truefalse",
    "question": "Els implicats negatius no s’han d’incloure al registre, ja que poden perjudicar el projecte.",
    "answerOptions": [
      {
        "text": "Cert",
        "isCorrect": false,
        "rationale": "Fals. El registre ha d’incloure TOTS els implicats, també els que s’oposen al projecte, per poder dissenyar estratègies específiques."
      },
      {
        "text": "Fals",
        "isCorrect": true,
        "rationale": "Correcte. Excloure implicats negatius impediria anticipar conflictes o gestionar la seva influència."
      }
    ],
    "hint": "Els opositors també són implicats: s’han de gestionar, no ignorar."
  },
  {
    "guid": "fbf53694-48bb-4ef3-b481-7f9849f3a3e9",
    "subjectId": "T10",
    "difficulty": 3,
    "origin": "OPOS24_gpt",
    "type": "truefalse",
    "question": "La matriu de poder/interès ajuda a prioritzar els implicats segons la seva influència i el seu interès en el projecte.",
    "answerOptions": [
      {
        "text": "Cert",
        "isCorrect": true,
        "rationale": "Correcte. És una eina bàsica per decidir quina estratègia aplicar a cada implicat segons el seu poder i interès."
      },
      {
        "text": "Fals",
        "isCorrect": false,
        "rationale": "Incorrecte. Precisament aquesta matriu existeix per establir prioritats de gestió entre implicats."
      }
    ],
    "hint": "Recorda els quatre quadrants: gestionar, mantenir satisfet, informar o supervisar."
  },
  {
    "guid": "6f2342e5-41e8-4d54-9062-3b4e06c7a8e1",
    "subjectId": "T10",
    "difficulty": 1,
    "origin": "OPOS24_gpt",
    "type": "truefalse",
    "question": "El Project Manager és el responsable principal de mantenir el compromís dels implicats.",
    "answerOptions": [
      {
        "text": "Cert",
        "isCorrect": true,
        "rationale": "Correcte. Segons PMBOK, és el responsable de gestionar la implicació i assegurar una comunicació efectiva amb tots els stakeholders."
      },
      {
        "text": "Fals",
        "isCorrect": false,
        "rationale": "Incorrecte. Tot i que altres rols poden participar-hi, la responsabilitat global és del Project Manager."
      }
    ],
    "hint": "Recorda: el PM és l’eix de comunicació i gestió del projecte."
  },
  {
    "guid": "f847ac74-bf61-4a94-836e-2eb26989c687",
    "subjectId": "T10",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "truefalse",
    "question": "La gestió d’implicats es realitza només durant la fase d’inici del projecte.",
    "answerOptions": [
      {
        "text": "Cert",
        "isCorrect": false,
        "rationale": "Fals. La gestió d’implicats és contínua: s’inicia en la fase d’inici però s’estén durant tot el cicle de vida del projecte."
      },
      {
        "text": "Fals",
        "isCorrect": true,
        "rationale": "Correcte. Els implicats poden canviar d’actitud, poder o interès, i cal gestionar-los constantment."
      }
    ],
    "hint": "Els implicats evolucionen al llarg del projecte, i la seva gestió també."
  },


  {
    "guid": "7a0cb7c1-93e5-4d94-b4e2-4017af07a9c8",
    "subjectId": "T10",
    "difficulty": 1,
    "origin": "OPOS24_gpt",
    "type": "flashcard",
    "question": "Què és un implicat (stakeholder) segons el PMBOK?",
    "answerOptions": [
      {
        "text": "Aquesta me la sé",
        "isCorrect": true,
        "rationale": "Qualsevol persona, grup o organització que pot afectar o ser afectada pel projecte."
      },
      {
        "text": "Encara no me la sé",
        "isCorrect": false,
        "rationale": ""
      }
    ]
  },
  {
    "guid": "1fd32238-40e3-4d58-bbc3-160a78848b18",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "OPOS24_gpt",
    "type": "flashcard",
    "question": "Quin document recull el nom, rol, poder, interès i actitud dels implicats?",
    "answerOptions": [
      {
        "text": "Aquesta me la sé",
        "isCorrect": true,
        "rationale": "El Registre d’Implicats (Stakeholder Register)."
      },
      {
        "text": "Encara no me la sé",
        "isCorrect": false,
        "rationale": ""
      }
    ]
  },
  {
    "guid": "9d5c55a2-7de4-49ef-825f-feb64263d747",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "OPOS24_gpt",
    "type": "flashcard",
    "question": "Quin és l’objectiu principal del pla de gestió d’implicats?",
    "answerOptions": [
      {
        "text": "Aquesta me la sé",
        "isCorrect": true,
        "rationale": "Definir com implicar i comunicar-se amb cada implicat per mantenir-ne el compromís."
      },
      {
        "text": "Encara no me la sé",
        "isCorrect": false,
        "rationale": ""
      }
    ]
  },
  {
    "guid": "afe8e2f2-5c94-4c2d-8bb4-52340cfcc47e",
    "subjectId": "T10",
    "difficulty": 3,
    "origin": "OPOS24_gpt",
    "type": "flashcard",
    "question": "Quina és la diferència principal entre comunicar i implicar?",
    "answerOptions": [
      {
        "text": "Aquesta me la sé",
        "isCorrect": true,
        "rationale": "Comunicar és transmetre informació; implicar és aconseguir compromís i participació activa."
      },
      {
        "text": "Encara no me la sé",
        "isCorrect": false,
        "rationale": ""
      }
    ]
  },
  {
    "guid": "b1a5831f-301a-4fae-b2a3-830b30eac20d",
    "subjectId": "T10",
    "difficulty": 3,
    "origin": "OPOS24_gpt",
    "type": "flashcard",
    "question": "En la matriu poder/interès, què s’ha de fer amb implicats amb alt poder i baix interès?",
    "answerOptions": [
      {
        "text": "Aquesta me la sé",
        "isCorrect": true,
        "rationale": "Mantenir-los satisfets, però sense sobrecarregar-los amb informació."
      },
      {
        "text": "Encara no me la sé",
        "isCorrect": false,
        "rationale": ""
      }
    ]
  },
  {
    "guid": "cd79240d-4b13-40de-8e1f-3b12f2634b25",
    "subjectId": "T10",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "flashcard",
    "question": "Què vol dir controlar la implicació dels implicats (Monitor Stakeholder Engagement)?",
    "answerOptions": [
      {
        "text": "Aquesta me la sé",
        "isCorrect": true,
        "rationale": "Supervisar la participació i ajustar les estratègies per mantenir un nivell òptim de compromís."
      },
      {
        "text": "Encara no me la sé",
        "isCorrect": false,
        "rationale": ""
      }
    ]
  },
  {
    "guid": "e1f4b381-b52a-42d7-bf22-d9ff8f4a6718",
    "subjectId": "T10",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "flashcard",
    "question": "Quin paper té el Project Manager en la gestió d’implicats?",
    "answerOptions": [
      {
        "text": "Aquesta me la sé",
        "isCorrect": true,
        "rationale": "És el responsable principal de mantenir i ajustar la implicació dels implicats durant tot el projecte."
      },
      {
        "text": "Encara no me la sé",
        "isCorrect": false,
        "rationale": ""
      }
    ]
  },
  {
    "guid": "dbef6c04-c31c-441f-9cf1-94f7dcb0f214",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "OPOS24_gpt",
    "type": "flashcard",
    "question": "Com s’ha de gestionar un implicat negatiu segons PMBOK?",
    "answerOptions": [
      {
        "text": "Aquesta me la sé",
        "isCorrect": true,
        "rationale": "S’ha d’incloure al registre i definir estratègies per reduir la seva resistència o transformar-la en suport."
      },
      {
        "text": "Encara no me la sé",
        "isCorrect": false,
        "rationale": ""
      }
    ]
  },
  {
    "guid": "e68412ac-8b1a-4975-bb18-6729f7ef3f89",
    "subjectId": "T10",
    "difficulty": 3,
    "origin": "OPOS24_gpt",
    "type": "flashcard",
    "question": "Quina és la principal eina per classificar implicats segons influència i interès?",
    "answerOptions": [
      {
        "text": "Aquesta me la sé",
        "isCorrect": true,
        "rationale": "La matriu de poder/interès (Power–Interest Grid)."
      },
      {
        "text": "Encara no me la sé",
        "isCorrect": false,
        "rationale": ""
      }
    ]
  },
  {
    "guid": "bbf5b32a-4e02-4600-b53d-97f41c8dc87e",
    "subjectId": "T10",
    "difficulty": 1,
    "origin": "OPOS24_gpt",
    "type": "flashcard",
    "question": "Quin és el resultat final esperat d’una bona gestió d’implicats?",
    "answerOptions": [
      {
        "text": "Aquesta me la sé",
        "isCorrect": true,
        "rationale": "Compromís actiu, comunicació efectiva i suport continu dels stakeholders clau."
      },
      {
        "text": "Encara no me la sé",
        "isCorrect": false,
        "rationale": ""
      }
    ]
  },

  {
    "guid": "02f3bce8-10a4-4ed8-9a04-cd90b64c3b6f",
    "subjectId": "T10",
    "difficulty": 1,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Segons el PMBOK, quin d’aquests elements descriu millor què és un implicat (stakeholder)?",
    "answerOptions": [
      {
        "text": "Qualsevol persona, grup o organització que pot afectar o ser afectada pel projecte.",
        "isCorrect": true,
        "rationale": "Aquesta és la definició oficial segons PMBOK. Inclou tant participants interns com externs."
      },
      {
        "text": "Només les persones que treballen directament dins l’equip de projecte.",
        "isCorrect": false,
        "rationale": "Els implicats inclouen també usuaris, ciutadania, direcció i proveïdors, no només l’equip."
      },
      {
        "text": "Només els responsables de prendre decisions sobre pressupost i recursos.",
        "isCorrect": false,
        "rationale": "El poder de decisió és una característica possible, però no defineix l’abast complet d’un implicat."
      },
      {
        "text": "Qualsevol persona amb un contracte signat amb l’organització promotora.",
        "isCorrect": false,
        "rationale": "El PMBOK no limita la definició a persones contractualment vinculades."
      }
    ],
    "hint": "Inclou tant qui influeix com qui és influït pel projecte."
  },
  {
    "guid": "bbaf4a04-9c5d-4b69-a861-25489a5fd21a",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Quin document es crea com a sortida directa del procés 'Identify Stakeholders'?",
    "answerOptions": [
      {
        "text": "El registre d’implicats (Stakeholder Register).",
        "isCorrect": true,
        "rationale": "És el document que recull informació sobre tots els implicats i és la sortida principal del procés."
      },
      {
        "text": "El pla de comunicacions.",
        "isCorrect": false,
        "rationale": "El pla de comunicacions s’elabora més endavant, en la fase de planificació."
      },
      {
        "text": "L’acta de constitució del projecte (Project Charter).",
        "isCorrect": false,
        "rationale": "L’acta és una entrada al procés, no una sortida."
      },
      {
        "text": "L’informe de lliçons apreses.",
        "isCorrect": false,
        "rationale": "Aquest document pertany a la fase de tancament, no a la d’inici."
      }
    ],
    "hint": "És el primer document formal on s’identifiquen i classifiquen els implicats."
  },
  {
    "guid": "c9782748-98eb-4b5a-9e60-fd7fcb498dc4",
    "subjectId": "T10",
    "difficulty": 3,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Quina és la millor descripció del procés 'Manage Stakeholder Engagement' segons el PMBOK?",
    "answerOptions": [
      {
        "text": "Comunicar-se i treballar amb els implicats per satisfer les seves necessitats i resoldre incidències.",
        "isCorrect": true,
        "rationale": "Aquest procés se centra en la interacció activa amb els implicats per mantenir el seu compromís."
      },
      {
        "text": "Identificar nous implicats que puguin aparèixer durant el projecte.",
        "isCorrect": false,
        "rationale": "Això forma part del procés 'Identify Stakeholders', no de 'Manage'."
      },
      {
        "text": "Analitzar la influència i el poder dels implicats per prioritzar-los.",
        "isCorrect": false,
        "rationale": "Aquesta activitat pertany al procés de planificació, no al de gestió activa."
      },
      {
        "text": "Avaluar la satisfacció dels implicats al final del projecte.",
        "isCorrect": false,
        "rationale": "Aquesta acció es fa durant el tancament o en 'Monitor Stakeholder Engagement'."
      }
    ],
    "hint": "Aquest procés està dins del grup d’execució del projecte."
  },
  {
    "guid": "b4c438c3-06c4-4f63-95a9-d021e2375029",
    "subjectId": "T10",
    "difficulty": 3,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "En la matriu poder/interès, quina estratègia s’ha d’aplicar als implicats amb baix poder i alt interès?",
    "answerOptions": [
      {
        "text": "Mantenir-los informats.",
        "isCorrect": true,
        "rationale": "Tot i que no tenen poder de decisió, estan molt interessats i cal mantenir-los informats per evitar desconnexió o resistència."
      },
      {
        "text": "Gestió activa i personalitzada.",
        "isCorrect": false,
        "rationale": "Aquesta estratègia és per implicats amb alt poder i alt interès."
      },
      {
        "text": "Mantenir-los satisfets.",
        "isCorrect": false,
        "rationale": "És l’estratègia per a implicats amb alt poder i baix interès."
      },
      {
        "text": "Supervisió mínima.",
        "isCorrect": false,
        "rationale": "Aquesta opció s’aplica a implicats amb baix poder i poc interès."
      }
    ],
    "hint": "Són persones amb interès però poc poder d’influència."
  },
  {
    "guid": "56f97a17-1b9d-449d-91cd-529ed6ee6a4b",
    "subjectId": "T10",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Quina és la diferència principal entre els processos 'Plan Stakeholder Engagement' i 'Monitor Stakeholder Engagement'?",
    "answerOptions": [
      {
        "text": "El primer defineix estratègies per a la implicació, mentre que el segon avalua si aquestes estratègies funcionen i s’han d’ajustar.",
        "isCorrect": true,
        "rationale": "Correcte. La planificació crea el pla; el monitoratge revisa i millora l’execució d’aquest pla."
      },
      {
        "text": "El primer és opcional, mentre que el segon és obligatori segons el PMBOK.",
        "isCorrect": false,
        "rationale": "Cap dels dos és opcional, formen part integral del cicle de vida del projecte."
      },
      {
        "text": "El primer controla els riscos associats a la comunicació amb implicats.",
        "isCorrect": false,
        "rationale": "Els riscos es gestionen en el pla de riscos, no en aquests processos."
      },
      {
        "text": "El segon serveix per aprovar els canvis de pressupost vinculats als implicats.",
        "isCorrect": false,
        "rationale": "El monitoratge d’implicats no tracta aspectes pressupostaris."
      }
    ],
    "hint": "Planificar defineix com fer-ho; monitoritzar comprova com està funcionant."
  },
  {
    "guid": "e2b0e264-9b5e-43a5-b5b1-7a96a6b20e59",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Quin d’aquests elements és una entrada clau per al procés 'Identify Stakeholders'?",
    "answerOptions": [
      {
        "text": "L’acta de constitució del projecte (Project Charter).",
        "isCorrect": true,
        "rationale": "És una de les entrades principals, ja que identifica els patrocinadors i objectius inicials."
      },
      {
        "text": "El pla de comunicacions.",
        "isCorrect": false,
        "rationale": "El pla de comunicacions encara no s’ha elaborat en aquesta fase."
      },
      {
        "text": "L’informe de lliçons apreses.",
        "isCorrect": false,
        "rationale": "Aquesta és una entrada per a projectes futurs o per a tancaments, no per a la identificació inicial."
      },
      {
        "text": "El registre de riscos.",
        "isCorrect": false,
        "rationale": "El registre de riscos s’elabora més endavant i no és una entrada inicial."
      }
    ],
    "hint": "És el document que autoritza formalment el projecte i identifica els primers actors clau."
  },
  {
    "guid": "b19355de-1f85-4c78-96d0-36cd6310f013",
    "subjectId": "T10",
    "difficulty": 3,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Quan un implicat canvia de rol o d’actitud durant el projecte, què s’ha de fer segons PMBOK?",
    "answerOptions": [
      {
        "text": "Actualitzar el registre d’implicats i, si cal, ajustar el pla de gestió d’implicats.",
        "isCorrect": true,
        "rationale": "El registre i el pla són documents vius que s’han d’actualitzar segons els canvis d’actitud o influència."
      },
      {
        "text": "Esborrar l’entrada antiga del registre per evitar confusió.",
        "isCorrect": false,
        "rationale": "Mai s’esborra informació; s’actualitza per mantenir l’històric i la traçabilitat."
      },
      {
        "text": "Ignorar el canvi si no afecta l’abast tècnic del projecte.",
        "isCorrect": false,
        "rationale": "Els canvis d’actitud poden afectar el suport i, per tant, l’èxit del projecte."
      },
      {
        "text": "Informar només al patrocinador, sense modificar cap document.",
        "isCorrect": false,
        "rationale": "El canvi s’ha de reflectir als documents oficials de gestió d’implicats."
      }
    ],
    "hint": "El registre és un document viu i es manté actualitzat al llarg de tot el projecte."
  },


  {
    "guid": "4550d1e0-4e69-4229-8ff9-61db21e249bd",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Qué es un 'stakeholder' o implicado según el PMBOK?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Cualquier persona, grupo u organización que puede afectar, ser afectado o percibirse como afectado por un proyecto."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "1bf6eff6-71d8-4231-af88-1de589732fc6",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "Menciona tres ejemplos habituales de stakeholders en un proyecto.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Clientes/usuarios finales, equipo del proyecto, patrocinadores (sponsors), proveedores, autoridades reguladoras."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "1698ee73-72b3-4ab6-8cc1-6bff1dc4d8ac",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Cuál es el objetivo principal de la Gestión de Implicados en un proyecto?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Asegurar el apoyo y compromiso de las partes interesadas durante todo el ciclo de vida del proyecto para garantizar su éxito."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "a6000f8b-6668-49b2-aae8-002c5c9e62c3",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Cuántos procesos conforman el área de conocimiento de Gestión de Implicados según la 6ª edición del PMBOK?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Cuatro procesos."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "8e1769ef-4e70-41de-bdbb-c137c48bf6b1",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "Nombra los 4 procesos de la Gestión de Implicados en el orden correcto.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "1. Identificar a los Interesados, 2. Planificar el Involucramiento de los Interesados, 3. Gestionar el Involucramiento de los Interesados, 4. Monitorear el Involucramiento de los Interesados."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "95a01161-e954-4cf4-9144-25bc66aedad8",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿En qué fase del proyecto se lleva a cabo el proceso 'Identificar a los Interesados'?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "En la fase de Iniciación."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "88dc7351-4d86-4cba-afbe-9c295eef7f9c",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Cuál es la salida principal del proceso 'Identificar a los Interesados'?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "El Registro de Interesados (Stakeholder Register)."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "6eeddbc6-540e-4917-8c6e-17ac2e001c9e",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Qué documento clave, que se crea en la fase de iniciación, sirve como entrada principal para 'Identificar a los Interesados'?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "El Acta de Constitución del Proyecto (Project Charter)."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "275439f8-f40d-41c5-ae1b-765d68c4a2b8",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Qué información clave contiene el Registro de Interesados?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Nombres, intereses, poder/influencia, actitud y estrategias de gestión para cada stakeholder."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "d0e2fb0a-a8f1-4a58-8c33-59960900fb61",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Para qué se utiliza la matriz de poder/interés?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Para clasificar a los stakeholders y ayudar a definir la estrategia de gestión para cada uno según su nivel de influencia e interés."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "2c7ce082-a913-4cbb-9382-3468468c2a58",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿En qué fase del proyecto se desarrolla el proceso 'Planificar el Involucramiento de los Interesados'?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "En la fase de Planificación."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "fadc0d27-7cf2-4c89-8148-1312962bd902",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Cuál es la salida principal del proceso 'Planificar el Involucramiento de los Interesados'?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "El Plan de Gestión de Interesados (Stakeholder Engagement Plan)."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "b68efd2a-4761-495f-935b-4bb8aa784b3f",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "La herramienta que compara el grado de compromiso actual de un stakeholder con el que se desea alcanzar se llama _____.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Matriz de involucramiento actual vs. deseada."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "9b7a2a22-49ff-4fd3-8e11-f590366378fc",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿En qué fase del proyecto se ejecuta el proceso 'Gestionar el Involucramiento de los Interesados'?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "En la fase de Ejecución."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "2e0faa7f-4136-415a-ad08-36c0c64d2471",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Cuál es el objetivo del proceso 'Gestionar el Involucramiento de los Interesados'?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Comunicarse activamente, resolver conflictos y obtener el apoyo y compromiso activo de los stakeholders."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "95355aa2-1e97-4631-bcfc-e60b7e9543da",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "Menciona tres habilidades clave del director de proyecto para gestionar la implicación de los stakeholders.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Inteligencia emocional, empatía, escucha activa, persuasión y negociación."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "f1cdc0dc-9836-431a-967b-e1138284e35e",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿En qué fase del proyecto se lleva a cabo el proceso 'Monitorear el Involucramiento de los Interesados'?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "En la fase de Monitoreo y Control."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "eeedd0ef-c8b6-4c49-8411-8d5f64c34a9f",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Cuál es el objetivo del proceso 'Monitorear el Involucramiento de los Interesados'?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Hacer seguimiento del compromiso de los stakeholders y ajustar las estrategias de gestión según sea necesario."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "50698ddd-35fe-4312-917a-077f026d294b",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "En la matriz de poder/interés, ¿qué estrategia se debe aplicar a un stakeholder con alto poder y alto interés?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Gestionar activamente y de forma cercana."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "4e506791-5220-4ca7-a2e0-09d26cfacd45",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "En la matriz de poder/interés, ¿qué estrategia se debe aplicar a un stakeholder con alto poder pero bajo interés?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Mantenerlo satisfecho."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "67dfd1f3-a927-42ca-9781-5617d8ca4ccd",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "En la matriz de poder/interés, ¿qué estrategia se debe aplicar a un stakeholder con bajo poder pero alto interés?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Mantenerlo informado."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "2d3b09c7-049e-4d02-9c89-03016a4133ba",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "En la matriz de poder/interés, ¿qué estrategia se debe aplicar a un stakeholder con bajo poder y bajo interés?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Supervisar mínimamente."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "6ac7e746-b10a-437d-b4dc-5c9c9597f7d9",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Cuál es la diferencia clave entre comunicar e implicar a un stakeholder?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Comunicar es transmitir información, mientras que implicar es crear un compromiso activo y bidireccional, haciéndolos partícipes."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "49dd7188-80f2-4db1-862c-40782100ee20",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "Un error habitual en la gestión de implicados es asumir que _____ entiende los objetivos del proyecto de la misma manera.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "todo el mundo"
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "65c06aaf-5a90-4465-977f-7d7fcd848fe7",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Por qué es una buena práctica identificar a los implicados lo antes posible en el proyecto?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Para comprender sus necesidades y expectativas desde el principio e integrarlas en la planificación del proyecto."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "37bbc772-a465-41c1-8531-6011ef517d72",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "El documento que detalla cómo se interactuará con cada stakeholder, incluyendo frecuencia y formato de comunicación, es el _____.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Plan de Gestión de Interesados (Stakeholder Engagement Plan)."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "4f70041b-d059-4f62-b5a7-5ea529af1aa9",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Es cierto que el Registro de Interesados se crea al inicio del proyecto y no se modifica?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "No, es falso. Debe revisarse y actualizarse periódicamente a lo largo de todo el proyecto."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "1e3cb5b4-abef-4e3f-bf3c-b754d62eea4f",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Quién es el principal responsable de gestionar la implicación de los stakeholders en un proyecto?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "El Director de Proyecto (Project Manager)."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "0f2c136c-5f4a-4904-8cde-c29037e7f9bc",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Cómo se relaciona la gestión de implicados con la gestión de riesgos?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Los stakeholders pueden ser una fuente de riesgos (si se oponen) o pueden ayudar a mitigarlos (si apoyan activamente)."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "add28b1b-2765-4c16-bee5-eb7f122f1c8e",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Qué se debe hacer con los stakeholders que tienen una actitud negativa hacia el proyecto?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Desarrollar estrategias específicas para minimizar su oposición, gestionar sus preocupaciones y, si es posible, convertir su resistencia en apoyo o neutralidad."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "4397aa36-4c23-492f-9984-f36b163916cd",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "La afirmación 'Los stakeholders son únicamente personas internas de la organización' es...",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Falsa, ya que también incluye a entidades y personas externas como clientes, proveedores, ciudadanos y organismos reguladores."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "1ce70880-2f80-459f-ad75-5a387bfd0bcc",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "Confundir la gestión de la implicación con simplemente enviar informes es un error porque la implicación requiere _____.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Conseguir un compromiso activo y una comunicación bidireccional."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "5720a1c5-4a25-4155-89af-153f2c257a82",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "El Plan de Gestión de Implicados es una salida del proceso de _____, no una entrada del proceso de identificación.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "planificación"
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "f283b747-b5bd-4543-8d70-42e517b0b45b",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "El patrocinador (sponsor) del proyecto es un stakeholder clave. ¿Cuál es su función principal?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Dar apoyo, proporcionar recursos, legitimar el proyecto y ayudar a resolver conflictos de alto nivel."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "7d7cf740-44e4-4ba3-9a2b-b1a97b888ad6",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "Menciona una herramienta utilizada durante el proceso 'Identificar a los Interesados'.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Análisis de partes interesadas, brainstorming, entrevistas o la matriz poder/interés."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "b6abda95-0939-48cb-8915-5001bac1f376",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "Menciona una herramienta utilizada durante el proceso 'Monitorear el Involucramiento de los Interesados'.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Análisis de satisfacción, reuniones de seguimiento, encuestas o entrevistas."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "0bf72b3d-9f35-4073-9091-3ca7807da2d6",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Qué tipo de acciones se llevan a cabo durante el proceso 'Gestionar el Involucramiento de los Interesados'?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Asegurar canales de comunicación bidireccionales, aplicar técnicas de negociación y gestionar cambios en las expectativas."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "276db2d9-1920-44c0-87e5-2f12e8121ac3",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Qué son los stakeholders 'negativos'?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Aquellos que pueden oponerse, bloquear o percibir negativamente el proyecto y sus resultados."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "b8ba0d02-5dba-404f-a720-2c3540dc6828",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Qué es una estrategia de influencia en la gestión de stakeholders?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Un conjunto de acciones planificadas para conseguir un cambio positivo en la actitud o comportamiento de un stakeholder."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "673a8a63-d57b-4a71-b0f4-f4e2cf622d47",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Por qué la gestión de expectativas es crucial en la relación con los implicados?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Para alinear lo que los implicados esperan recibir con lo que el proyecto realmente puede ofrecer, evitando así frustraciones y conflictos."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "01013600-fec1-42d8-b8b0-f7f7a3a458ec",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "El proceso 'Controlar la Implicación' (según la fuente) se corresponde con el proceso PMBOK llamado _____",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Monitorear el Involucramiento de los Interesados (Monitor Stakeholder Engagement)."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "424e8b11-a7fa-4ca9-a9e7-df182db49c79",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Qué dos documentos clave se actualizan como resultado del proceso de monitoreo de la implicación?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "El Registro de Implicados y el Plan de Gestión de Implicados."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "c78d6c20-872e-4b42-b3ef-ef2a3d5546a3",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Cuál es la relación entre el Plan de Gestión de Comunicaciones y el Plan de Gestión de Implicados?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Están estrechamente relacionados; el plan de comunicaciones define el 'cómo, qué y cuándo' de la información, que es una herramienta clave para ejecutar el plan de implicación."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "da5d14ee-8f80-48f9-909b-b566ef48e34c",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "Menciona un indicador de éxito en la gestión de implicados.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Alto nivel de participación y apoyo, comunicación fluida, ausencia de conflictos graves o cumplimiento de las expectativas."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "9a58bd44-513b-459d-b676-cba071fb16b2",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "Un error común es omitir stakeholders importantes. ¿Cómo se puede mitigar este riesgo?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Realizando un análisis exhaustivo del entorno, brainstorming y consultando con expertos y la documentación de proyectos anteriores."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "585fd85e-cec2-4422-93bf-6a1d216da628",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "La comunicación poco frecuente o demasiado _____ es un error habitual en la gestión de stakeholders.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "genérica"
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "516b3b86-2c3a-4207-98a9-23f2ed07efbe",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "El objetivo final de la gestión de implicados no es satisfacer a todos, sino _____ para alcanzar los objetivos del proyecto.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "alinear intereses y asegurar el apoyo suficiente"
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "6506702a-7528-4843-ac9c-18a4b8097d83",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "En un proyecto público, ¿quiénes serían ejemplos de stakeholders externos clave?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "La ciudadanía, autoridades reguladoras, medios de comunicación y empresas proveedoras."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "db6aac5c-9cc3-47db-a3ec-61e43a422139",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Qué significa que la gestión de implicados debe ser proactiva?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Significa anticiparse a los problemas, detectar conflictos latentes y buscar apoyos antes de que surjan resistencias, en lugar de solo reaccionar a los eventos."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "1e2c8ca1-8478-41fb-96fb-d9790f402918",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "Si el nivel de implicación actual de un stakeholder es 'Resistente' y el deseado es 'Neutral', ¿qué tipo de acciones se deberían planificar?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Acciones para comprender las causas de su resistencia, comunicarse para aclarar dudas y negociar para minimizar su impacto negativo."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "a5966ac2-dd00-4043-bf0d-e9e656443ead",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "El documento que formaliza el proyecto y menciona a los primeros stakeholders clave es el ____.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Acta de Constitución del Proyecto (Project Charter)."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "a86b0d85-626a-4e9a-b351-4e9c6fa210a6",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Cuál es la principal diferencia entre 'gestionar' la implicación y 'controlar' (monitorear) la implicación?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Gestionar es la ejecución de las estrategias (acción), mientras que controlar/monitorear es la evaluación de la efectividad de esas estrategias y su ajuste (seguimiento)."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "6b250ba1-b152-43c0-8cef-1d1165369e15",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "Un stakeholder con alto poder pero bajo interés, como el departamento de Intervención, requiere una estrategia de ____.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Mantener satisfecho."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "1baf09e4-9fe3-47cb-aab6-7b3e26854a32",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "Un stakeholder con bajo poder pero alto interés, como el personal operativo afectado por un nuevo software, requiere una estrategia de ____.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Mantener informado."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "c48b24bf-e312-418f-a2c3-479dcb18fb95",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "Si un stakeholder clave cambia de actitud o de poder durante el proyecto, ¿qué acción inmediata debe tomar el Director de Proyecto?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Actualizar el Registro de Implicados y reevaluar/ajustar el Plan de Gestión de Implicados."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "440c98a4-7826-4274-83e8-63ebefb7c19a",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "El envío de informes mensuales a un directivo es un ejemplo de ____.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Comunicación."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "f89d10ec-e020-46f1-8ebb-a3da3c6cdf78",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "Hacer partícipe a un directivo en decisiones clave del proyecto es un ejemplo de ____.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Implicación (o involucramiento)."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "d243f0d3-fc95-4950-9791-61db776fd168",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "La afirmación: 'Solo se gestionan los implicados favorables al proyecto' es...",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Falsa. También se deben gestionar activamente los implicados negativos o con resistencia para minimizar su impacto."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "99a45318-82b7-4b43-a28f-aca432a1d164",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "Además de la matriz poder/interés, ¿qué otra herramienta de análisis de stakeholders se menciona en las fuentes?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Matriz de implicación actual vs. desitjada (actual vs. deseada), Power/Influence Grid, o Stakeholder Cube."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "12ddbf7b-680a-4784-82d3-7094d02a9566",
    "subjectId": "T10",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿En qué consiste el error de 'Comunicación unidireccional o inefectiva'?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "En limitarse a enviar información sin establecer canales para recibir feedback, resolver dudas o fomentar el diálogo."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },



  {
    "guid": "c9adf0f2-9332-4ef3-b784-0c94e3c4e4a5",
    "subjectId": "T10",
    "difficulty": 3,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Quina és la diferència principal entre els implicats i l’equip de projecte segons el PMBOK?",
    "answerOptions": [
      {
        "text": "Els implicats inclouen només les persones internes de l’organització promotora.",
        "isCorrect": false,
        "rationale": "Fals. Els implicats poden ser interns o externs; inclou ciutadania, proveïdors, usuaris, etc."
      },
      {
        "text": "L’equip de projecte forma part dels implicats, però els implicats poden incloure altres actors que no participen directament en el projecte.",
        "isCorrect": true,
        "rationale": "Correcte. Els implicats són un concepte més ampli que engloba l’equip de projecte i altres parts afectades."
      },
      {
        "text": "Els implicats són persones assignades formalment al projecte mitjançant el Project Charter.",
        "isCorrect": false,
        "rationale": "Fals. El Project Charter pot esmentar alguns implicats, però no els assigna formalment."
      },
      {
        "text": "Només els membres de l’equip de projecte són considerats implicats segons el PMBOK.",
        "isCorrect": false,
        "rationale": "Incorrecte: el PMBOK especifica clarament que no tots els implicats formen part de l’equip."
      }
    ],
    "hint": "Recorda: tots els membres de l’equip són implicats, però no tots els implicats formen part de l’equip."
  },
  {
    "guid": "2b34b0d3-fdf9-4f7e-9cde-2ce23b705f8a",
    "subjectId": "T10",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Quin dels següents documents NO és una entrada ni una sortida directa d’algun procés de gestió d’implicats?",
    "answerOptions": [
      {
        "text": "Stakeholder Register (Registre d’implicats)",
        "isCorrect": false,
        "rationale": "És una sortida del procés Identify Stakeholders i una entrada per a la planificació."
      },
      {
        "text": "Stakeholder Engagement Plan (Pla de gestió d’implicats)",
        "isCorrect": false,
        "rationale": "És una sortida del procés Plan Stakeholder Engagement."
      },
      {
        "text": "Project Charter (Acta de constitució del projecte)",
        "isCorrect": true,
        "rationale": "Encara que serveixi de base per identificar implicats, no és ni entrada ni sortida d’aquests processos directament segons el PMBOK."
      },
      {
        "text": "Change Requests (Sol·licituds de canvi)",
        "isCorrect": false,
        "rationale": "Poden aparèixer com a sortida dels processos de gestió o control d’implicats si es requereixen canvis de comunicació o estratègia."
      }
    ],
    "hint": "Només un d’aquests documents no forma part directa del flux d’entrades o sortides d’aquests processos."
  },
  {
    "guid": "56e95893-cb82-4e4c-b079-5a254a59f787",
    "subjectId": "T10",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Quina de les següents afirmacions és CORRECTA sobre la relació entre la gestió d’implicats i la gestió de comunicacions?",
    "answerOptions": [
      {
        "text": "El pla de comunicacions és independent del pla de gestió d’implicats i no hi té relació.",
        "isCorrect": false,
        "rationale": "Fals. Els dos plans estan estretament vinculats, ja que la comunicació és la principal eina per gestionar implicats."
      },
      {
        "text": "La gestió d’implicats depèn totalment del pla de comunicacions i no pot existir de manera separada.",
        "isCorrect": false,
        "rationale": "Tampoc és cert; són àrees diferents però complementàries dins del PMBOK."
      },
      {
        "text": "Els plans de comunicació i de gestió d’implicats es desenvolupen en paral·lel i s’alimenten mútuament.",
        "isCorrect": true,
        "rationale": "Correcte. Es creen durant la planificació i estan interconnectats per garantir coherència en les interaccions."
      },
      {
        "text": "Només el pla de comunicacions defineix com es gestionen les expectatives dels implicats.",
        "isCorrect": false,
        "rationale": "Fals. La gestió d’expectatives és responsabilitat principal del pla de gestió d’implicats."
      }
    ],
    "hint": "Pensa que la comunicació és l’eina per aplicar l’estratègia de gestió d’implicats."
  },
  {
    "guid": "b5b3b146-390a-4d4c-8e6e-29f88a2c0b3f",
    "subjectId": "T10",
    "difficulty": 3,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Quina d’aquestes situacions reflecteix millor una actualització necessària del registre d’implicats?",
    "answerOptions": [
      {
        "text": "Un usuari intern demana més informació sobre el projecte.",
        "isCorrect": false,
        "rationale": "Això és una acció de comunicació, no implica un canvi en el registre d’implicats."
      },
      {
        "text": "Un representant polític inicialment neutral passa a oposar-se o donar suport activament al projecte.",
        "isCorrect": true,
        "rationale": "Correcte. Un canvi d’actitud o influència és un motiu directe per actualitzar el registre."
      },
      {
        "text": "Un tècnic canvia de departament, però segueix treballant al mateix projecte.",
        "isCorrect": false,
        "rationale": "El canvi organitzatiu intern no implica necessàriament un canvi de rol o influència dins del projecte."
      },
      {
        "text": "Es canvia l’eina digital usada per gestionar els implicats.",
        "isCorrect": false,
        "rationale": "El registre d’implicats no es modifica per qüestions d’eina o tecnologia utilitzada."
      }
    ],
    "hint": "Quan canvia el poder, la influència o l’actitud d’un stakeholder, cal actualitzar el registre."
  },
  {
    "guid": "db8a874a-3b94-45e1-8d8b-8db963e5bfa2",
    "subjectId": "T10",
    "difficulty": 3,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Durant l’execució del projecte, un implicat clau expressa desacord amb l’estratègia adoptada. Quina acció és més adequada segons PMBOK?",
    "answerOptions": [
      {
        "text": "Ignorar el comentari si el projecte compleix l’abast i els terminis previstos.",
        "isCorrect": false,
        "rationale": "Ignorar-lo pot generar resistències majors o riscos de suport polític o funcional."
      },
      {
        "text": "Registrar la incidència i revisar el pla de gestió d’implicats per ajustar l’estratègia de comunicació amb aquesta persona.",
        "isCorrect": true,
        "rationale": "Correcte. El PMBOK estableix que el compromís dels implicats s’ha de revisar i ajustar segons la seva actitud i resposta."
      },
      {
        "text": "Canviar immediatament l’abast del projecte per satisfer l’implicat.",
        "isCorrect": false,
        "rationale": "Això vulneraria el control de canvis i podria crear precedents negatius."
      },
      {
        "text": "Sol·licitar una reunió amb l’equip tècnic per resoldre-ho sense modificar documents.",
        "isCorrect": false,
        "rationale": "Tot canvi d’estratègia ha de quedar reflectit documentalment al pla de gestió d’implicats."
      }
    ],
    "hint": "El PMBOK recomana sempre revisar i actualitzar el pla d’implicats quan hi ha canvis d’actitud o conflicte."
  },
  {
    "guid": "8b05b5bb-8146-4dc6-a7fd-5823d1fc8020",
    "subjectId": "T10",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Quina de les següents afirmacions és FALSA respecte al cicle de vida de la gestió d’implicats?",
    "answerOptions": [
      {
        "text": "S’inicia a la fase d’inici del projecte i continua durant tot el seu cicle de vida.",
        "isCorrect": false,
        "rationale": "Aquesta afirmació és correcta segons PMBOK."
      },
      {
        "text": "Els implicats poden canviar durant el projecte, per la qual cosa el registre s’ha d’actualitzar.",
        "isCorrect": false,
        "rationale": "Correcte segons PMBOK, no és la falsa."
      },
      {
        "text": "Només es gestionen els implicats favorables al projecte, ja que els opositors no aporten valor.",
        "isCorrect": true,
        "rationale": "Falsa. Els implicats opositors també s’han d’identificar i gestionar activament per reduir resistències."
      },
      {
        "text": "El compromís dels implicats es controla periòdicament per avaluar-ne l’efectivitat.",
        "isCorrect": false,
        "rationale": "Aquesta afirmació és correcta i descriu el procés Monitor Stakeholder Engagement."
      }
    ],
    "hint": "Revisa el principi del PMBOK: tots els implicats s’han de gestionar, no només els favorables."
  },


  {
    "guid": "461eca86-b7d0-4bbc-90b0-66da96acedc9",
    "subjectId": "T10",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "Durante la fase de ejecución de un proyecto, el director del proyecto se dedica a resolver un conflicto entre dos stakeholders clave y a asegurarse de que sus expectativas se mantengan alineadas con los objetivos. ¿En qué proceso de la Gestión de Implicados se encuentra?",
    "answerOptions": [
      {
        "text": "Identificar a los Interesados",
        "isCorrect": false,
        "rationale": "Este proceso se realiza en la fase de iniciación para determinar quiénes son los stakeholders, no para gestionar activamente sus relaciones durante la ejecución."
      },
      {
        "text": "Planificar la Participación de los Interesados",
        "isCorrect": false,
        "rationale": "La planificación define las estrategias a seguir, pero la acción de resolver conflictos y gestionar expectativas en tiempo real corresponde a una fase posterior."
      },
      {
        "text": "Gestionar la Participación de los Interesados",
        "isCorrect": true,
        "rationale": "Este proceso se centra en la comunicación activa, la negociación y la resolución de conflictos para fomentar el compromiso durante la ejecución del proyecto."
      },
      {
        "text": "Monitorear la Participación de los Interesados",
        "isCorrect": false,
        "rationale": "Monitorear implica hacer seguimiento y evaluar la efectividad de las estrategias, mientras que la acción descrita es la ejecución de dichas estrategias."
      }
    ],
    "hint": "Piensa en la diferencia entre planificar una acción, ejecutarla y supervisar sus resultados."
  },
  {
    "guid": "73d91906-348c-4096-853b-f57e9ded929d",
    "subjectId": "T10",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "Un stakeholder ha sido clasificado en la matriz de poder/interés con un alto poder de influencia pero con un bajo interés en el día a día del proyecto. ¿Cuál es la estrategia de gestión recomendada por el PMBOK?",
    "answerOptions": [
      {
        "text": "Gestionar activamente",
        "isCorrect": false,
        "rationale": "Esta estrategia se reserva para aquellos con alto poder y alto interés, que requieren una implicación constante y personalizada."
      },
      {
        "text": "Mantener informado",
        "isCorrect": false,
        "rationale": "Esta táctica es adecuada para stakeholders con alto interés pero bajo poder, que necesitan estar al tanto pero no tienen gran influencia."
      },
      {
        "text": "Monitorear mínimamente",
        "isCorrect": false,
        "rationale": "Se aplica a stakeholders con bajo poder y bajo interés, ya que su impacto en el proyecto es mínimo."
      },
      {
        "text": "Mantener satisfecho",
        "isCorrect": true,
        "rationale": "El objetivo con este perfil es asegurar que sus necesidades y requerimientos sean atendidos para evitar que su alto poder se convierta en un obstáculo, sin abrumarlos con información innecesaria."
      }
    ],
    "hint": "Considera cómo tratarías a alguien influyente que no quiere involucrarse en los detalles, pero cuya opinión es crucial."
  },
  {
    "guid": "c468a530-43a6-43bc-a79e-f4fc56cadd59",
    "subjectId": "T10",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "El Acta de Constitución del Proyecto (Project Charter) es un documento fundamental al inicio de un proyecto. ¿Cuál es su rol principal en el proceso 'Identificar a los Interesados'?",
    "answerOptions": [
      {
        "text": "Define las estrategias de comunicación detalladas para cada stakeholder.",
        "isCorrect": false,
        "rationale": "Las estrategias detalladas se desarrollan más tarde, en el Plan de Gestión de la Participación, no en el acta inicial."
      },
      {
        "text": "Sirve como entrada clave para identificar a los primeros stakeholders de alto nivel.",
        "isCorrect": true,
        "rationale": "Este documento nombra al patrocinador, al director del proyecto y a otras figuras clave, siendo el punto de partida para el registro de implicados."
      },
      {
        "text": "Es el resultado final que documenta a todos los stakeholders identificados y su clasificación.",
        "isCorrect": false,
        "rationale": "El resultado de este proceso es el Registro de Interesados (Stakeholder Register), no el Acta de Constitución."
      },
      {
        "text": "Contiene la matriz de implicación actual vs. deseada de los stakeholders.",
        "isCorrect": false,
        "rationale": "La matriz de implicación es una herramienta utilizada en el proceso de planificación, no un contenido del Acta de Constitución."
      }
    ],
    "hint": "Piensa en qué información contiene el primer documento oficial de un proyecto."
  },
  {
    "guid": "26c2a6fa-542b-4e68-a6e3-bbe7a52f136e",
    "subjectId": "T10",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "La principal diferencia entre el 'Registro de Implicados' (Stakeholder Register) y el 'Plan de Gestión de la Participación' (Stakeholder Engagement Plan) es que:",
    "answerOptions": [
      {
        "text": "El registro es un documento estático, mientras que el plan es dinámico y se actualiza constantemente.",
        "isCorrect": false,
        "rationale": "Ambos documentos son dinámicos y deben actualizarse a lo largo del ciclo de vida del proyecto a medida que cambian las circunstancias."
      },
      {
        "text": "El registro identifica 'quiénes son' los implicados y sus características, mientras que el plan define 'cómo' se gestionará su participación.",
        "isCorrect": true,
        "rationale": "El registro es un listado descriptivo y analítico (poder, interés, actitud), y el plan es un conjunto de estrategias y acciones para interactuar con ellos."
      },
      {
        "text": "El registro lo elabora el patrocinador, y el plan es responsabilidad exclusiva del director del proyecto.",
        "isCorrect": false,
        "rationale": "Ambos documentos son responsabilidad del director del proyecto, aunque se elaboren con la ayuda del equipo y otros implicados."
      },
      {
        "text": "El registro se enfoca solo en stakeholders externos, mientras que el plan incluye a los internos y externos.",
        "isCorrect": false,
        "rationale": "El registro de implicados debe incluir a todas las partes interesadas, tanto internas como externas, sin excepción."
      }
    ],
    "hint": "Uno de los documentos es una lista descriptiva y el otro es una guía de acción."
  },
  {
    "guid": "0977a155-d086-488c-9f83-5da73e41bfde",
    "subjectId": "T10",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "¿Cuál de las siguientes acciones corresponde inequívocamente al proceso de 'Monitorear la Participación de los Interesados'?",
    "answerOptions": [
      {
        "text": "Realizar un brainstorming para listar todos los posibles grupos afectados por el proyecto.",
        "isCorrect": false,
        "rationale": "Esta actividad es una herramienta típica del proceso de 'Identificar a los Interesados' al inicio del proyecto."
      },
      {
        "text": "Diseñar una estrategia de comunicación específica para un proveedor con actitud negativa.",
        "isCorrect": false,
        "rationale": "El diseño de estrategias se realiza durante el proceso de 'Planificar la Participación de los Interesados'."
      },
      {
        "text": "Enviar el informe de avance semanal a la dirección, tal como se había acordado.",
        "isCorrect": false,
        "rationale": "Ejecutar el plan de comunicación es parte de 'Gestionar la Participación de los Interesados'."
      },
      {
        "text": "Analizar los resultados de una encuesta de satisfacción para ver si la implicación de los usuarios ha mejorado.",
        "isCorrect": true,
        "rationale": "Este proceso se centra en supervisar las relaciones, medir la efectividad de las estrategias y realizar ajustes, lo cual incluye el análisis de feedback."
      }
    ],
    "hint": "Este proceso no se trata de actuar, sino de evaluar y ajustar el rumbo de las acciones."
  },
  {
    "guid": "64ffcffa-77b8-49c6-aaa0-c2c240a43d6d",
    "subjectId": "T10",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "Según el PMBOK, un stakeholder es cualquier individuo, grupo u organización que puede afectar, ser afectado o...?",
    "answerOptions": [
      {
        "text": "financiar una decisión, actividad o resultado del proyecto.",
        "isCorrect": false,
        "rationale": "La financiación es una forma de verse afectado o afectar, pero la definición completa incluye un elemento más subjetivo."
      },
      {
        "text": "percibirse a sí mismo como afectado por una decisión, actividad o resultado del proyecto.",
        "isCorrect": true,
        "rationale": "La definición del PMBOK incluye explícitamente la percepción, reconociendo que la creencia de ser afectado es suficiente para considerar a alguien un stakeholder."
      },
      {
        "text": "tener un contrato formal relacionado con el proyecto.",
        "isCorrect": false,
        "rationale": "Tener un contrato convierte a alguien en stakeholder, pero no es un requisito indispensable; por ejemplo, la ciudadanía no tiene un contrato."
      },
      {
        "text": "aprobar formalmente los entregables del proyecto.",
        "isCorrect": false,
        "rationale": "La aprobación de entregables es una función de ciertos stakeholders (como el cliente o el patrocinador), pero no es parte de la definición general."
      }
    ],
    "hint": "La definición completa abarca no solo el impacto real, sino también la percepción que se tiene sobre ese impacto."
  },
  {
    "guid": "df048160-aba5-4414-86dd-153fe53914f7",
    "subjectId": "T10",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "Un director de proyecto nota que la resistencia de un grupo de usuarios ha aumentado. Después de analizar la situación, decide cambiar la estrategia de 'mantenerlos informados' a 'involucrarlos en talleres de diseño'. ¿En qué documento clave se debería registrar formalmente este cambio de estrategia?",
    "answerOptions": [
      {
        "text": "En el Acta de Constitución del Proyecto (Project Charter).",
        "isCorrect": false,
        "rationale": "El Acta de Constitución es un documento de alto nivel que se crea al inicio y no se modifica para reflejar cambios operativos en las estrategias de gestión."
      },
      {
        "text": "En el Plan de Gestión de las Comunicaciones.",
        "isCorrect": false,
        "rationale": "Aunque está relacionado, este plan detalla los canales y la frecuencia de la información. El cambio de estrategia en sí pertenece a un documento más específico sobre la implicación."
      },
      {
        "text": "En el Plan de Gestión de la Participación de los Interesados (Stakeholder Engagement Plan).",
        "isCorrect": true,
        "rationale": "Este documento es el lugar centralizado donde se definen y actualizan las estrategias específicas para gestionar el compromiso de cada stakeholder o grupo."
      },
      {
        "text": "En el Registro de Incidentes (Issue Log).",
        "isCorrect": false,
        "rationale": "El registro de incidentes documenta el problema (la resistencia), pero el cambio de estrategia a largo plazo se actualiza en el plan correspondiente."
      }
    ],
    "hint": "Busca el documento que sirve como hoja de ruta para las interacciones con los implicados."
  },
  {
    "guid": "cddd2550-0ba7-487d-a35e-7147d873e0e5",
    "subjectId": "T10",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "Uno de los errores más comunes en la gestión de implicados es confundir 'comunicación' con 'participación' (engagement). ¿Cuál es la distinción fundamental?",
    "answerOptions": [
      {
        "text": "La comunicación es siempre unidireccional, mientras que la participación es bidireccional.",
        "isCorrect": false,
        "rationale": "La comunicación puede ser bidireccional (por ejemplo, una reunión), pero su objetivo principal no es necesariamente el mismo que el de la participación."
      },
      {
        "text": "La comunicación busca transmitir información, mientras que la participación busca crear compromiso y alinear objetivos.",
        "isCorrect": true,
        "rationale": "La comunicación es una herramienta, pero la participación es el objetivo final: conseguir que los stakeholders apoyen activamente el proyecto y se sientan parte de él."
      },
      {
        "text": "La comunicación se gestiona a través del Plan de Comunicaciones y la participación a través del Registro de Implicados.",
        "isCorrect": false,
        "rationale": "Ambos conceptos se gestionan principalmente a través del Plan de Gestión de la Participación, que a su vez se alinea con el Plan de Comunicaciones."
      },
      {
        "text": "La comunicación se aplica a stakeholders de bajo poder y la participación a los de alto poder.",
        "isCorrect": false,
        "rationale": "Tanto la comunicación como la participación se aplican a todos los stakeholders, aunque la intensidad y la estrategia varíen según su clasificación."
      }
    ],
    "hint": "Piensa si es lo mismo enviar un correo informativo que organizar un taller colaborativo."
  },
  {
    "guid": "cd29c7a7-1423-421d-a138-0a9874ae5834",
    "subjectId": "T10",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "En la matriz de implicación actual vs. deseada, se identifica que el patrocinador del proyecto tiene un nivel de implicación 'Comprometido' (Supportive), pero el nivel deseado es 'Líder' (Leading). ¿Qué acción sería la más adecuada para gestionar esta brecha?",
    "answerOptions": [
      {
        "text": "Limitar su acceso a la información para que se centre en sus tareas de liderazgo.",
        "isCorrect": false,
        "rationale": "Limitar la información es contraproducente; un líder necesita tener una visión completa para poder defender el proyecto eficazmente."
      },
      {
        "text": "Proporcionarle informes de estado más detallados y frecuentes.",
        "isCorrect": false,
        "rationale": "Esto lo mantendría informado, pero no necesariamente fomentaría un rol de liderazgo activo. Puede ser parte de la solución, pero no es la acción principal."
      },
      {
        "text": "Involucrarlo activamente en la eliminación de obstáculos y la defensa del proyecto ante otros directivos.",
        "isCorrect": true,
        "rationale": "Un rol de 'Líder' implica tomar la iniciativa, defender el proyecto y usar su influencia para asegurar el éxito, y esta acción promueve directamente ese comportamiento."
      },
      {
        "text": "Documentar la brecha en el registro de riesgos y aceptarla, ya que su apoyo actual es suficiente.",
        "isCorrect": false,
        "rationale": "Aceptar la brecha no es una gestión proactiva. Si el nivel deseado es 'Líder', es porque se considera necesario para el éxito del proyecto."
      }
    ],
    "hint": "Considera qué distingue a alguien que simplemente apoya un proyecto de alguien que lo lidera y defiende activamente."
  },
  {
    "guid": "9216f0b9-4ba2-4ad9-973f-512dbb364962",
    "subjectId": "T10",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "Según la fuente, la gestión de implicados tiene una estrecha relación con otras áreas de conocimiento del PMBOK. ¿Con qué área está más íntimamente ligada la identificación de un stakeholder negativo que se opone activamente al proyecto?",
    "answerOptions": [
      {
        "text": "Gestión de la Integración",
        "isCorrect": false,
        "rationale": "La gestión de la integración coordina todas las partes del proyecto, pero no se enfoca específicamente en las amenazas que surgen de las actitudes de las personas."
      },
      {
        "text": "Gestión de los Recursos",
        "isCorrect": false,
        "rationale": "Esta área se centra en el equipo del proyecto y los recursos físicos, no en las amenazas provenientes de actores externos o internos que se oponen."
      },
      {
        "text": "Gestión de los Riesgos",
        "isCorrect": true,
        "rationale": "Un stakeholder con una actitud negativa y poder de influencia representa una amenaza directa para los objetivos del proyecto, lo que lo convierte en una fuente de riesgo que debe ser gestionada."
      },
      {
        "text": "Gestión de las Adquisiciones",
        "isCorrect": false,
        "rationale": "Esta área se ocupa de la compra de bienes y servicios a proveedores, lo cual es un ámbito diferente al de la gestión de la oposición al proyecto."
      }
    ],
    "hint": "Piensa en cómo se clasifica una amenaza potencial para el proyecto que proviene de la actitud de una persona o grupo."
  },
  {
    "guid": "b5eb35cd-8b89-40ad-8854-5228b6aa50af",
    "subjectId": "T10",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "El proceso 'Identificar Implicados' debe realizarse lo antes posible. Sin embargo, ¿por qué es fundamental que sea un proceso continuo y no una actividad única al inicio del proyecto?",
    "answerOptions": [
      {
        "text": "Porque el presupuesto para la gestión de stakeholders puede cambiar a mitad del proyecto.",
        "isCorrect": false,
        "rationale": "Los cambios de presupuesto afectan a muchas áreas, pero la razón de la revisión continua de los stakeholders es más fundamental para su propia gestión."
      },
      {
        "text": "Porque la lista inicial suele ser incorrecta y necesita una validación formal en la fase de ejecución.",
        "isCorrect": false,
        "rationale": "La lista inicial no es necesariamente incorrecta, sino que el entorno del proyecto es dinámico y evoluciona."
      },
      {
        "text": "Porque el Project Manager puede cambiar y el nuevo necesita rehacer el análisis desde cero.",
        "isCorrect": false,
        "rationale": "Aunque un cambio de PM puede motivar una revisión, la naturaleza continua del proceso es inherente al proyecto, independientemente de quién lo dirija."
      },
      {
        "text": "Porque los implicados pueden cambiar, o su poder, interés y actitud pueden variar a lo largo del ciclo de vida del proyecto.",
        "isCorrect": true,
        "rationale": "Un aliado puede volverse neutral, un nuevo directivo puede aparecer, o un grupo antes desinteresado puede ganar influencia. El análisis debe reflejar siempre la realidad actual del proyecto."
      }
    ],
    "hint": "Considera que un proyecto es un entorno dinámico donde las personas y sus roles pueden evolucionar."
  },
  {
    "guid": "6d2fd67d-49a9-459b-a377-f75769ef3353",
    "subjectId": "T10",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "Un director de proyecto está utilizando una herramienta para clasificar a los stakeholders basada en su nivel de autoridad (poder), su nivel de preocupación por el proyecto (interés) y su capacidad para influir en los resultados. ¿Qué herramienta de análisis está utilizando?",
    "answerOptions": [
      {
        "text": "Un análisis de causa raíz.",
        "isCorrect": false,
        "rationale": "Este tipo de análisis se utiliza para identificar el origen de un problema, no para clasificar a las personas involucradas en un proyecto."
      },
      {
        "text": "Una matriz de implicación actual vs. deseada.",
        "isCorrect": false,
        "rationale": "Esta matriz compara los niveles de compromiso (resistente, neutral, etc.), pero no se basa principalmente en los ejes de poder o interés."
      },
      {
        "text": "Un análisis de stakeholders, como la matriz de poder/interés o un modelo tridimensional.",
        "isCorrect": true,
        "rationale": "Estos modelos (como la matriz poder/interés, influencia/impacto o el cubo de stakeholders) están diseñados específicamente para clasificar a los implicados según estas dimensiones."
      },
      {
        "text": "Un diagrama de Gantt.",
        "isCorrect": false,
        "rationale": "El diagrama de Gantt es una herramienta para planificar y seguir el cronograma de las tareas del proyecto, no para analizar a las personas."
      }
    ],
    "hint": "El nombre de la técnica a menudo refleja las variables que se utilizan para la clasificación."
  },

  
  {
    "guid": "9a7893c9-6e0d-48f5-b0cf-52217abe1921",
    "subjectId": "T10",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "Durante la fase de ejecución de un proyecto, el director del proyecto se dedica a resolver un conflicto entre dos stakeholders clave y a asegurarse de que sus expectativas se mantengan alineadas con los objetivos. ¿En qué proceso de la Gestión de Implicados se encuentra?",
    "answerOptions": [
      {
        "text": "Identificar a los Interesados",
        "isCorrect": false,
        "rationale": "Este proceso se realiza en la fase de iniciación para determinar quiénes son los stakeholders, no para gestionar activamente sus relaciones durante la ejecución."
      },
      {
        "text": "Planificar la Participación de los Interesados",
        "isCorrect": false,
        "rationale": "La planificación define las estrategias a seguir, pero la acción de resolver conflictos y gestionar expectativas en tiempo real corresponde a una fase posterior."
      },
      {
        "text": "Gestionar la Participación de los Interesados",
        "isCorrect": true,
        "rationale": "Este proceso se centra en la comunicación activa, la negociación y la resolución de conflictos para fomentar el compromiso durante la ejecución del proyecto."
      },
      {
        "text": "Monitorear la Participación de los Interesados",
        "isCorrect": false,
        "rationale": "Monitorear implica hacer seguimiento y evaluar la efectividad de las estrategias, mientras que la acción descrita es la ejecución de dichas estrategias."
      }
    ],
    "hint": "Piensa en la diferencia entre planificar una acción, ejecutarla y supervisar sus resultados."
  },
  {
    "guid": "7f6b0378-0e3f-4f29-a933-154a962bd5f7",
    "subjectId": "T10",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "Un stakeholder ha sido clasificado en la matriz de poder/interés con un alto poder de influencia pero con un bajo interés en el día a día del proyecto. ¿Cuál es la estrategia de gestión recomendada por el PMBOK?",
    "answerOptions": [
      {
        "text": "Gestionar activamente",
        "isCorrect": false,
        "rationale": "Esta estrategia se reserva para aquellos con alto poder y alto interés, que requieren una implicación constante y personalizada."
      },
      {
        "text": "Mantener informado",
        "isCorrect": false,
        "rationale": "Esta táctica es adecuada para stakeholders con alto interés pero bajo poder, que necesitan estar al tanto pero no tienen gran influencia."
      },
      {
        "text": "Monitorear mínimamente",
        "isCorrect": false,
        "rationale": "Se aplica a stakeholders con bajo poder y bajo interés, ya que su impacto en el proyecto es mínimo."
      },
      {
        "text": "Mantener satisfecho",
        "isCorrect": true,
        "rationale": "El objetivo con este perfil es asegurar que sus necesidades y requerimientos sean atendidos para evitar que su alto poder se convierta en un obstáculo, sin abrumarlos con información innecesaria."
      }
    ],
    "hint": "Considera cómo tratarías a alguien influyente que no quiere involucrarse en los detalles, pero cuya opinión es crucial."
  },
  {
    "guid": "86684514-87db-498a-bbe6-cb1d0b77a3a8",
    "subjectId": "T10",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "El Acta de Constitución del Proyecto (Project Charter) es un documento fundamental al inicio de un proyecto. ¿Cuál es su rol principal en el proceso 'Identificar a los Interesados'?",
    "answerOptions": [
      {
        "text": "Define las estrategias de comunicación detalladas para cada stakeholder.",
        "isCorrect": false,
        "rationale": "Las estrategias detalladas se desarrollan más tarde, en el Plan de Gestión de la Participación, no en el acta inicial."
      },
      {
        "text": "Sirve como entrada clave para identificar a los primeros stakeholders de alto nivel.",
        "isCorrect": true,
        "rationale": "Este documento nombra al patrocinador, al director del proyecto y a otras figuras clave, siendo el punto de partida para el registro de implicados."
      },
      {
        "text": "Es el resultado final que documenta a todos los stakeholders identificados y su clasificación.",
        "isCorrect": false,
        "rationale": "El resultado de este proceso es el Registro de Interesados (Stakeholder Register), no el Acta de Constitución."
      },
      {
        "text": "Contiene la matriz de implicación actual vs. deseada de los stakeholders.",
        "isCorrect": false,
        "rationale": "La matriz de implicación es una herramienta utilizada en el proceso de planificación, no un contenido del Acta de Constitución."
      }
    ],
    "hint": "Piensa en qué información contiene el primer documento oficial de un proyecto."
  },
  {
    "guid": "99984a37-54dc-40eb-a309-29019afd1162",
    "subjectId": "T10",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "La principal diferencia entre el 'Registro de Implicados' (Stakeholder Register) y el 'Plan de Gestión de la Participación' (Stakeholder Engagement Plan) es que:",
    "answerOptions": [
      {
        "text": "El registro es un documento estático, mientras que el plan es dinámico y se actualiza constantemente.",
        "isCorrect": false,
        "rationale": "Ambos documentos son dinámicos y deben actualizarse a lo largo del ciclo de vida del proyecto a medida que cambian las circunstancias."
      },
      {
        "text": "El registro identifica 'quiénes son' los implicados y sus características, mientras que el plan define 'cómo' se gestionará su participación.",
        "isCorrect": true,
        "rationale": "El registro es un listado descriptivo y analítico (poder, interés, actitud), y el plan es un conjunto de estrategias y acciones para interactuar con ellos."
      },
      {
        "text": "El registro lo elabora el patrocinador, y el plan es responsabilidad exclusiva del director del proyecto.",
        "isCorrect": false,
        "rationale": "Ambos documentos son responsabilidad del director del proyecto, aunque se elaboren con la ayuda del equipo y otros implicados."
      },
      {
        "text": "El registro se enfoca solo en stakeholders externos, mientras que el plan incluye a los internos y externos.",
        "isCorrect": false,
        "rationale": "El registro de implicados debe incluir a todas las partes interesadas, tanto internas como externas, sin excepción."
      }
    ],
    "hint": "Uno de los documentos es una lista descriptiva y el otro es una guía de acción."
  },
  {
    "guid": "575fd81d-67bf-4331-9974-bc128a91cff2",
    "subjectId": "T10",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "¿Cuál de las siguientes acciones corresponde inequívocamente al proceso de 'Monitorear la Participación de los Interesados'?",
    "answerOptions": [
      {
        "text": "Realizar un brainstorming para listar todos los posibles grupos afectados por el proyecto.",
        "isCorrect": false,
        "rationale": "Esta actividad es una herramienta típica del proceso de 'Identificar a los Interesados' al inicio del proyecto."
      },
      {
        "text": "Diseñar una estrategia de comunicación específica para un proveedor con actitud negativa.",
        "isCorrect": false,
        "rationale": "El diseño de estrategias se realiza durante el proceso de 'Planificar la Participación de los Interesados'."
      },
      {
        "text": "Enviar el informe de avance semanal a la dirección, tal como se había acordado.",
        "isCorrect": false,
        "rationale": "Ejecutar el plan de comunicación es parte de 'Gestionar la Participación de los Interesados'."
      },
      {
        "text": "Analizar los resultados de una encuesta de satisfacción para ver si la implicación de los usuarios ha mejorado.",
        "isCorrect": true,
        "rationale": "Este proceso se centra en supervisar las relaciones, medir la efectividad de las estrategias y realizar ajustes, lo cual incluye el análisis de feedback."
      }
    ],
    "hint": "Este proceso no se trata de actuar, sino de evaluar y ajustar el rumbo de las acciones."
  },
  {
    "guid": "27c478c4-b391-4bd6-94aa-63eb1ff51967",
    "subjectId": "T10",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "Según el PMBOK, un stakeholder es cualquier individuo, grupo u organización que puede afectar, ser afectado o...?",
    "answerOptions": [
      {
        "text": "financiar una decisión, actividad o resultado del proyecto.",
        "isCorrect": false,
        "rationale": "La financiación es una forma de verse afectado o afectar, pero la definición completa incluye un elemento más subjetivo."
      },
      {
        "text": "percibirse a sí mismo como afectado por una decisión, actividad o resultado del proyecto.",
        "isCorrect": true,
        "rationale": "La definición del PMBOK incluye explícitamente la percepción, reconociendo que la creencia de ser afectado es suficiente para considerar a alguien un stakeholder."
      },
      {
        "text": "tener un contrato formal relacionado con el proyecto.",
        "isCorrect": false,
        "rationale": "Tener un contrato convierte a alguien en stakeholder, pero no es un requisito indispensable; por ejemplo, la ciudadanía no tiene un contrato."
      },
      {
        "text": "aprobar formalmente los entregables del proyecto.",
        "isCorrect": false,
        "rationale": "La aprobación de entregables es una función de ciertos stakeholders (como el cliente o el patrocinador), pero no es parte de la definición general."
      }
    ],
    "hint": "La definición completa abarca no solo el impacto real, sino también la percepción que se tiene sobre ese impacto."
  },
  {
    "guid": "2bb02cf2-4b0b-4e95-b635-2fed2c3c4756",
    "subjectId": "T10",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "Un director de proyecto nota que la resistencia de un grupo de usuarios ha aumentado. Después de analizar la situación, decide cambiar la estrategia de 'mantenerlos informados' a 'involucrarlos en talleres de diseño'. ¿En qué documento clave se debería registrar formalmente este cambio de estrategia?",
    "answerOptions": [
      {
        "text": "En el Acta de Constitución del Proyecto (Project Charter).",
        "isCorrect": false,
        "rationale": "El Acta de Constitución es un documento de alto nivel que se crea al inicio y no se modifica para reflejar cambios operativos en las estrategias de gestión."
      },
      {
        "text": "En el Plan de Gestión de las Comunicaciones.",
        "isCorrect": false,
        "rationale": "Aunque está relacionado, este plan detalla los canales y la frecuencia de la información. El cambio de estrategia en sí pertenece a un documento más específico sobre la implicación."
      },
      {
        "text": "En el Plan de Gestión de la Participación de los Interesados (Stakeholder Engagement Plan).",
        "isCorrect": true,
        "rationale": "Este documento es el lugar centralizado donde se definen y actualizan las estrategias específicas para gestionar el compromiso de cada stakeholder o grupo."
      },
      {
        "text": "En el Registro de Incidentes (Issue Log).",
        "isCorrect": false,
        "rationale": "El registro de incidentes documenta el problema (la resistencia), pero el cambio de estrategia a largo plazo se actualiza en el plan correspondiente."
      }
    ],
    "hint": "Busca el documento que sirve como hoja de ruta para las interacciones con los implicados."
  },
  {
    "guid": "d420fd5f-b8f7-43e2-ac29-363fd4d818f1",
    "subjectId": "T10",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "Uno de los errores más comunes en la gestión de implicados es confundir 'comunicación' con 'participación' (engagement). ¿Cuál es la distinción fundamental?",
    "answerOptions": [
      {
        "text": "La comunicación es siempre unidireccional, mientras que la participación es bidireccional.",
        "isCorrect": false,
        "rationale": "La comunicación puede ser bidireccional (por ejemplo, una reunión), pero su objetivo principal no es necesariamente el mismo que el de la participación."
      },
      {
        "text": "La comunicación busca transmitir información, mientras que la participación busca crear compromiso y alinear objetivos.",
        "isCorrect": true,
        "rationale": "La comunicación es una herramienta, pero la participación es el objetivo final: conseguir que los stakeholders apoyen activamente el proyecto y se sientan parte de él."
      },
      {
        "text": "La comunicación se gestiona a través del Plan de Comunicaciones y la participación a través del Registro de Implicados.",
        "isCorrect": false,
        "rationale": "Ambos conceptos se gestionan principalmente a través del Plan de Gestión de la Participación, que a su vez se alinea con el Plan de Comunicaciones."
      },
      {
        "text": "La comunicación se aplica a stakeholders de bajo poder y la participación a los de alto poder.",
        "isCorrect": false,
        "rationale": "Tanto la comunicación como la participación se aplican a todos los stakeholders, aunque la intensidad y la estrategia varíen según su clasificación."
      }
    ],
    "hint": "Piensa si es lo mismo enviar un correo informativo que organizar un taller colaborativo."
  },
  {
    "guid": "dea473cc-a65b-463a-8c2a-47424b6bd240",
    "subjectId": "T10",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "En la matriz de implicación actual vs. deseada, se identifica que el patrocinador del proyecto tiene un nivel de implicación 'Comprometido' (Supportive), pero el nivel deseado es 'Líder' (Leading). ¿Qué acción sería la más adecuada para gestionar esta brecha?",
    "answerOptions": [
      {
        "text": "Limitar su acceso a la información para que se centre en sus tareas de liderazgo.",
        "isCorrect": false,
        "rationale": "Limitar la información es contraproducente; un líder necesita tener una visión completa para poder defender el proyecto eficazmente."
      },
      {
        "text": "Proporcionarle informes de estado más detallados y frecuentes.",
        "isCorrect": false,
        "rationale": "Esto lo mantendría informado, pero no necesariamente fomentaría un rol de liderazgo activo. Puede ser parte de la solución, pero no es la acción principal."
      },
      {
        "text": "Involucrarlo activamente en la eliminación de obstáculos y la defensa del proyecto ante otros directivos.",
        "isCorrect": true,
        "rationale": "Un rol de 'Líder' implica tomar la iniciativa, defender el proyecto y usar su influencia para asegurar el éxito, y esta acción promueve directamente ese comportamiento."
      },
      {
        "text": "Documentar la brecha en el registro de riesgos y aceptarla, ya que su apoyo actual es suficiente.",
        "isCorrect": false,
        "rationale": "Aceptar la brecha no es una gestión proactiva. Si el nivel deseado es 'Líder', es porque se considera necesario para el éxito del proyecto."
      }
    ],
    "hint": "Considera qué distingue a alguien que simplemente apoya un proyecto de alguien que lo lidera y defiende activamente."
  },
  {
    "guid": "e573e7c0-21f3-41f8-bc41-bacd111b0ae5",
    "subjectId": "T10",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "Según la fuente, la gestión de implicados tiene una estrecha relación con otras áreas de conocimiento del PMBOK. ¿Con qué área está más íntimamente ligada la identificación de un stakeholder negativo que se opone activamente al proyecto?",
    "answerOptions": [
      {
        "text": "Gestión de la Integración",
        "isCorrect": false,
        "rationale": "La gestión de la integración coordina todas las partes del proyecto, pero no se enfoca específicamente en las amenazas que surgen de las actitudes de las personas."
      },
      {
        "text": "Gestión de los Recursos",
        "isCorrect": false,
        "rationale": "Esta área se centra en el equipo del proyecto y los recursos físicos, no en las amenazas provenientes de actores externos o internos que se oponen."
      },
      {
        "text": "Gestión de los Riesgos",
        "isCorrect": true,
        "rationale": "Un stakeholder con una actitud negativa y poder de influencia representa una amenaza directa para los objetivos del proyecto, lo que lo convierte en una fuente de riesgo que debe ser gestionada."
      },
      {
        "text": "Gestión de las Adquisiciones",
        "isCorrect": false,
        "rationale": "Esta área se ocupa de la compra de bienes y servicios a proveedores, lo cual es un ámbito diferente al de la gestión de la oposición al proyecto."
      }
    ],
    "hint": "Piensa en cómo se clasifica una amenaza potencial para el proyecto que proviene de la actitud de una persona o grupo."
  },
  {
    "guid": "8f6d16bd-96e8-48dc-8332-ae4cdfa9e4f8",
    "subjectId": "T10",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "El proceso 'Identificar Implicados' debe realizarse lo antes posible. Sin embargo, ¿por qué es fundamental que sea un proceso continuo y no una actividad única al inicio del proyecto?",
    "answerOptions": [
      {
        "text": "Porque el presupuesto para la gestión de stakeholders puede cambiar a mitad del proyecto.",
        "isCorrect": false,
        "rationale": "Los cambios de presupuesto afectan a muchas áreas, pero la razón de la revisión continua de los stakeholders es más fundamental para su propia gestión."
      },
      {
        "text": "Porque la lista inicial suele ser incorrecta y necesita una validación formal en la fase de ejecución.",
        "isCorrect": false,
        "rationale": "La lista inicial no es necesariamente incorrecta, sino que el entorno del proyecto es dinámico y evoluciona."
      },
      {
        "text": "Porque el Project Manager puede cambiar y el nuevo necesita rehacer el análisis desde cero.",
        "isCorrect": false,
        "rationale": "Aunque un cambio de PM puede motivar una revisión, la naturaleza continua del proceso es inherente al proyecto, independientemente de quién lo dirija."
      },
      {
        "text": "Porque los implicados pueden cambiar, o su poder, interés y actitud pueden variar a lo largo del ciclo de vida del proyecto.",
        "isCorrect": true,
        "rationale": "Un aliado puede volverse neutral, un nuevo directivo puede aparecer, o un grupo antes desinteresado puede ganar influencia. El análisis debe reflejar siempre la realidad actual del proyecto."
      }
    ],
    "hint": "Considera que un proyecto es un entorno dinámico donde las personas y sus roles pueden evolucionar."
  },
  {
    "guid": "a0d611a1-c16d-4339-8263-a753a9cc188a",
    "subjectId": "T10",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "Un director de proyecto está utilizando una herramienta para clasificar a los stakeholders basada en su nivel de autoridad (poder), su nivel de preocupación por el proyecto (interés) y su capacidad para influir en los resultados. ¿Qué herramienta de análisis está utilizando?",
    "answerOptions": [
      {
        "text": "Un análisis de causa raíz.",
        "isCorrect": false,
        "rationale": "Este tipo de análisis se utiliza para identificar el origen de un problema, no para clasificar a las personas involucradas en un proyecto."
      },
      {
        "text": "Una matriz de implicación actual vs. deseada.",
        "isCorrect": false,
        "rationale": "Esta matriz compara los niveles de compromiso (resistente, neutral, etc.), pero no se basa principalmente en los ejes de poder o interés."
      },
      {
        "text": "Un análisis de stakeholders, como la matriz de poder/interés o un modelo tridimensional.",
        "isCorrect": true,
        "rationale": "Estos modelos (como la matriz poder/interés, influencia/impacto o el cubo de stakeholders) están diseñados específicamente para clasificar a los implicados según estas dimensiones."
      },
      {
        "text": "Un diagrama de Gantt.",
        "isCorrect": false,
        "rationale": "El diagrama de Gantt es una herramienta para planificar y seguir el cronograma de las tareas del proyecto, no para analizar a las personas."
      }
    ],
    "hint": "El nombre de la técnica a menudo refleja las variables que se utilizan para la clasificación."
  }
]