[
  {
    "guid": "c7b8e4e2-11d9-40f0-a32b-78c3a9b9ac71",
    "subjectId": "T12",
    "difficulty": 2,
    "origin": "OPOS19_preguntes_practic.pdf",
    "type": "oposXX",
    "question": "Per al sistema de manteniment evolutiu del gestor d’expedients de contractació del Lot 1 s’ha decidit que s’aplicarà un mètode àgil de desenvolupament de programari. Des d’una perspectiva SCRUM, les següents definicions: 1. requeriments prioritzats a acomplir de tot el projecte 2. reunió valorativa del funcionament de l’equip de treball i entorn del projecte i millores possibles a aplicar 3. coordinador i supervisor del funcionament i aplicació del mètode. Corresponen ordenadament als següents elements:",
    "answerOptions": [
      {
        "text": "A. 1.Product backlog – 2.Reunió de Sprint – 3.Equip de desenvolupament.",
        "isCorrect": false,
        "rationale": "La reunió de Sprint no és la de revisió del funcionament de l’equip, sinó de producte."
      },
      {
        "text": "B. 1.Product backlog – 2.Reunió de retrospectiva – 3.Scrum master.",
        "isCorrect": true,
        "rationale": "Correcte: el Product Backlog conté requisits prioritzats, la retrospectiva analitza el funcionament i el Scrum Master coordina el mètode."
      },
      {
        "text": "C. 1.Sprint backlog – 2.Reunió diària d’Scrum – 3.Cap de l’Equip de desenvolupament.",
        "isCorrect": false,
        "rationale": "L’sprint backlog són tasques d’un sprint concret, i el cap d’equip no és un rol Scrum."
      },
      {
        "text": "D. 1.Definition of done – 2.Sprint backlog – 3.Product owner.",
        "isCorrect": false,
        "rationale": "El Product Owner no és el supervisor de la metodologia."
      }
    ],
    "hint": "Recorda: el Scrum Master és el responsable de garantir l’aplicació correcta de la metodologia."
  },
  {
    "guid": "8ee72b69-99b0-4dd8-89fd-b4f67625e1aa",
    "subjectId": "T12",
    "difficulty": 1,
    "origin": "OPOS19_preguntes_practic.pdf",
    "type": "oposXX",
    "question": "L’organització TI ha identificat que els requisits del nou producte no són coneguts d’una manera clara i ha recomanat que l’equip de desenvolupament de software treballi seguint la metodologia àgil SCRUM. ... Quines de les següents funcions haurà d’exercir aquesta directora com a “Product Owner”?",
    "answerOptions": [
      {
        "text": "A. Estimar l’esforç de cada tasca de cada sprint.",
        "isCorrect": false,
        "rationale": "L’estimació d’esforç és responsabilitat de l’equip de desenvolupament."
      },
      {
        "text": "B. Proporcionar suport a l’equip de desenvolupament.",
        "isCorrect": false,
        "rationale": "Funció del Scrum Master."
      },
      {
        "text": "C. Mantenir la pila de producte (en anglès “product backlog”).",
        "isCorrect": true,
        "rationale": "El Product Owner gestiona i prioritza el product backlog."
      },
      {
        "text": "D. Proposar i promoure millores sobre el funcionament de l’equip.",
        "isCorrect": false,
        "rationale": "Aquesta funció és pròpia del Scrum Master."
      }
    ],
    "hint": "El Product Owner representa el negoci i prioritza el backlog, no gestiona tasques tècniques."
  },
  {
    "guid": "a43d1eab-dc2f-4db8-bfc5-4a0f0da8b456",
    "subjectId": "T12",
    "difficulty": 1,
    "origin": "OPOS21_preguntes_practic.pdf",
    "type": "oposXX",
    "question": "Les funcionalitats requerides per l’equip tècnic aniran definint-se a mesura que avanci la integració de dades. Es decideix utilitzar una metodologia AGILE. Quins valors són la base de les metodologies àgils?",
    "answerOptions": [
      {
        "text": "A. El procés i les eines per sobre de l’individu i les seves iteracions.",
        "isCorrect": false,
        "rationale": "És justament el contrari del manifest àgil."
      },
      {
        "text": "B. La col·laboració amb el client més que la negociació d’un contracte.",
        "isCorrect": true,
        "rationale": "És un dels quatre valors fonamentals del Manifest Agile."
      },
      {
        "text": "C. Seguir una planificació per sobre de respondre als canvis.",
        "isCorrect": false,
        "rationale": "Agile valora adaptar-se al canvi més que seguir un pla."
      },
      {
        "text": "D. Espaiar el màxim possible les entregues funcionals.",
        "isCorrect": false,
        "rationale": "Les entregues han de ser freqüents i incrementals."
      }
    ],
    "hint": "Recorda els 4 valors del Manifest: persones, software, col·laboració i adaptació."
  },
  {
    "guid": "b50d2c31-69ce-41e4-99ad-01f76f73d5a1",
    "subjectId": "T12",
    "difficulty": 2,
    "origin": "OPOS21_preguntes_practic.pdf",
    "type": "oposXX",
    "question": "D'acord amb el que s’indica en la pregunta anterior, i donat que es vol una metodologia AGILE, s’opta pel mètode SCRUM. Quin d’aquests esdeveniments NO és propi d’SCRUM?",
    "answerOptions": [
      {
        "text": "A. Planificació de l’Sprint.",
        "isCorrect": false,
        "rationale": "És una cerimònia pròpia de Scrum."
      },
      {
        "text": "B. Retrospectiva de l’Sprint.",
        "isCorrect": false,
        "rationale": "També és pròpia de Scrum."
      },
      {
        "text": "C. Scrum diari.",
        "isCorrect": false,
        "rationale": "És la Daily Scrum, part fonamental del marc."
      },
      {
        "text": "D. Seguiment de l’Sprint.",
        "isCorrect": true,
        "rationale": "No és una cerimònia Scrum oficial, és un terme genèric de gestió."
      }
    ],
    "hint": "Scrum només reconeix 4 cerimònies: planning, daily, review i retrospective."
  },
  {
    "guid": "8df5f7a8-3558-4a3a-8f91-3cb76e84d62f",
    "subjectId": "T12",
    "difficulty": 1,
    "origin": "OPOS21_preguntes_especific.pdf",
    "type": "oposXX",
    "question": "Una de les diferències més rellevants entre les metodologies waterfall i les metodologies Agile fa referència als canvis. Quines de les següents afirmacions corresponen a l’enfoc de les metodologies Agile i a l’enfoc de les metodologies waterfall, respectivament?",
    "answerOptions": [
      {
        "text": "A. 1 i 2",
        "isCorrect": false,
        "rationale": "La 2 no és pròpia de l’enfoc Agile."
      },
      {
        "text": "B. 1 i 3",
        "isCorrect": true,
        "rationale": "Correcte: Agile accepta canvis tardans; Waterfall no permet canvis sense revisar tot el pla."
      },
      {
        "text": "C. 2 i 3",
        "isCorrect": false,
        "rationale": "Inclou una afirmació incorrecta sobre els sprints."
      },
      {
        "text": "D. 2 i 4",
        "isCorrect": false,
        "rationale": "Cap de les dues descriu correctament Agile i Waterfall."
      }
    ],
    "hint": "Recorda: Agile acull els canvis, Waterfall els evita."
  },
  {
    "guid": "c597e8c4-f3d8-486c-a9e2-36b68b3e512b",
    "subjectId": "T12",
    "difficulty": 1,
    "origin": "OPOS23_preguntes_practic.pdf",
    "type": "oposXX",
    "question": "Els membres de l’equip que han assistit a la formació d’Scrum estan molt satisfets de la formació rebuda i, entre altres molts conceptes, han aprés que els pilars d’Scrum, basats en l’aprenentatge de l’experiència, són:",
    "answerOptions": [
      {
        "text": "A. Planificació, Control i seguiment.",
        "isCorrect": false,
        "rationale": "Aquests són processos de gestió tradicional, no pilars d’Scrum."
      },
      {
        "text": "B. Transparència, inspecció i adaptació.",
        "isCorrect": true,
        "rationale": "Són els tres pilars fonamentals de Scrum segons la guia oficial."
      },
      {
        "text": "C. Teoria, pràctica i execució.",
        "isCorrect": false,
        "rationale": "No corresponen a cap principi Scrum."
      },
      {
        "text": "D. Planificació, iteració i proves.",
        "isCorrect": false,
        "rationale": "Són activitats, no pilars."
      }
    ],
    "hint": "Scrum es basa en tres pilars: transparència, inspecció i adaptació."
  },
  {
    "guid": "66de4eab-7b48-4768-92a8-c705e9d5f9fa",
    "subjectId": "T12",
    "difficulty": 1,
    "origin": "OPOS23_preguntes_practic.pdf",
    "type": "oposXX",
    "question": "L’equip que s’està formant en el curs de metodologia Scrum ha de canviar l’enfoc que ha fet servir fins ara en el desenvolupament dels projectes ja que l’enfoc d’Scrum es basa en un procés:",
    "answerOptions": [
      {
        "text": "A. Iteratiu i decremental.",
        "isCorrect": false,
        "rationale": "Scrum és iteratiu i incremental, no decremental."
      },
      {
        "text": "B. Iteratiu i incremental.",
        "isCorrect": true,
        "rationale": "És la definició correcta de Scrum: millora contínua i lliuraments successius."
      },
      {
        "text": "C. En cascada (waterfall).",
        "isCorrect": false,
        "rationale": "És el model tradicional, no àgil."
      },
      {
        "text": "D. V-model.",
        "isCorrect": false,
        "rationale": "El V-model és propi del desenvolupament seqüencial amb proves associades."
      }
    ],
    "hint": "Recorda: Scrum combina iteracions (cicles) i increments (productes funcionals)."
  },
  {
    "guid": "cf6cbf3d-6e6c-4ad2-9982-520c12d6b8d0",
    "subjectId": "T12",
    "difficulty": 1,
    "origin": "OPOS23_preguntes_practic.pdf",
    "type": "oposXX",
    "question": "L’equip que s’està formant en el curs de metodologia Scrum està sorprès amb les noves maneres d’actuar ja que canvia el paradigma que tenen totalment assumit fins ara ja que Scrum defineix que els equips han de ser:",
    "answerOptions": [
      {
        "text": "A. Multifuncionals i jeràrquics.",
        "isCorrect": false,
        "rationale": "Scrum elimina jerarquies internes dins l’equip."
      },
      {
        "text": "B. Jeràrquics i especialitzats.",
        "isCorrect": false,
        "rationale": "Just el contrari: l’equip ha de ser flexible i col·laboratiu."
      },
      {
        "text": "C. Multifuncionals i autogestionats.",
        "isCorrect": true,
        "rationale": "Correcte: equips Scrum són autònoms i amb múltiples competències."
      },
      {
        "text": "D. Especialitzats i dirigits.",
        "isCorrect": false,
        "rationale": "Aquesta és una estructura tradicional, no àgil."
      }
    ],
    "hint": "Els equips Scrum no tenen cap jerarquia interna; es gestionen a si mateixos."
  }
]
