[
  {
    "guid": "4d7f7d16-2f98-42b1-9ab2-6fca50b1aa12",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "OPOS19_preguntes_especific.pdf",
    "type": "oposXX",
    "question": "10. A quina categoria de paquets integrats correspon la següent definició: disciplina per millorar un procés de negoci d’extrem a extrem fent l’anàlisi, modelant com funciona en diferents escenaris, monitoritzant-lo i executant millores contínues?",
    "answerOptions": [
      {
        "text": "A. BPM.",
        "isCorrect": true,
        "rationale": "BPM (Business Process Management) és la disciplina orientada a optimitzar i millorar processos de negoci."
      },
      {
        "text": "B. CRM.",
        "isCorrect": false,
        "rationale": "CRM gestiona relacions amb clients, no processos interns de negoci."
      },
      {
        "text": "C. ERP.",
        "isCorrect": false,
        "rationale": "ERP planifica recursos empresarials, no se centra en el modelatge de processos."
      },
      {
        "text": "D. BI.",
        "isCorrect": false,
        "rationale": "BI analitza dades i genera informes, però no modela ni millora processos."
      }
    ],
    "hint": "Recorda que BPM és la sigla de Business Process Management."
  },
  {
    "guid": "beedc493-bc12-4e94-84e0-7e04bfcfcfd9",
    "subjectId": "T14",
    "difficulty": 1,
    "origin": "OPOS21_preguntes_practic.pdf",
    "type": "oposXX",
    "question": "8. També es vol construir un web informatiu amb indicadors i informació important per a la coordinació interna de l’equip. La introducció i manteniment de la informació es farà manualment. Quina eina és l’adequada per a la construcció d’aquest web?",
    "answerOptions": [
      {
        "text": "A. CRM (Costumer Relationship Management).",
        "isCorrect": false,
        "rationale": "CRM s'utilitza per gestionar relacions amb clients, no per crear llocs web informatius."
      },
      {
        "text": "B. ERP (Enterprise Resource Planning).",
        "isCorrect": false,
        "rationale": "ERP planifica recursos empresarials i processos interns, no webs."
      },
      {
        "text": "C. CMS (Content Management System).",
        "isCorrect": true,
        "rationale": "Un CMS és la plataforma adequada per gestionar continguts web."
      },
      {
        "text": "D. PMS (Project Manager Suite).",
        "isCorrect": false,
        "rationale": "Un PMS gestiona projectes, no continguts web."
      }
    ],
    "hint": "Pensa en una eina per gestionar textos i imatges a una web."
  },
  {
    "guid": "9b1f31d1-8db5-49b4-bb94-2ce994a182cc",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "OPOS21_preguntes_especific.pdf",
    "type": "oposXX",
    "question": "11. El departament de projectes de sistemes d’informació d’una administració local utilitza com a eina de modelat dels processos una aplicació basada en l'estàndard BPMN 2.0 Business Process Model and Notation. Per a l’anàlisi funcional de quin tipus de sistemes d’informació es pot fer servir aquesta eina?",
    "answerOptions": [
      {
        "text": "A. Únicament per a sistemes ERP Enterprise Resource Planning.",
        "isCorrect": false,
        "rationale": "ERP gestiona recursos empresarials, però BPMN pot usar-se per més tipus."
      },
      {
        "text": "B. Únicament per a sistemes ERP o CRM Customer Relationship Management.",
        "isCorrect": false,
        "rationale": "BPMN no és exclusiu d’aquests sistemes."
      },
      {
        "text": "C. Únicament per a sistemes BPM Business Process Management.",
        "isCorrect": false,
        "rationale": "Tot i que BPM és l’àmbit natural, BPMN també modela altres processos."
      },
      {
        "text": "D. Per a qualsevol sistema d’informació basat en procediment definits.",
        "isCorrect": true,
        "rationale": "BPMN és un estàndard de modelatge aplicable a qualsevol sistema amb fluxos definits."
      }
    ],
    "hint": "BPMN és un llenguatge de modelatge de processos genèric."
  },
  {
    "guid": "1a7f2d5c-934b-4f17-b0d3-babdb7a52434",
    "subjectId": "T14",
    "difficulty": 1,
    "origin": "OPOS23_preguntes_especific.pdf",
    "type": "oposXX",
    "question": "11. Si tenim l’encàrrec d’una solució per automatitzar el màrqueting i la força de venda, així com gestionar el servei al client i el help desk, quin sistema necessitem?",
    "answerOptions": [
      {
        "text": "A. ERP (Enterprise Resource Planning)",
        "isCorrect": false,
        "rationale": "ERP gestiona recursos interns, no les relacions amb clients."
      },
      {
        "text": "B. BI (Business Intelligence)",
        "isCorrect": false,
        "rationale": "BI s’utilitza per analitzar dades, no per gestionar clients."
      },
      {
        "text": "C. BPM (Business Process Management)",
        "isCorrect": false,
        "rationale": "BPM optimitza processos, però no automatitza vendes ni servei al client."
      },
      {
        "text": "D. CRM (Customer Relationship Management)",
        "isCorrect": true,
        "rationale": "CRM integra màrqueting, vendes i servei al client."
      }
    ],
    "hint": "Pensa en un sistema centrat en el client i la seva experiència."
  }
]
