[
  {
    "guid": "4d7f7d16-2f98-42b1-9ab2-6fca50b1aa12",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "OPOS19_preguntes_especific.pdf",
    "type": "oposXX",
    "question": "10. A quina categoria de paquets integrats correspon la següent definició: disciplina per millorar un procés de negoci d’extrem a extrem fent l’anàlisi, modelant com funciona en diferents escenaris, monitoritzant-lo i executant millores contínues?",
    "answerOptions": [
      {
        "text": "A. BPM.",
        "isCorrect": true,
        "rationale": "BPM (Business Process Management) és la disciplina orientada a optimitzar i millorar processos de negoci."
      },
      {
        "text": "B. CRM.",
        "isCorrect": false,
        "rationale": "CRM gestiona relacions amb clients, no processos interns de negoci."
      },
      {
        "text": "C. ERP.",
        "isCorrect": false,
        "rationale": "ERP planifica recursos empresarials, no se centra en el modelatge de processos."
      },
      {
        "text": "D. BI.",
        "isCorrect": false,
        "rationale": "BI analitza dades i genera informes, però no modela ni millora processos."
      }
    ],
    "hint": "Recorda que BPM és la sigla de Business Process Management."
  },
  {
    "guid": "beedc493-bc12-4e94-84e0-7e04bfcfcfd9",
    "subjectId": "T14",
    "difficulty": 1,
    "origin": "OPOS21_preguntes_practic.pdf",
    "type": "oposXX",
    "question": "8. També es vol construir un web informatiu amb indicadors i informació important per a la coordinació interna de l’equip. La introducció i manteniment de la informació es farà manualment. Quina eina és l’adequada per a la construcció d’aquest web?",
    "answerOptions": [
      {
        "text": "A. CRM (Costumer Relationship Management).",
        "isCorrect": false,
        "rationale": "CRM s'utilitza per gestionar relacions amb clients, no per crear llocs web informatius."
      },
      {
        "text": "B. ERP (Enterprise Resource Planning).",
        "isCorrect": false,
        "rationale": "ERP planifica recursos empresarials i processos interns, no webs."
      },
      {
        "text": "C. CMS (Content Management System).",
        "isCorrect": true,
        "rationale": "Un CMS és la plataforma adequada per gestionar continguts web."
      },
      {
        "text": "D. PMS (Project Manager Suite).",
        "isCorrect": false,
        "rationale": "Un PMS gestiona projectes, no continguts web."
      }
    ],
    "hint": "Pensa en una eina per gestionar textos i imatges a una web."
  },
  {
    "guid": "9b1f31d1-8db5-49b4-bb94-2ce994a182cc",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "OPOS21_preguntes_especific.pdf",
    "type": "oposXX",
    "question": "11. El departament de projectes de sistemes d’informació d’una administració local utilitza com a eina de modelat dels processos una aplicació basada en l'estàndard BPMN 2.0 Business Process Model and Notation. Per a l’anàlisi funcional de quin tipus de sistemes d’informació es pot fer servir aquesta eina?",
    "answerOptions": [
      {
        "text": "A. Únicament per a sistemes ERP Enterprise Resource Planning.",
        "isCorrect": false,
        "rationale": "ERP gestiona recursos empresarials, però BPMN pot usar-se per més tipus."
      },
      {
        "text": "B. Únicament per a sistemes ERP o CRM Customer Relationship Management.",
        "isCorrect": false,
        "rationale": "BPMN no és exclusiu d’aquests sistemes."
      },
      {
        "text": "C. Únicament per a sistemes BPM Business Process Management.",
        "isCorrect": false,
        "rationale": "Tot i que BPM és l’àmbit natural, BPMN també modela altres processos."
      },
      {
        "text": "D. Per a qualsevol sistema d’informació basat en procediment definits.",
        "isCorrect": true,
        "rationale": "BPMN és un estàndard de modelatge aplicable a qualsevol sistema amb fluxos definits."
      }
    ],
    "hint": "BPMN és un llenguatge de modelatge de processos genèric."
  },
  {
    "guid": "1a7f2d5c-934b-4f17-b0d3-babdb7a52434",
    "subjectId": "T14",
    "difficulty": 1,
    "origin": "OPOS23_preguntes_especific.pdf",
    "type": "oposXX",
    "question": "11. Si tenim l’encàrrec d’una solució per automatitzar el màrqueting i la força de venda, així com gestionar el servei al client i el help desk, quin sistema necessitem?",
    "answerOptions": [
      {
        "text": "A. ERP (Enterprise Resource Planning)",
        "isCorrect": false,
        "rationale": "ERP gestiona recursos interns, no les relacions amb clients."
      },
      {
        "text": "B. BI (Business Intelligence)",
        "isCorrect": false,
        "rationale": "BI s’utilitza per analitzar dades, no per gestionar clients."
      },
      {
        "text": "C. BPM (Business Process Management)",
        "isCorrect": false,
        "rationale": "BPM optimitza processos, però no automatitza vendes ni servei al client."
      },
      {
        "text": "D. CRM (Customer Relationship Management)",
        "isCorrect": true,
        "rationale": "CRM integra màrqueting, vendes i servei al client."
      }
    ],
    "hint": "Pensa en un sistema centrat en el client i la seva experiència."
  },



  {
    "guid": "c88bc57e-8539-4dfa-b6d0-825edfd3d9bc",
    "subjectId": "T14",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "Una organització pública vol optimitzar la gestió de les seves finances, l'inventari de material d'oficina i els processos interns de recursos humans. Quin sistema corporatiu seria l'adequat per a aquesta finalitat?",
    "answerOptions": [
      {
        "text": "CRM (Customer Relationship Management)",
        "isCorrect": false,
        "rationale": "Aquest sistema se centra en la gestió de les relacions externes amb ciutadans o clients, no en els processos interns de l'organització."
      },
      {
        "text": "BPM (Business Process Management)",
        "isCorrect": false,
        "rationale": "Aquesta disciplina s'enfoca a modelar i optimitzar processos de negoci, però no és el sistema integrat per gestionar els recursos interns com les finances o l'inventari."
      },
      {
        "text": "ERP (Enterprise Resource Planning)",
        "isCorrect": true,
        "rationale": "Aquest sistema està dissenyat específicament per a la planificació i gestió dels recursos i processos interns d'una organització, com finances, compres o RRHH."
      },
      {
        "text": "BI (Business Intelligence)",
        "isCorrect": false,
        "rationale": "Aquestes eines s'utilitzen per analitzar dades i generar informes per a la presa de decisions, no per a la gestió operativa dels recursos interns."
      }
    ],
    "hint": "Pensa en la diferència entre la gestió de recursos interns i la gestió de relacions externes."
  },
  {
    "guid": "d73ec7b4-2e2b-42a2-995c-31b1e38f56bc",
    "subjectId": "T14",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "Un equip directiu necessita analitzar grans volums de dades de clients per identificar patrons de comportament, segmentar el mercat i predir tendències de compra futures. Quin tipus de CRM és el més indicat per a aquest objectiu?",
    "answerOptions": [
      {
        "text": "CRM Operatiu",
        "isCorrect": false,
        "rationale": "Aquest tipus de CRM s'enfoca a automatitzar els processos del dia a dia com vendes o atenció al client, no en l'anàlisi profunda de dades."
      },
      {
        "text": "CRM Analític",
        "isCorrect": true,
        "rationale": "La seva finalitat principal és precisament analitzar les dades dels clients per obtenir coneixement estratègic, com tendències, segmentació o valor del client (CLV)."
      },
      {
        "text": "CRM Col·laboratiu",
        "isCorrect": false,
        "rationale": "El seu objectiu és facilitar la comunicació i la compartició d'informació entre departaments i canals, més que l'anàlisi de dades per a la presa de decisions estratègiques."
      },
      {
        "text": "CRM Estratègic",
        "isCorrect": false,
        "rationale": "Aquest concepte es refereix a la visió global de posar el client al centre, que engloba els altres tipus, però no és l'eina específica per a l'anàlisi de dades."
      }
    ],
    "hint": "L'objectiu no és automatitzar tasques, sinó extreure coneixement de la informació existent."
  },
  {
    "guid": "65901a72-b003-43af-bb6f-421c6804d99e",
    "subjectId": "T14",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "En el context de la venda de serveis, quin terme descriu millor una oportunitat de negoci que ja ha estat qualificada i es troba en una fase activa del procés de venda dins del CRM?",
    "answerOptions": [
      {
        "text": "Lead",
        "isCorrect": false,
        "rationale": "Un lead és un contacte potencial que encara no ha estat necessàriament qualificat; és una fase anterior en l'embut de vendes."
      },
      {
        "text": "Account",
        "isCorrect": false,
        "rationale": "Aquest terme es refereix a l'empresa o entitat client en la seva totalitat, no a una oportunitat de venda específica."
      },
      {
        "text": "Opportunity",
        "isCorrect": true,
        "rationale": "Aquest terme s'utilitza per definir un lead que ha estat qualificat i amb el qual hi ha una possibilitat real i identificada de tancar una venda."
      },
      {
        "text": "Contacte",
        "isCorrect": false,
        "rationale": "Un contacte és la persona física associada a un compte, però no representa l'oportunitat de negoci en si mateixa."
      }
    ],
    "hint": "Diferencia entre un primer contacte potencial i una negociació ja en curs."
  },
  {
    "guid": "59f52b71-721b-481f-b01a-a38c226f922f",
    "subjectId": "T14",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "Un ajuntament implementa un nou sistema CRM per gestionar les interaccions amb la ciutadania. Quina de les següents afirmacions descriu un compliment normatiu imprescindible per a aquest sistema en l'àmbit públic espanyol?",
    "answerOptions": [
      {
        "text": "Ha de complir exclusivament amb la Llei de Contractes del Sector Públic.",
        "isCorrect": false,
        "rationale": "Tot i que la seva adquisició està subjecta a aquesta llei, el seu funcionament diari pel que fa a les dades està regulat per altres normatives específiques."
      },
      {
        "text": "Només ha de garantir el compliment del RGPD, ja que gestiona dades personals.",
        "isCorrect": false,
        "rationale": "El RGPD és fonamental, però en el context de l'administració pública espanyola, hi ha un altre marc normatiu clau relacionat amb la seguretat dels sistemes."
      },
      {
        "text": "Ha d'estar certificat sota la norma ISO 27001, sent aquesta l'única obligació de seguretat.",
        "isCorrect": false,
        "rationale": "La certificació ISO 27001 és una bona pràctica de seguretat, però no és el marc legal obligatori per als sistemes de les administracions públiques a Espanya."
      },
      {
        "text": "Ha de respectar tant el RGPD com les mesures de l'Esquema Nacional de Seguretat (ENS).",
        "isCorrect": true,
        "rationale": "El RGPD regula la protecció de dades personals, mentre que l'ENS estableix el marc obligatori de mesures de seguretat per als sistemes d'informació del sector públic."
      }
    ],
    "hint": "Pensa en les dues grans àrees que ha de cobrir un sistema públic: la privacitat de les dades personals i la seguretat general de la informació."
  },
  {
    "guid": "6c9910f1-5523-482d-b1be-cd0e2008b419",
    "subjectId": "T14",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "Una empresa decideix adoptar un CRM en modalitat SaaS (Software as a Service). Quin dels següents és un risc o desavantatge inherent a aquest model?",
    "answerOptions": [
      {
        "text": "La necessitat de gestionar i mantenir una infraestructura de servidors pròpia.",
        "isCorrect": false,
        "rationale": "Això és característic dels sistemes 'on-premises', no del model SaaS, on la infraestructura la gestiona el proveïdor."
      },
      {
        "text": "L'elevat cost inicial d'adquisició de llicències perpètues.",
        "isCorrect": false,
        "rationale": "El model SaaS es basa en pagaments per subscripció, evitant els alts costos inicials de les llicències perpètues."
      },
      {
        "text": "La dependència del proveïdor i la possible manca de control sobre la sobirania de les dades.",
        "isCorrect": true,
        "rationale": "En un model cloud, l'organització depèn de la continuïtat del proveïdor i ha d'assegurar on s'emmagatzemen les dades per complir amb la normativa."
      },
      {
        "text": "La responsabilitat d'instal·lar manualment totes les actualitzacions del programari.",
        "isCorrect": false,
        "rationale": "Un dels avantatges del model SaaS és que les actualitzacions són automàtiques i gestionades pel proveïdor."
      }
    ],
    "hint": "Considera on resideix la informació i qui en té el control tècnic en un model de servei al núvol."
  },
  {
    "guid": "259469ce-2daa-4db0-a016-a919e721e2f2",
    "subjectId": "T14",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "L'estratègia d'una empresa busca assegurar que un client que contacta per telèfon, després envia un correu electrònic i finalment utilitza el xat del web, sigui atès amb tot el context de les seves interaccions prèvies, independentment del canal. Com s'anomena aquest concepte?",
    "answerOptions": [
      {
        "text": "SFA (Sales Force Automation)",
        "isCorrect": false,
        "rationale": "Això es refereix a l'automatització de tasques específiques de l'equip de vendes, no a la integració de canals de comunicació."
      },
      {
        "text": "CEM (Customer Experience Management)",
        "isCorrect": false,
        "rationale": "Aquest és un concepte més ampli que gestiona tota l'experiència del client, del qual la integració de canals n'és una part, però no el terme específic."
      },
      {
        "text": "Omnicanalitat",
        "isCorrect": true,
        "rationale": "Aquest terme defineix precisament la unificació i integració de tots els canals de comunicació per oferir una experiència de client coherent i sense fractures."
      },
      {
        "text": "Workflow Automation",
        "isCorrect": false,
        "rationale": "Això fa referència a l'automatització de fluxos de treball o processos, que pot donar suport a l'omnicanalitat, però no és el concepte en si."
      }
    ],
    "hint": "Busca el terme que descriu la integració de múltiples vies de comunicació en una única experiència d'usuari."
  },
  {
    "guid": "290fee51-2a90-41e2-a602-ba3e5739a649",
    "subjectId": "T14",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "Per què es considera que un CRM i un ERP són sistemes complementaris i no substitutius?",
    "answerOptions": [
      {
        "text": "Perquè el CRM gestiona processos interns i l'ERP les dades de clients.",
        "isCorrect": false,
        "rationale": "Aquesta afirmació inverteix els rols; és l'ERP qui gestiona els processos interns i el CRM les relacions externes."
      },
      {
        "text": "Perquè l'ERP és una versió més avançada i completa del CRM.",
        "isCorrect": false,
        "rationale": "No són versions l'un de l'altre; tenen finalitats diferents i cobreixen àmbits de gestió diferents dins d'una organització."
      },
      {
        "text": "Perquè tots dos són eines de BI per a l'anàlisi de dades.",
        "isCorrect": false,
        "rationale": "Tots dos generen dades que poden ser analitzades per eines de BI, però la seva funció principal no és l'anàlisi, sinó la gestió operativa."
      },
      {
        "text": "Perquè el CRM gestiona la relació amb el client (front-office) i l'ERP els processos de suport (back-office).",
        "isCorrect": true,
        "rationale": "Aquesta és la distinció clau: el CRM s'enfoca a l'exterior (clients) i l'ERP a l'interior (recursos, finances), i la seva integració connecta ambdós mons."
      }
    ],
    "hint": "Pensa en la principal àrea d'influència de cada sistema: un mira cap a fora (client) i l'altre cap a dins (empresa)."
  },
  {
    "guid": "7d0e8c0a-5804-404c-9e44-efb8e6f0b66a",
    "subjectId": "T14",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "Quina mètrica o KPI (Key Performance Indicator) mesura el valor econòmic total que un client representa per a l'empresa durant tota la seva relació comercial?",
    "answerOptions": [
      {
        "text": "Churn Rate",
        "isCorrect": false,
        "rationale": "Aquesta mètrica indica el percentatge de clients que l'empresa perd en un període determinat, no el valor que aporten."
      },
      {
        "text": "CSAT (Customer Satisfaction Score)",
        "isCorrect": false,
        "rationale": "Aquest indicador mesura el nivell de satisfacció del client en un moment concret, no el seu valor econòmic a llarg termini."
      },
      {
        "text": "ROI (Return on Investment)",
        "isCorrect": false,
        "rationale": "El ROI mesura el retorn d'una inversió específica, com una campanya de màrqueting, no el valor global d'un client."
      },
      {
        "text": "CLV (Customer Lifetime Value)",
        "isCorrect": true,
        "rationale": "Aquest indicador calcula el benefici net projectat que un client generarà durant tota la seva vida com a client de l'empresa."
      }
    ],
    "hint": "El concepte clau és el valor projectat durant tota la 'vida' de la relació amb el client."
  },
  {
    "guid": "91a7e16f-d4f1-44cb-8c50-101f2291b8ad",
    "subjectId": "T14",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "Quan es diu que un CRM proporciona una 'visió 360º' del ciutadà, a què es fa referència?",
    "answerOptions": [
      {
        "text": "A la capacitat del sistema per analitzar dades de xarxes socials.",
        "isCorrect": false,
        "rationale": "L'anàlisi de xarxes socials pot ser una part, però el concepte de 'visió 360º' és molt més ampli i integrador."
      },
      {
        "text": "A tenir un accés centralitzat i unificat a tot l'historial d'interaccions del ciutadà.",
        "isCorrect": true,
        "rationale": "Aquesta definició captura l'essència de la visió 360º: consolidar totes les dades i interaccions (peticions, queixes, tràmits) en un únic perfil."
      },
      {
        "text": "A l'automatització completa de tots els processos d'atenció ciutadana mitjançant IA.",
        "isCorrect": false,
        "rationale": "L'automatització és una funcionalitat, però la 'visió 360º' es refereix a la completesa de la informació, no a com es gestiona."
      },
      {
        "text": "A la integració exclusiva del CRM amb el portal de transparència de l'administració.",
        "isCorrect": false,
        "rationale": "La integració amb altres sistemes és important, però la 'visió 360º' es refereix a la perspectiva completa sobre el ciutadà, no sobre la integració amb un únic sistema."
      }
    ],
    "hint": "Imagina que vols consultar tota la història d'un ciutadà amb l'administració en un sol lloc."
  },
  {
    "guid": "b11a38ba-7f3b-44c3-a93f-da3e6808ff85",
    "subjectId": "T14",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "En un examen es presenta la següent definició: 'Disciplina per millorar un procés de negoci d'extrem a extrem mitjançant l'anàlisi, el modelatge, la monitorització i l'execució de millores contínues'. A quin concepte correspon?",
    "answerOptions": [
      {
        "text": "CRM (Customer Relationship Management)",
        "isCorrect": false,
        "rationale": "El CRM se centra en la gestió de la relació amb el client, no en l'optimització genèrica de processos de negoci."
      },
      {
        "text": "ERP (Enterprise Resource Planning)",
        "isCorrect": false,
        "rationale": "L'ERP gestiona recursos interns, però la definició descriu una metodologia d'optimització de fluxos de treball, no un sistema de gestió de recursos."
      },
      {
        "text": "BI (Business Intelligence)",
        "isCorrect": false,
        "rationale": "BI s'enfoca en l'anàlisi de dades per a la presa de decisions, no en el modelatge i la millora activa dels processos."
      },
      {
        "text": "BPM (Business Process Management)",
        "isCorrect": true,
        "rationale": "Aquesta definició descriu exactament el cicle de vida de la Gestió de Processos de Negoci: analitzar, modelar, executar i millorar processos."
      }
    ],
    "hint": "La clau de la definició està en la 'millora de processos de negoci', no en els clients ni en els recursos."
  },


  {
    "guid": "f4078531-0409-4891-b8db-2190c28d6305",
    "subjectId": "T14",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Una organización desea analizar los datos históricos de las interacciones de sus clientes para identificar patrones de comportamiento y predecir futuras tendencias de compra. ¿Qué tipo de CRM es el más adecuado para este objetivo?",
    "answerOptions": [
      {
        "text": "CRM Operativo",
        "isCorrect": false,
        "rationale": "Este tipo de CRM se centra en la automatización de los procesos diarios de ventas, marketing y servicio, pero no en el análisis profundo de los datos."
      },
      {
        "text": "CRM Colaborativo",
        "isCorrect": false,
        "rationale": "Su finalidad principal es facilitar la comunicación entre los distintos departamentos que interactúan con el cliente, no el análisis de datos para la toma de decisiones."
      },
      {
        "text": "CRM Analítico",
        "isCorrect": true,
        "rationale": "Este CRM está diseñado específicamente para analizar los datos de los clientes, permitiendo la segmentación, el cálculo del valor del cliente y la predicción de tendencias."
      },
      {
        "text": "CRM Estratégico",
        "isCorrect": false,
        "rationale": "Este concepto se refiere a la visión global de la empresa de poner al cliente en el centro, siendo una filosofía que engloba a los otros tipos, pero no es la herramienta específica para el análisis."
      }
    ],
    "hint": "Piensa en qué tipo de CRM se enfoca en la explotación de la información y la inteligencia de negocio, más que en la gestión de las tareas del día a día."
  },
  {
    "guid": "13edac2e-ad25-464f-b742-51db9286b865",
    "subjectId": "T14",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "En el contexto de la administración pública española, ¿qué marco normativo de seguridad, además del RGPD, es fundamental para la implantación de un CRM que gestiona datos de ciudadanos?",
    "answerOptions": [
      {
        "text": "La Ley de Contratos del Sector Público",
        "isCorrect": false,
        "rationale": "Aunque relevante para la adquisición del software, esta ley regula la contratación pública, no las medidas técnicas y organizativas de seguridad de la información."
      },
      {
        "text": "El Esquema Nacional de Seguridad (ENS)",
        "isCorrect": true,
        "rationale": "El ENS establece la política de seguridad en la utilización de medios electrónicos y es de obligado cumplimiento para los sistemas de las administraciones públicas."
      },
      {
        "text": "La Ley de Propiedad Intelectual",
        "isCorrect": false,
        "rationale": "Esta ley protege los derechos de autor del software, pero no dicta las normas de seguridad para la protección de los datos que este gestiona."
      },
      {
        "text": "El Esquema Nacional de Interoperabilidad (ENI)",
        "isCorrect": false,
        "rationale": "El ENI se centra en las condiciones para el intercambio de información entre administraciones, complementando al ENS pero sin ser el marco principal de seguridad."
      }
    ],
    "hint": "Busca la normativa española específica que regula las medidas de seguridad para los sistemas de información en el sector público."
  },
  {
    "guid": "de495af5-109f-4014-8c3c-fc8589c1fd28",
    "subjectId": "T14",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "¿Cuál es la principal diferencia funcional entre un sistema CRM y un sistema ERP?",
    "answerOptions": [
      {
        "text": "El CRM gestiona los procesos internos de finanzas y recursos humanos, mientras que el ERP gestiona la base de datos de clientes.",
        "isCorrect": false,
        "rationale": "Esta opción invierte los roles; el ERP se encarga de los procesos internos y el CRM de la relación con el exterior."
      },
      {
        "text": "El CRM se enfoca en la relación externa con clientes y ciudadanos, y el ERP en la gestión de recursos y procesos internos de la organización.",
        "isCorrect": true,
        "rationale": "Define correctamente la distinción fundamental: CRM mira hacia afuera (clientes) y ERP mira hacia adentro (recursos de la empresa)."
      },
      {
        "text": "Ambos sistemas tienen el mismo objetivo, pero el CRM es siempre una solución en la nube (SaaS) y el ERP es siempre local (on-premises).",
        "isCorrect": false,
        "rationale": "La modalidad de despliegue (Cloud u on-premises) no es el factor diferenciador principal, ya que ambos tipos de sistema pueden encontrarse en ambas modalidades."
      },
      {
        "text": "El CRM es una herramienta exclusiva para el departamento de marketing, mientras que el ERP es utilizado por toda la organización.",
        "isCorrect": false,
        "rationale": "El CRM no es exclusivo de marketing; también es fundamental para ventas y atención al cliente, buscando una visión 360º."
      }
    ],
    "hint": "Considera el foco principal de cada sistema: uno se centra en las interacciones hacia el exterior y el otro en la optimización de los recursos internos."
  },
  {
    "guid": "5e4f5f35-72b3-4eb9-89d1-4d230a9a2a77",
    "subjectId": "T14",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Una empresa utiliza su CRM para identificar clientes que han comprado un producto A y ofrecerles automáticamente un producto complementario B. ¿Cómo se denomina esta práctica?",
    "answerOptions": [
      {
        "text": "Up-selling",
        "isCorrect": false,
        "rationale": "El up-selling consiste en animar al cliente a comprar una versión más cara o mejorada del mismo producto, no uno complementario."
      },
      {
        "text": "Lead Scoring",
        "isCorrect": false,
        "rationale": "El Lead Scoring es el proceso de puntuar a los clientes potenciales para determinar su nivel de interés, no una técnica de venta directa."
      },
      {
        "text": "Cross-selling",
        "isCorrect": true,
        "rationale": "Esta práctica, conocida como venta cruzada, consiste en vender productos o servicios adicionales y complementarios a un cliente existente."
      },
      {
        "text": "Customer Lifetime Value (CLV)",
        "isCorrect": false,
        "rationale": "El CLV es una métrica que predice el beneficio neto atribuido a toda la relación futura con un cliente, no una técnica de venta."
      }
    ],
    "hint": "Esta técnica de venta se basa en ofrecer productos relacionados, no en mejorar el producto que ya se está comprando."
  },
  {
    "guid": "e785c474-2c57-44f6-ac90-d8df0dbce3a7",
    "subjectId": "T14",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Según el material, ¿qué representa uno de los mayores desafíos durante la implantación de un sistema CRM, más allá de los costes económicos?",
    "answerOptions": [
      {
        "text": "La falta de proveedores de software en el mercado.",
        "isCorrect": false,
        "rationale": "El mercado ofrece una amplia variedad de proveedores de CRM (Salesforce, Microsoft, SAP, etc.), por lo que la escasez no es un problema."
      },
      {
        "text": "La gestión del cambio y la adopción por parte de los usuarios internos.",
        "isCorrect": true,
        "rationale": "La resistencia al cambio y la falta de uso por parte de los empleados son barreras críticas para el éxito de un CRM, ya que el sistema depende de datos de calidad introducidos por ellos."
      },
      {
        "text": "La imposibilidad de integrarlo con herramientas de correo electrónico.",
        "isCorrect": false,
        "rationale": "La integración con el correo electrónico es una de las funcionalidades más básicas y comunes en cualquier solución CRM moderna."
      },
      {
        "text": "La incompatibilidad con las normativas de protección de datos.",
        "isCorrect": false,
        "rationale": "Aunque el cumplimiento es un requisito (RGPD, ENS), los CRM modernos están diseñados para cumplir con estas normativas, por lo que no es una incompatibilidad inherente."
      }
    ],
    "hint": "Piensa en el factor humano. Una herramienta, por muy potente que sea, es inútil si la gente no la utiliza correctamente."
  },
  {
    "guid": "b689ac04-05cf-45ee-8c11-c5d584bb7d58",
    "subjectId": "T14",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "En el contexto de un CRM, ¿qué término describe la secuencia de fases por las que pasa una oportunidad de venta, desde el contacto inicial hasta el cierre?",
    "answerOptions": [
      {
        "text": "Workflow",
        "isCorrect": false,
        "rationale": "Un workflow es una secuencia automatizada de tareas, que puede formar parte de un pipeline, pero no es el término que describe las fases de la venta en sí."
      },
      {
        "text": "Ticket",
        "isCorrect": false,
        "rationale": "Un ticket se refiere al registro de una incidencia o solicitud de servicio, típicamente gestionado por el módulo de atención al cliente."
      },
      {
        "text": "Account",
        "isCorrect": false,
        "rationale": "Una cuenta (account) representa a la empresa o entidad con la que se tiene la relación comercial, no el proceso de venta."
      },
      {
        "text": "Pipeline",
        "isCorrect": true,
        "rationale": "El pipeline o embudo de ventas es la representación visual de las distintas etapas del proceso comercial por las que avanza una oportunidad."
      }
    ],
    "hint": "Este término se asocia a menudo con la imagen de un \"embudo\" de ventas."
  },
  {
    "guid": "465773eb-eeda-44cd-993c-ccdcb9d3e14e",
    "subjectId": "T14",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Un ayuntamiento implementa un sistema para unificar las peticiones que llegan a través del teléfono 010, la web municipal y las oficinas de atención presencial, manteniendo un historial único por ciudadano. Esta estrategia se alinea con el concepto de:",
    "answerOptions": [
      {
        "text": "Sales Force Automation (SFA)",
        "isCorrect": false,
        "rationale": "El SFA se centra en automatizar las tareas del equipo de ventas, un concepto más propio del ámbito comercial privado que de la atención ciudadana."
      },
      {
        "text": "Business Process Management (BPM)",
        "isCorrect": false,
        "rationale": "Aunque BPM podría usarse para optimizar los flujos de trabajo de las peticiones, el concepto clave aquí es la unificación de canales de cara al ciudadano."
      },
      {
        "text": "Omnicanalidad",
        "isCorrect": true,
        "rationale": "La omnicanalidad busca unificar todos los canales de comunicación y atención para ofrecer una experiencia coherente y continua al usuario, manteniendo un historial único."
      },
      {
        "text": "Enterprise Resource Planning (ERP)",
        "isCorrect": false,
        "rationale": "Un ERP se utilizaría para gestionar los recursos internos del ayuntamiento (presupuesto, personal), no la interacción unificada con los ciudadanos."
      }
    ],
    "hint": "Se refiere a la integración de todos los canales de comunicación para ofrecer una experiencia unificada al usuario."
  },
  {
    "guid": "47c6ae36-ba12-42a6-9069-7f8744ac9a8b",
    "subjectId": "T14",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "¿Cuál de las siguientes afirmaciones sobre los CRM en la nube (Cloud CRM / SaaS) es correcta?",
    "answerOptions": [
      {
        "text": "Requieren una gran inversión inicial en infraestructura de servidores propia.",
        "isCorrect": false,
        "rationale": "Precisamente una de sus ventajas es que eliminan la necesidad de infraestructura propia, ya que el proveedor se encarga del alojamiento y mantenimiento."
      },
      {
        "text": "Las actualizaciones del software deben ser gestionadas e instaladas manualmente por el cliente.",
        "isCorrect": false,
        "rationale": "En un modelo SaaS, las actualizaciones son automáticas y gestionadas por el proveedor, asegurando que el cliente siempre use la última versión."
      },
      {
        "text": "Presentan como posible inconveniente la dependencia del proveedor y la necesidad de conexión a internet.",
        "isCorrect": true,
        "rationale": "Al ser un servicio externo, la organización depende de la continuidad del proveedor y del acceso a la red para poder utilizar el sistema."
      },
      {
        "text": "Son menos escalables que las soluciones on-premises.",
        "isCorrect": false,
        "rationale": "La escalabilidad es una de las principales ventajas de las soluciones Cloud, ya que permiten añadir o quitar usuarios y funcionalidades de forma flexible."
      }
    ],
    "hint": "Considera las desventajas inherentes a depender de un servicio alojado por un tercero y accesible a través de la red."
  },
  {
    "guid": "b6a5a672-166c-4c01-93bb-e7075d3ff4a4",
    "subjectId": "T14",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Si el objetivo principal de una organización es modelar, analizar y optimizar un proceso de negocio de principio a fin, como la gestión de un expediente administrativo, ¿qué tipo de solución sería la más específica para esta tarea?",
    "answerOptions": [
      {
        "text": "CRM (Customer Relationship Management)",
        "isCorrect": false,
        "rationale": "Aunque el CRM gestiona la parte de la interacción con el ciudadano en ese expediente, no es la herramienta especializada en modelar y optimizar el proceso completo."
      },
      {
        "text": "BPM (Business Process Management)",
        "isCorrect": true,
        "rationale": "La disciplina de BPM y sus herramientas asociadas se centran específicamente en el análisis, modelado, ejecución y mejora continua de los procesos de negocio."
      },
      {
        "text": "BI (Business Intelligence)",
        "isCorrect": false,
        "rationale": "BI se utilizaría para analizar los datos generados por el proceso (tiempos, cuellos de botella), pero no para modelar o ejecutar el flujo del proceso en sí."
      },
      {
        "text": "ERP (Enterprise Resource Planning)",
        "isCorrect": false,
        "rationale": "Un ERP gestiona los recursos implicados en el proceso (personal, presupuesto), pero la gestión del flujo y la optimización del proceso es el dominio del BPM."
      }
    ],
    "hint": "La pregunta clave se centra en la \"mejora de un proceso de negocio de extremo a extremo\", no en la gestión de clientes o recursos."
  },
  {
    "guid": "29990f7c-555d-4f6e-ad68-9f247681a45f",
    "subjectId": "T14",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Dentro de un CRM, ¿qué funcionalidad permite ejecutar una secuencia de acciones de forma automática cuando se cumple una determinada condición, como enviar un correo de bienvenida cuando se registra un nuevo 'lead'?",
    "answerOptions": [
      {
        "text": "Gestión de campañas",
        "isCorrect": false,
        "rationale": "La gestión de campañas se refiere a la planificación y ejecución de acciones de marketing a gran escala, no a acciones individuales y automáticas basadas en eventos."
      },
      {
        "text": "Cuadro de mando (Dashboard)",
        "isCorrect": false,
        "rationale": "Un cuadro de mando sirve para visualizar datos y KPIs, es una herramienta de análisis y seguimiento, no de ejecución de acciones."
      },
      {
        "text": "Automatización de procesos (Workflow)",
        "isCorrect": true,
        "rationale": "Los workflows o flujos de trabajo están diseñados precisamente para automatizar tareas repetitivas y secuencias de acciones basadas en reglas y disparadores."
      },
      {
        "text": "Módulo de servicio al cliente (Helpdesk)",
        "isCorrect": false,
        "rationale": "Este módulo gestiona incidencias y tickets, y aunque puede usar workflows, la funcionalidad de automatización en sí es el workflow."
      }
    ],
    "hint": "Piensa en el término que describe un \"flujo de trabajo\" automatizado."
  },
  {
    "guid": "d27c7ab8-f5f3-4258-88a7-c631d625fd70",
    "subjectId": "T14",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "¿Qué proveedor de CRM se destaca en el material por su fuerte integración con el ecosistema de SAP ERP, siendo una opción común en grandes empresas que ya utilizan este ERP?",
    "answerOptions": [
      {
        "text": "Salesforce",
        "isCorrect": false,
        "rationale": "Salesforce es líder en el mercado de CRM Cloud y es altamente integrable, pero no se destaca por una integración nativa y profunda con el ERP de SAP como lo hace el producto de la propia SAP."
      },
      {
        "text": "Microsoft Dynamics 365",
        "isCorrect": false,
        "rationale": "Este CRM se caracteriza por su integración con el ecosistema de Microsoft (Office 365, Power BI), no con el de SAP."
      },
      {
        "text": "HubSpot",
        "isCorrect": false,
        "rationale": "HubSpot está fuertemente enfocado en el inbound marketing y es popular entre pymes, no es la solución típicamente elegida por su integración con SAP en grandes corporaciones."
      },
      {
        "text": "SAP Customer Experience (CX)",
        "isCorrect": true,
        "rationale": "Como producto del mismo fabricante, SAP CX (antes SAP CRM) está diseñado para una integración nativa y robusta con el ecosistema SAP ERP, lo que es una ventaja clave en organizaciones que ya lo usan."
      }
    ],
    "hint": "A menudo, las grandes empresas prefieren soluciones del mismo fabricante para garantizar una mejor integración entre sus sistemas clave."
  },
  {
    "guid": "37b1d225-e914-4ac7-9648-b8230b6ad6b7",
    "subjectId": "T14",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "El concepto de 'visión 360º' del cliente, uno de los principales beneficios de un CRM, se refiere a:",
    "answerOptions": [
      {
        "text": "La capacidad del CRM de predecir las ventas del próximo año con total exactitud.",
        "isCorrect": false,
        "rationale": "Aunque un CRM analítico puede ayudar a predecir ventas, la 'visión 360º' se refiere a la completitud de la información, no a la predicción."
      },
      {
        "text": "Tener acceso unificado a todo el historial de interacciones de un cliente a través de todos los canales.",
        "isCorrect": true,
        "rationale": "Esta visión completa (compras, quejas, consultas, contactos) permite a cualquier empleado tener un contexto total de la relación con el cliente."
      },
      {
        "text": "La integración del CRM únicamente con las redes sociales para monitorizar la opinión del cliente.",
        "isCorrect": false,
        "rationale": "La integración con redes sociales es solo una parte de la visión 360º, que debe incluir todos los puntos de contacto (email, teléfono, web, etc.)."
      },
      {
        "text": "Una estrategia de marketing que se enfoca en publicitar la marca en todos los medios posibles.",
        "isCorrect": false,
        "rationale": "Esto describe una estrategia de comunicación o publicidad, no la visión unificada de los datos del cliente dentro de un sistema."
      }
    ],
    "hint": "Imagina poder ver, en una sola pantalla, absolutamente toda la historia de la relación de un cliente con tu organización."
  },
  {
    "guid": "0298c8e1-63e5-4019-92c1-69d5a8ef9137",
    "subjectId": "T14",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "En la terminología CRM, ¿cuál es la diferencia entre un 'Lead' y una 'Opportunity'?",
    "answerOptions": [
      {
        "text": "Un 'Lead' es un cliente que ya ha comprado, mientras que una 'Opportunity' es un cliente potencial.",
        "isCorrect": false,
        "rationale": "Un cliente que ya ha comprado es un cliente o 'account', no un 'lead'. El 'lead' es el primer paso en el proceso."
      },
      {
        "text": "Son términos sinónimos que se utilizan para cualquier contacto comercial.",
        "isCorrect": false,
        "rationale": "No son sinónimos; representan diferentes etapas del proceso de venta. Un 'lead' precede a una 'opportunity'."
      },
      {
        "text": "Un 'Lead' es un contacto potencial no cualificado, mientras que una 'Opportunity' es un lead que ha sido cualificado y muestra una posibilidad real de venta.",
        "isCorrect": true,
        "rationale": "Esta es la distinción clave: el 'lead' es el contacto en bruto, y la 'opportunity' surge cuando se ha verificado que hay una necesidad, presupuesto e interés real."
      },
      {
        "text": "Una 'Opportunity' es el registro de una queja, mientras que un 'Lead' es una solicitud de información.",
        "isCorrect": false,
        "rationale": "El registro de una queja se denomina 'ticket' o 'incidencia', no 'opportunity'."
      }
    ],
    "hint": "Piensa en el proceso de venta como un filtro. No todos los contactos iniciales se convierten en posibilidades reales de negocio."
  },
  {
    "guid": "c60145c9-b255-4ed5-be44-5ef1a3d1af9c",
    "subjectId": "T14",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Una empresa de software nota que un alto porcentaje de sus clientes abandona el servicio después del primer año. Para analizar las causas y reducir esta tasa, ¿qué métrica o KPI sería la más relevante a monitorizar en su CRM?",
    "answerOptions": [
      {
        "text": "Tasa de conversión de leads",
        "isCorrect": false,
        "rationale": "Esta métrica mide la eficacia en convertir clientes potenciales en clientes nuevos, pero no informa sobre la retención de los clientes existentes."
      },
      {
        "text": "Valor de vida del cliente (CLV)",
        "isCorrect": false,
        "rationale": "Aunque la pérdida de clientes afecta negativamente al CLV, esta métrica es una predicción de valor a largo plazo, no la medida directa de la tasa de abandono."
      },
      {
        "text": "Churn rate (tasa de abandono)",
        "isCorrect": true,
        "rationale": "El 'churn rate' mide específicamente el porcentaje de clientes que dejan de usar el servicio en un período determinado, siendo el indicador directo del problema descrito."
      },
      {
        "text": "Retorno de la inversión (ROI) de campañas",
        "isCorrect": false,
        "rationale": "El ROI mide la rentabilidad de las acciones de marketing para captar clientes, no para retenerlos."
      }
    ],
    "hint": "Busca la métrica que mide específicamente el porcentaje de clientes perdidos en un periodo de tiempo."
  },
  {
    "guid": "0099149c-1a18-4a56-a849-f6a2185a5666",
    "subjectId": "T14",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "¿Qué tendencia tecnológica actual en los CRM utiliza algoritmos para sugerir la siguiente mejor acción de venta, predecir qué clientes tienen riesgo de abandono o automatizar la atención con asistentes virtuales?",
    "answerOptions": [
      {
        "text": "Integración con IoT",
        "isCorrect": false,
        "rationale": "La integración con IoT (Internet de las Cosas) se refiere a obtener datos de dispositivos, lo cual puede alimentar a la IA, pero no es la tecnología predictiva en sí misma."
      },
      {
        "text": "Inteligencia Artificial (IA) y Machine Learning",
        "isCorrect": true,
        "rationale": "La IA y el aprendizaje automático son las tecnologías que permiten analizar grandes volúmenes de datos para hacer predicciones, recomendaciones y automatizar interacciones complejas como los chatbots."
      },
      {
        "text": "CRM móvil",
        "isCorrect": false,
        "rationale": "El CRM móvil se refiere a la capacidad de acceder al sistema desde dispositivos móviles, lo cual es una tendencia de accesibilidad, no de análisis predictivo."
      },
      {
        "text": "Omnicanalidad real",
        "isCorrect": false,
        "rationale": "La omnicanalidad se centra en la integración de canales de comunicación, no en la capacidad de análisis predictivo o la automatización inteligente."
      }
    ],
    "hint": "Piensa en la tecnología que permite a los sistemas \"aprender\" de los datos para hacer predicciones y recomendaciones."
  },
  {
    "guid": "3532d388-6568-4fb0-b159-1c1531024a5c",
    "subjectId": "T14",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Un CRM colaborativo tiene como principal finalidad:",
    "answerOptions": [
      {
        "text": "Analizar en profundidad los datos de los clientes para la segmentación y el cálculo del CLV.",
        "isCorrect": false,
        "rationale": "Esta es la función principal de un CRM analítico, no del colaborativo."
      },
      {
        "text": "Automatizar las tareas repetitivas del equipo de ventas y marketing.",
        "isCorrect": false,
        "rationale": "Esta es la característica principal de un CRM operativo."
      },
      {
        "text": "Facilitar la comunicación y coordinación entre diferentes departamentos (ventas, marketing, soporte) para ofrecer una experiencia de cliente unificada.",
        "isCorrect": true,
        "rationale": "El enfoque del CRM colaborativo es romper los silos de información y permitir que todos los equipos compartan datos del cliente para trabajar de forma coordinada."
      },
      {
        "text": "Gestionar los recursos financieros y la cadena de suministro de la empresa.",
        "isCorrect": false,
        "rationale": "Estas son funciones típicas de un sistema ERP, no de un CRM."
      }
    ],
    "hint": "Este tipo de CRM se centra en cómo los equipos internos trabajan juntos y comparten información sobre el cliente."
  },
  {
    "guid": "2912aea1-1708-418d-98fa-299e35c8893e",
    "subjectId": "T14",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "¿Qué es SFA (Sales Force Automation) en el contexto de un CRM?",
    "answerOptions": [
      {
        "text": "Un tipo de CRM completamente diferente y sin relación con los CRM operativos.",
        "isCorrect": false,
        "rationale": "No es un sistema diferente, sino que está estrechamente relacionado y a menudo es una parte integral del CRM."
      },
      {
        "text": "Una subfunción o componente del CRM enfocado específicamente en automatizar las tareas del equipo de ventas.",
        "isCorrect": true,
        "rationale": "SFA se refiere a las herramientas dentro de un CRM que ayudan a los vendedores a ser más eficientes, como la gestión de contactos, oportunidades y la automatización de tareas comerciales."
      },
      {
        "text": "El módulo de análisis predictivo que utilizan los CRM.",
        "isCorrect": false,
        "rationale": "El análisis predictivo corresponde al CRM analítico o a funcionalidades de IA, mientras que SFA es de naturaleza operativa."
      },
      {
        "text": "El nombre que recibe el CRM cuando se aplica exclusivamente a la administración pública.",
        "isCorrect": false,
        "rationale": "En la administración pública, el CRM se adapta y a veces se llama Citizen Relationship Management, no SFA."
      }
    ],
    "hint": "La clave está en las siglas: 'Sales Force'. Piensa en qué parte del negocio se beneficia directamente de esta automatización."
  },
  {
    "guid": "8daeb593-949f-409a-85f3-c5efd33a1805",
    "subjectId": "T14",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "De acuerdo con los errores habituales mencionados en el material, ¿cuál de las siguientes afirmaciones es FALSA?",
    "answerOptions": [
      {
        "text": "Un CRM es tanto una estrategia de negocio como una herramienta tecnológica.",
        "isCorrect": false,
        "rationale": "Esta afirmación es verdadera; uno de los errores comunes es pensar que es solo software."
      },
      {
        "text": "Todos los sistemas CRM modernos son aplicaciones en la nube (SaaS).",
        "isCorrect": true,
        "rationale": "Esta afirmación es falsa, ya que el material especifica que, aunque es la tendencia, todavía existen versiones on-premises (instaladas en servidores locales)."
      },
      {
        "text": "Un CRM debe cumplir con la normativa RGPD al gestionar datos personales.",
        "isCorrect": false,
        "rationale": "Esta afirmación es verdadera; ignorar el RGPD es un error grave."
      },
      {
        "text": "Los CRM se aplican tanto en empresas privadas como en la administración pública.",
        "isCorrect": false,
        "rationale": "Esta afirmación es verdadera, adaptándose en el sector público como Citizen Relationship Management."
      }
    ],
    "hint": "Revisa las aclaraciones sobre los tipos de despliegue de software. ¿Hay solo una opción posible?"
  },
  {
    "guid": "dffd9bde-e4e7-4807-94cb-573b3ff41d38",
    "subjectId": "T14",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Una organización quiere implementar un sistema para gestionar las nóminas de sus empleados, el control de inventario y la contabilidad. ¿Qué tipo de sistema integrado debería buscar?",
    "answerOptions": [
      {
        "text": "CRM (Customer Relationship Management)",
        "isCorrect": false,
        "rationale": "El CRM se enfoca en las relaciones con el cliente, no en procesos internos como nóminas o inventario."
      },
      {
        "text": "ERP (Enterprise Resource Planning)",
        "isCorrect": true,
        "rationale": "El ERP es el sistema diseñado para integrar y gestionar los procesos de negocio internos y los recursos de la empresa, incluyendo finanzas, RRHH e inventario."
      },
      {
        "text": "BPM (Business Process Management)",
        "isCorrect": false,
        "rationale": "Un sistema BPM se usaría para modelar y optimizar los flujos de trabajo de esos procesos, pero no para la gestión transaccional diaria de la contabilidad o las nóminas."
      },
      {
        "text": "BI (Business Intelligence)",
        "isCorrect": false,
        "rationale": "Un sistema de BI se utilizaría para analizar los datos de nóminas o inventario, pero no para gestionarlos operativamente."
      }
    ],
    "hint": "La pregunta se refiere a la gestión de recursos y procesos internos de la empresa, no a la relación con el exterior."
  },
  {
    "guid": "99a787be-b3a3-481a-a3cd-5640d66ab665",
    "subjectId": "T14",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Dentro de los componentes principales de un CRM, ¿cuál es el responsable de la gestión de incidencias, consultas y reclamaciones de los clientes?",
    "answerOptions": [
      {
        "text": "Módulo de ventas",
        "isCorrect": false,
        "rationale": "Este módulo se centra en gestionar el ciclo de vida de la venta: contactos, oportunidades, pipeline, etc."
      },
      {
        "text": "Módulo de márketing",
        "isCorrect": false,
        "rationale": "Este módulo gestiona campañas, leads y la comunicación proactiva con los clientes potenciales."
      },
      {
        "text": "Módulo de servicio al cliente (Help Desk)",
        "isCorrect": true,
        "rationale": "Este componente, a menudo llamado Help Desk o Service Desk, está diseñado para registrar, gestionar y resolver las peticiones y problemas postventa de los clientes."
      },
      {
        "text": "Módulo de análisis",
        "isCorrect": false,
        "rationale": "Este módulo proporciona informes y cuadros de mando para analizar el rendimiento de los otros módulos, pero no gestiona las incidencias directamente."
      }
    ],
    "hint": "Piensa en el departamento que se encarga de la atención postventa y la resolución de problemas."
  },
  {
    "guid": "ea94f217-3ee6-4a5c-9d82-e392ac5e7d31",
    "subjectId": "T14",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "El término CEM (Customer Experience Management) se relaciona con el CRM porque:",
    "answerOptions": [
      {
        "text": "Es un sinónimo exacto de CRM Colaborativo.",
        "isCorrect": false,
        "rationale": "No es un sinónimo; el CEM es un concepto más amplio que el CRM Colaborativo."
      },
      {
        "text": "Es una métrica para calcular el valor del cliente, como el CLV.",
        "isCorrect": false,
        "rationale": "CEM no es una métrica, sino una disciplina o estrategia."
      },
      {
        "text": "Se enfoca en gestionar la percepción y el sentimiento del cliente en todos los puntos de contacto, siendo un concepto más amplio que el CRM.",
        "isCorrect": true,
        "rationale": "CEM abarca la totalidad de la experiencia del cliente con la marca, mientras que el CRM es la herramienta y estrategia para gestionar las interacciones directas."
      },
      {
        "text": "Es un tipo de software que sustituye por completo a los CRM.",
        "isCorrect": false,
        "rationale": "El CEM es una estrategia que se apoya en la tecnología CRM, no un software que lo reemplaza."
      }
    ],
    "hint": "Considera qué concepto es más amplio: gestionar las relaciones o gestionar la experiencia completa del cliente."
  },
  {
    "guid": "a09e092c-b4b7-48c4-9229-fb74151439d2",
    "subjectId": "T14",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Una de las funcionalidades clave de un CRM es la integración con un sistema de BI (Business Intelligence). ¿Cuál es el propósito principal de esta integración?",
    "answerOptions": [
      {
        "text": "Para automatizar el envío de correos electrónicos masivos a los clientes.",
        "isCorrect": false,
        "rationale": "Esta función la realiza el módulo de marketing del CRM o una herramienta de e-mail marketing, no una de BI."
      },
      {
        "text": "Para permitir una explotación y análisis avanzado de los datos de clientes recogidos por el CRM, creando informes y cuadros de mando complejos.",
        "isCorrect": true,
        "rationale": "La integración permite que las herramientas de BI accedan a los datos del CRM para realizar análisis más profundos, visualizaciones avanzadas y descubrir insights que el CRM por sí solo no podría."
      },
      {
        "text": "Para gestionar el inventario de productos y la facturación de las ventas registradas en el CRM.",
        "isCorrect": false,
        "rationale": "Esta sería la función de la integración con un sistema ERP, no con uno de BI."
      },
      {
        "text": "Para modelar los flujos de trabajo de atención al cliente.",
        "isCorrect": false,
        "rationale": "El modelado de procesos es una tarea propia de un sistema BPM, no de BI."
      }
    ],
    "hint": "Piensa en la 'I' de BI. ¿Qué aporta una herramienta especializada en inteligencia a los datos brutos que recoge un CRM?"
  },
  {
    "guid": "5fc71bf7-2084-4743-9d12-dabca8ec0212",
    "subjectId": "T14",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Según la tabla-resumen, ¿qué proveedor de CRM se caracteriza por ser una solución SaaS modular y económica, especialmente orientada a pymes?",
    "answerOptions": [
      {
        "text": "SAP",
        "isCorrect": false,
        "rationale": "SAP está tradicionalmente orientado a grandes empresas con procesos complejos y una fuerte integración con su ERP."
      },
      {
        "text": "Oracle",
        "isCorrect": false,
        "rationale": "Oracle CX Cloud también es una solución empresarial orientada a grandes organizaciones."
      },
      {
        "text": "Zoho",
        "isCorrect": true,
        "rationale": "Zoho CRM es conocido por su modelo de negocio flexible, modular y con precios competitivos, lo que lo hace muy popular entre las pequeñas y medianas empresas."
      },
      {
        "text": "Salesforce",
        "isCorrect": false,
        "rationale": "Aunque Salesforce tiene versiones para pymes, es principalmente conocido como un CRM completo y líder del mercado, no necesariamente como la opción más económica."
      }
    ],
    "hint": "Busca el proveedor que se asocia con flexibilidad y un coste más asequible para empresas de menor tamaño."
  },
  {
    "guid": "5bc73aae-4ecc-4680-b9ba-839080017ccb",
    "subjectId": "T14",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "El concepto de que el CRM no es solo una pieza de software, sino una \"estrategia de negocio\" o \"filosofía\", implica que:",
    "answerOptions": [
      {
        "text": "Solo se puede implementar si se compra el software más caro del mercado.",
        "isCorrect": false,
        "rationale": "La estrategia no depende del coste de la herramienta, sino del compromiso de la organización."
      },
      {
        "text": "Toda la organización debe orientar sus procesos y cultura a poner al cliente en el centro de sus decisiones.",
        "isCorrect": true,
        "rationale": "Esta idea (customer-centric) es el núcleo de la filosofía CRM: la tecnología es solo un soporte para esta estrategia global."
      },
      {
        "text": "No es necesario ningún software para llevar a cabo una estrategia CRM.",
        "isCorrect": false,
        "rationale": "Si bien la estrategia es lo primero, en la práctica moderna es inviable gestionarla eficazmente sin un sistema tecnológico de apoyo."
      },
      {
        "text": "La estrategia solo afecta a los departamentos de ventas y marketing, no al resto de la empresa.",
        "isCorrect": false,
        "rationale": "Una verdadera estrategia CRM implica a todos los departamentos que, de una forma u otra, impactan en la experiencia del cliente."
      }
    ],
    "hint": "Piensa en la diferencia entre una herramienta y una forma de pensar que afecta a toda la cultura de una organización."
  },
  {
    "guid": "9f4ba6f7-ba29-4f77-b1bf-6e75da80471a",
    "subjectId": "T14",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "En el contexto de la administración pública, ¿cuál sería un ejemplo práctico de la integración de un CRM municipal?",
    "answerOptions": [
      {
        "text": "Gestionar el sistema de control de acceso y fichajes de los empleados del ayuntamiento.",
        "isCorrect": false,
        "rationale": "Esto es una función de un sistema de Recursos Humanos (RRHH), que formaría parte de un ERP, no de un CRM."
      },
      {
        "text": "Centralizar una queja ciudadana recibida por teléfono (010) y que el historial esté disponible al consultar el expediente en la Carpeta del Ciutadà.",
        "isCorrect": true,
        "rationale": "Este es un ejemplo claro de Citizen Relationship Management, donde se integra un canal de atención (010) con una plataforma de autogestión (Carpeta del Ciutadà) para dar una visión unificada."
      },
      {
        "text": "Controlar el inventario de material de oficina de los diferentes departamentos municipales.",
        "isCorrect": false,
        "rationale": "La gestión de inventario es una función clásica de un sistema ERP."
      },
      {
        "text": "Publicar noticias y eventos en la página web del ayuntamiento.",
        "isCorrect": false,
        "rationale": "Esta tarea se realiza con un Gestor de Contenidos o CMS (Content Management System), no con un CRM."
      }
    ],
    "hint": "Busca la opción que describa una interacción directa entre el ciudadano y la administración a través de sus plataformas de atención."
  },

  
  {
    "guid": "1d09cc2e-1839-4b50-9f5c-b4ba3a936829",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Qué significa el acrónimo CRM?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Customer Relationship Management (Gestión de las relaciones con los clientes)."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "b51ff5e1-b13e-439f-aaa4-ee0ab2b5abd3",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Cuál es el objetivo principal de una estrategia CRM?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Centralizar, automatizar y mejorar todas las interacciones entre una organización y sus clientes."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "24a06007-b8ea-4735-9725-17104e1b6a8d",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "La filosofía de negocio que pone al cliente en el centro de todas las operaciones se denomina _____.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "customer-centric"
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "e1dfa839-e6c6-417d-841f-3b37a7439765",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "Un objetivo clave de un CRM es mejorar la _____ de los clientes existentes.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "fidelización"
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "d06ae692-c38b-430c-9135-4848c6308d66",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Qué tipo de CRM se centra en automatizar los procesos de ventas, marketing y servicio al cliente?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "CRM Operativo."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "da81bea8-3a00-4c0a-bac4-4f0f15e36f49",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Cuál es la finalidad principal de un CRM Analítico?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Analizar los datos de los clientes para obtener información útil como tendencias y hábitos de consumo."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "cbfe0e81-1bb4-4581-9883-1d7d82209e5b",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "El tipo de CRM que facilita la comunicación entre departamentos y con el cliente por diferentes canales se conoce como CRM _____.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Colaborativo"
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "35c8426a-0b82-46e1-ac3c-9348f1044ae5",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Qué módulo de un CRM se encarga de gestionar contactos, oportunidades, pipeline y comisiones?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "El módulo de ventas."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "9b3f9ecc-a034-4837-8e2f-5e48c322954d",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "La gestión de campañas, leads, automatización y seguimiento es una función del módulo de _____ de un CRM.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "marketing"
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "d1cb9f12-7ca0-482e-b927-f1c8aae95e25",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Qué componente de un CRM gestiona incidencias, helpdesk y atención omnicanal?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "El módulo de servicio al cliente."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "a12c66ae-488a-4617-a642-ba87590c24b5",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "El aumento de las ventas cruzadas (cross-selling) y las ventas adicionales (up-selling) es un beneficio directo de la implementación de un _____.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "CRM"
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "840be24c-31bb-4670-95a5-87735590571a",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "Mencione un desafío común en la implementación de un CRM relacionado con los sistemas existentes.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "La integración con otros sistemas como ERP, correo electrónico o BI."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "dbc81f1c-dfbf-4412-860f-50b1c01f3385",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Qué proveedor de CRM es conocido por su completa solución en la nube, modular y su alta capacidad de integración?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Salesforce (con Sales Cloud, Service Cloud)."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "97f6c28c-deb4-4df3-8a5a-a1ba155cc728",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Qué solución CRM de Microsoft se integra nativamente con Office 365 y Power BI?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Microsoft Dynamics 365 CRM."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "f091c96f-7347-4767-aff5-cab45acfad9e",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "HubSpot CRM está especialmente enfocado en _____ y la metodología inbound.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "marketing"
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "ff835e12-f751-4c3b-a5a4-cfda198edb3e",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "En el ámbito público, ¿cómo se suele denominar la aplicación de un CRM para gestionar la relación con la ciudadanía?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Citizen Relationship Management."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "a306e9fb-40c7-46a2-ba2f-d2b5c5d27a84",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "Un CRM municipal puede integrarse con la _____ o sistemas de atención como el 010.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Carpeta del Ciutadà"
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "b72c1da6-d6fd-4282-b329-ebe91e08e662",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Cuál es la principal diferencia funcional entre un sistema ERP y un CRM?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "El ERP gestiona procesos internos y recursos (finanzas, inventario), mientras que el CRM gestiona la relación externa con los clientes."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "fc9b7207-229b-4d41-9491-fe4ae9905407",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Qué significa el concepto de 'Omnicanalidad' en el contexto de un CRM?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "La unificación de todos los canales de atención (teléfono, correo, web, redes sociales) en un único historial del cliente."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "9500d563-c580-4a37-bb02-7fff36f9b99e",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "Concepto: Lead Scoring",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Es la valoración o puntuación automática de los leads para determinar su potencial de conversión."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "6320392e-9b09-4e72-9784-ccfbd52df1c6",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "Según la definición formal, un CRM es un conjunto de estrategias, procesos y tecnologías para comprender, anticipar y responder a las necesidades de los clientes con el fin de aumentar el _____ de la relación.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "valor"
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "565a2167-e00f-44cf-bba7-b2ef2fb9b4fc",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Cuál es el componente fundamental de un CRM que contiene todos los datos de los clientes, interacciones y solicitudes?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "La base de datos centralizada."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "03fb2996-4270-4ca1-a4e1-675bf8f70164",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Qué es la 'visión 360º' del cliente que proporciona un CRM?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Es una visión completa y unificada de toda la información e historial de un cliente o ciudadano."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "6be8fcc2-2381-4d89-914e-54f012ea5e21",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Qué tipo de CRM corresponde a la visión global que busca centrar toda la organización en el cliente, integrando los otros tipos?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "CRM Estratégico."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "648bdbaf-d27b-4b92-8e0f-763474d21dc5",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Qué es un CRM en la nube o Cloud CRM?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Un CRM ofrecido como SaaS (Software as a Service), accesible por internet y sin necesidad de infraestructura propia."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "a0ee477e-933a-4bd9-a04e-74329c090b93",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "Mencione una ventaja de los CRM en la nube (SaaS).",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Escalabilidad, actualizaciones automáticas, accesibilidad desde cualquier dispositivo o modelo de pago por suscripción."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "84bdc469-f2ad-434d-893a-a159cad1eb2f",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "Mencione un inconveniente o riesgo de los CRM en la nube (SaaS).",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Dependencia del proveedor, riesgos de privacidad/soberanía de datos o necesidad de conexión permanente."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "d97049b0-790d-457e-a313-843920a22953",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Qué sistema corporativo se integra con el CRM para sincronizar facturación, inventario y comisiones?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Un ERP (Enterprise Resource Planning)."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "1f51e3c6-0453-4d56-b84f-ac8802ad9c40",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Para qué se integra un CRM con un sistema de BI (Business Intelligence)?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Para la explotación y análisis avanzado de los datos de los clientes almacenados en el CRM."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "4bf52bde-308e-46e2-a25c-d05b50682a37",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "La métrica que mide el porcentaje de clientes perdidos en un período se denomina _____.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Churn rate"
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "2c069fd2-4cbe-4581-b60a-c7389adc5ef2",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Qué es el CLV (Customer Lifetime Value)?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "El valor total o beneficio neto esperado que un cliente generará para la empresa durante toda su relación."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "c5915471-e93e-4f48-9c01-f6903b4eacce",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Qué normativa europea de protección de datos debe cumplir obligatoriamente un sistema CRM?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "El RGPD (Reglamento General de Protección de Dades)."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "ecef07d2-447f-4252-99c9-cf2689557c9f",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "En el sector público español, además del RGPD, ¿qué marco de seguridad deben cumplir los sistemas CRM?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "El Esquema Nacional de Seguridad (ENS)."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "ddac311d-6427-434e-ba18-44f21ab86cd1",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "La integración de _____ y Machine Learning en los CRM permite funcionalidades como la predicción de ventas y recomendaciones automáticas.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Inteligencia Artificial (IA)"
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "1d77993b-2ea0-4d45-b3ca-abcadfa22a88",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "Término CRM: Lead",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Un contacto potencial o una oportunidad comercial que aún no ha sido calificada."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "4a7c48eb-2e7a-45dd-9471-0972f4df44b4",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "Término CRM: Pipeline",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Las fases o etapas por las que pasa una oportunidad de venta, desde el contacto inicial hasta el cierre."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "0c07d1a6-4432-46e6-8a0d-af22f32a220a",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "En CRM, ¿qué es un 'Account' (Cuenta)?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "La empresa, organización o entidad con la que se tiene una relación comercial."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "5cbec765-bff1-46ad-bee1-82c669a3b4d1",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "En CRM, ¿qué es un 'Ticket'?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "El registro de una incidencia, consulta, queja o petición de un cliente o ciudadano."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "6bfc1224-5c42-429f-84e2-fed739f1859b",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "Término CRM: Workflow",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Un flujo de trabajo o secuencia automática de tareas, notificaciones o aprobaciones que se ejecuta al cumplirse ciertas condiciones."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "1ebb4599-b265-4da9-9e9f-f51a41a5967c",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Cuál es el error conceptual más común sobre qué es un CRM?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Pensar que es solo un software, cuando en realidad es una estrategia de negocio apoyada en tecnología."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "e7a003ad-e4fc-499b-8b3b-4d144cd37b54",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Qué sistema se utilizaría para modelar, analizar y optimizar un proceso de negocio de principio a fin?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Un BPM (Business Process Management)."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "91a11da6-9ab9-4018-86a1-bca77b18acb4",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Es cierto que un CRM puede sustituir totalmente a un ERP?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "No, son sistemas complementarios. El CRM gestiona la relación externa y el ERP los procesos internos."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "dfdab310-e56f-40ee-9b20-733ff3d2cbf6",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "Los sistemas CRM modernos también existen en versiones instaladas en servidores locales, conocidas como _____.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "on-premises"
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "11e9c3f2-4f82-45d4-a296-d0e6fe9d6a45",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "Concepto: CEM (Customer Experience Management)",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Es la gestión de la experiencia completa del cliente a lo largo de todos los puntos de contacto con la organización."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "27d6c5a3-a191-418f-b754-758856435ed3",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "La automatización específica de la fuerza de ventas dentro de un CRM se conoce por el acrónimo _____.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "SFA (Sales Force Automation)"
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "5c6c77b8-d2bd-41b2-a848-51c946d77b75",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Qué es una 'Opportunity' en el contexto de un CRM de ventas?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Una oportunidad de venta ya cualificada, es decir, un lead con una alta probabilidad de convertirse en cliente."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "fc8b491d-c1ed-47fa-b08c-02fffb3717a2",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "La característica destacada de SAP Customer Experience (CX) es su fuerte integración con el _____ de la misma marca.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "ERP SAP"
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "b90689e2-b361-4e77-a753-8d5af149b78b",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "Zoho CRM es una solución SaaS orientada principalmente a _____ por ser modular y económica.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "pymes (pequeñas y medianas empresas)"
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "81039fdb-9ca9-4079-aacd-af313dca997f",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "El derecho de un individuo a solicitar la eliminación de sus datos personales de un CRM se conoce como _____.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Derecho de supresión o 'dret a l’oblit'."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "bec456f2-60cf-4353-b267-286883cc688e",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "El principio del RGPD que establece que solo se debe permitir el acceso a los datos estrictamente necesarios para una función es el principio de _____.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "minimización de datos"
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "c8cfb881-c5a4-4223-acd5-ec0566cb16fe",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "La integración de un CRM con un _____ permite sincronizar contactos y enviar campañas de email marketing de forma automatizada.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "sistema de e-mail marketing"
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "d344144e-b412-45f9-9521-9318c70148b9",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Qué KPI de un CRM mide el tiempo que se tarda en dar una primera contestación a una consulta o incidencia?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "El tiempo medio de respuesta."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "65efda41-6811-4407-a9b0-469bf49d49bb",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Qué tipo de sistema gestiona los contenidos de una página web corporativa?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Un CMS (Content Management System)."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "2ee25360-274d-4203-a233-c1f60486bdc1",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "El uso de _____ y asistentes virtuales es una tendencia en CRM para automatizar la atención al cliente de primer nivel.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "chatbots"
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "a6b04df1-745c-4315-b01e-d4498c0091a8",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "Si un sistema se enfoca en la gestión interna de recursos, finanzas y RRHH, es un _____.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "ERP"
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "6fe71fbd-8539-46e7-ac16-2c35f8c279f9",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "Si un sistema se enfoca en la relación con clientes y ciudadanos, es un _____.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "CRM"
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "2071150e-eed1-49c7-9313-69d59ab665ee",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "Si una herramienta se enfoca en la mejora y modelado de procesos de negocio, es un _____.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "BPM"
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "79451bfd-63e9-46fb-a228-6873181d603d",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "Si una solución se dedica al análisis de datos para generar informes y cuadros de mando estratégicos, es una herramienta de _____.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "BI (Business Intelligence)"
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "4f2edb4c-bec0-4cc8-8cf6-52c193a88af2",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "Un error común es pensar que el CRM solo sirve para el departamento de _____.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "ventas (o comercial)"
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "8d7175ab-896a-4df6-8679-d91a8caa6c39",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "La gestión del cambio y la _____ interna por parte de los empleados es un desafío clave para el éxito de un CRM.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "adopción"
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "2ed77b7d-6a28-40d6-8349-4f3ee5ad87f0",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "La funcionalidad que permite atender a los usuarios por correo, web, teléfono y redes sociales con un único historial se llama integración _____.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "omnicanal"
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "29b79e8d-8775-47cf-96f8-d0b22b20955b",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Qué es la venta cruzada o 'cross-selling'?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "La práctica de vender un producto o servicio diferente pero complementario a un cliente existente."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "040bb697-0af8-445a-8380-0e872031c481",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Qué es la venta superior o 'up-selling'?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "La práctica de persuadir a un cliente para que compre una versión más cara o mejorada del producto o servicio elegido."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "c8efc16d-2109-4c43-a593-5fa3deca7c5c",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "La capacidad de un CRM para enlazar con expedientes y registros administrativos se logra mediante la integración con un _____.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "gestor documental o archivo electrónico"
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "271dea5a-bc2d-44a1-8589-42142aba6c50",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Cuál es la característica principal de Oracle CX Cloud?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Es un CRM empresarial orientado a grandes organizaciones con un fuerte enfoque analítico."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "a35ffccc-75bd-4532-8ea7-4623720490ba",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "En el contexto de la administración pública, un CRM ayuda a mejorar la _____ y la transparencia en la gestión de solicitudes ciudadanas.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "trazabilidad"
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "79a6cab8-496b-46aa-9cae-88246063c4e0",
    "subjectId": "T14",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "Además de una estrategia, el CRM es también un _____ que la soporta.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "sistema tecnológico"
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  }
]