[
  {
    "guid": "c8b5ef44-d5e2-45c4-81e1-3c4dbf07b11a",
    "subjectId": "T15",
    "difficulty": 1,
    "origin": "OPOS19_preguntes_especific.pdf",
    "type": "opos19",
    "question": "11. Quines solucions de mercat són per gestió documental?",
    "answerOptions": [
      { "text": "A. Alfresco, Sharepoint, Opentext Content Suite, Documentum.", "isCorrect": true, "rationale": "Són les solucions de mercat més habituals per a la gestió documental segons els estàndards internacionals." },
      { "text": "B. Llibre Office, Sharepoint, Opentext Content Suite, Documentum.", "isCorrect": false, "rationale": "LibreOffice és una suite ofimàtica, no una eina de gestió documental." },
      { "text": "C. Microsoft Office, Sharepoint, Opentext Content Suite, Documentum.", "isCorrect": false, "rationale": "Microsoft Office no és una eina de gestió documental, sinó d’ofimàtica." },
      { "text": "D. Microsoft Office, Llibre Office, Opentext Content Suite, Documentum.", "isCorrect": false, "rationale": "Inclou eines d’ofimàtica que no són pròpiament sistemes de gestió documental." }
    ],
    "hint": "Recorda que un gestor documental serveix per gestionar el cicle de vida dels documents, no per editar-los."
  },
  {
    "guid": "6b2d4d66-16f0-4a41-93e4-9f1e7b2da567",
    "subjectId": "T15",
    "difficulty": 2,
    "origin": "OPOS19_preguntes_especific.pdf",
    "type": "opos19",
    "question": "38. Com es garanteix la integritat i immutabilitat de l’expedient electrònic previ a la seva remissió a una altra Administració o a un jutjat?",
    "answerOptions": [
      { "text": "A. Signant l’expedient amb la signatura electrònica avançada.", "isCorrect": false, "rationale": "Tot i que una signatura avançada garanteix autenticitat, no és el mecanisme específic per assegurar la integritat global de l’expedient." },
      { "text": "B. Signant l’expedient amb la signatura electrònica qualificada.", "isCorrect": false, "rationale": "La signatura qualificada s’aplica habitualment a documents, no a l’índex complet d’un expedient." },
      { "text": "C. Signant l’expedient amb el segell electrònic.", "isCorrect": false, "rationale": "El segell electrònic acredita l’òrgan emissor, però no assegura la integritat documental completa." },
      { "text": "D. Amb la generació de l’índex autentificat electrònic dels documents de l’expedient.", "isCorrect": true, "rationale": "L’índex electrònic signat garanteix la integritat i immutabilitat de tots els documents de l’expedient." }
    ],
    "hint": "Pensa en el mecanisme que recull i autentifica tots els documents dins l’expedient."
  },
  {
    "guid": "3a09c8a8-7cf8-476b-b7e8-58ce729dd51e",
    "subjectId": "T15",
    "difficulty": 2,
    "origin": "OPOS21_preguntes_practic.pdf",
    "type": "opos21",
    "question": "23. Per gestionar les queixes, el Departament de Gestió Integral del Soroll organitza els documents de la tramitació en expedients sota la norma del MGDE (Model de gestió de documents i expedients electrònics) a l'eArxiu (Arxiu Electrònic). [...] Quina d'aquestes afirmacions sobre l'índex electrònic dels expedients NO és certa?",
    "answerOptions": [
      { "text": "A. Garanteix la seqüència cronològica dels documents.", "isCorrect": false, "rationale": "L’índex electrònic recull els documents ordenats cronològicament." },
      { "text": "B. L'índex electrònic no incorpora documents que formin part de més d'un expedient.", "isCorrect": false, "rationale": "Cada document pertany a un sol expedient." },
      { "text": "C. L'índex electrònic de l'expedient és un fitxer XML.", "isCorrect": false, "rationale": "És cert: l’índex electrònic es genera com a fitxer XML signat." },
      { "text": "D. Es pot crear un índex electrònic provisional encara que l'expedient no estigui tancat.", "isCorrect": true, "rationale": "Només es genera un índex definitiu en tancar l’expedient; un de provisional no és normativament vàlid." }
    ],
    "hint": "L’índex electrònic només és definitiu quan l’expedient està tancat."
  },
  {
    "guid": "8393cc4b-545a-4cf7-b6b1-8b2f4c7d1184",
    "subjectId": "T15",
    "difficulty": 3,
    "origin": "OPOS21_preguntes_practic.pdf",
    "type": "opos21",
    "question": "24. Els expedients electrònics conformats al gestor documental tenen les seves pròpies metadades. [...] Quines d'aquestes característiques haurien de tenir per complir amb el MGDE?",
    "answerOptions": [
      { "text": "A. En aquest cas, en el grup de metadades de gestió s'han d'incloure els valors dels audímetres obtinguts i recollits per la GU.", "isCorrect": false, "rationale": "Aquestes dades no formen part del conjunt de metadades normatives definides pel MGDE." },
      { "text": "B. Les metadades de registre (informacions relacionades amb l'acte de registre) s'han d’emplenar automàticament per a tots els documents de l'expedient.", "isCorrect": false, "rationale": "Aquest procés és automàtic i no una característica definidora del model MGDE." },
      { "text": "C. La forma en què s'han d'informar les metadades dels documents i expedients serà la que determini l'anàlisi documental de la sèrie documental corresponent a les queixes per soroll.", "isCorrect": true, "rationale": "El MGDE estableix que les metadades s’han d’ajustar a l’anàlisi documental de la sèrie específica." },
      { "text": "D. Tots els documents de l'expedient tindran una metadada que recull l'identificador únic de l'expedient, però es pot substituir per l'identificador d'expedient propi del tràmit de queixes.", "isCorrect": false, "rationale": "L'identificador únic no es pot substituir, és fix i garanteix la traçabilitat." }
    ],
    "hint": "L’anàlisi documental de cada sèrie determina quines metadades s’apliquen."
  },
  {
    "guid": "fb93367b-9a68-4a93-9a0e-351bd8eac8e1",
    "subjectId": "T15",
    "difficulty": 2,
    "origin": "OPOS23_preguntes_practic.pdf",
    "type": "opos23",
    "question": "17. Al fer un tràmit es crea un expedient electrònic. [...] Quina d'aquestes característiques haurien de tenir per complir amb el MGDE (model de gestió documental electrònic)?",
    "answerOptions": [
      { "text": "A. En aquest cas, en el grup de metadades de gestió obligatòriament s'ha d'incloure el districte i la parcel·la.", "isCorrect": false, "rationale": "Aquestes metadades són específiques d’un cas concret, no del model MGDE." },
      { "text": "B. La forma en què s'han d'informar les metadades dels documents i expedients serà la que determini l'anàlisi documental de la sèrie documental corresponent a la tramitació administrativa per la cessió d'horts urbans.", "isCorrect": true, "rationale": "El MGDE estableix l’anàlisi documental com a base per definir metadades." },
      { "text": "C. Tots els documents de l'expedient tindran una metadada que recull l'identificador únic de de la persona.", "isCorrect": false, "rationale": "L’identificador únic pertany a l’expedient, no a la persona." },
      { "text": "D. Les metadades de les dades de registre no s'han de complimentar automàticament.", "isCorrect": false, "rationale": "Les dades de registre es generen automàticament segons el model." }
    ],
    "hint": "Recorda que l’anàlisi documental defineix les metadades aplicables a cada sèrie."
  },
  {
    "guid": "7a74fdb2-21ce-4e61-a9ab-4f03db037849",
    "subjectId": "T15",
    "difficulty": 1,
    "origin": "OPOS23_preguntes_practic.pdf",
    "type": "opos23",
    "question": "26. Quina de les següents propostes correspon a una solució de gestió documental actualment en el mercat?",
    "answerOptions": [
      { "text": "A. La que té per objectiu la planificació, la creació, la captura, l’ús, l’organització, el tractament i l’avaluació dels documents generats o rebuts per un organisme en l’exercici de les seves funcions.", "isCorrect": true, "rationale": "Aquesta és la definició normativa d’un sistema de gestió documental complet." },
      { "text": "B. Una aplicació web que permet la creació, administració i publicació de contingut en una pàgina web.", "isCorrect": false, "rationale": "Aquesta descripció correspon a un gestor de continguts (CMS), no a un gestor documental." },
      { "text": "C. Una tecnologia usada per capturar, gestionar i emmagatzemar sense preservar contingut ni documents relacionats amb processos de negoci.", "isCorrect": false, "rationale": "El sistema de gestió documental inclou també preservació i gestió del cicle de vida." },
      { "text": "D. Un sistema de gestió documental ens ha de permetre tenir controlada la documentació sempre.", "isCorrect": false, "rationale": "Aquesta opció és massa genèrica i no defineix una solució de mercat." }
    ],
    "hint": "Busca la definició que cobreixi tot el cicle de vida documental."
  }
]
