[
  {
    "guid": "a23f53a1-9c27-4c56-920b-3b8f82b6a3d7",
    "subjectId": "T16",
    "difficulty": 1,
    "origin": "OPOS21_preguntes_especific.pdf",
    "type": "opos21",
    "question": "Un dels formats habituals per emmagatzemar informació cartogràfica és el KML (Keyhole Markup Language). Quina de les següents afirmacions relatives al KML és FALSA?",
    "answerOptions": [
      {
        "text": "A. Està especialment indicat per a la informació raster.",
        "isCorrect": true,
        "rationale": "El format KML és un llenguatge basat en XML dissenyat per representar informació geogràfica vectorial (punts, línies, polígons), no imatges ràster."
      },
      {
        "text": "B. Està especialment indicat per a informació vectorial.",
        "isCorrect": false,
        "rationale": "Aquesta afirmació és correcta: el KML s'utilitza per descriure dades vectorials i permet representar punts, línies i polígons geogràfics."
      },
      {
        "text": "C. Es tracta d’un format de fitxer de text, editable.",
        "isCorrect": false,
        "rationale": "El KML és un fitxer de text estructurat segons XML i pot editar-se amb qualsevol editor de text."
      },
      {
        "text": "D. S’utilitza per superposar informacions geogràfiques sobre mapes internet.",
        "isCorrect": false,
        "rationale": "També és correcte: KML és àmpliament utilitzat per superposar capes de dades en visors com Google Earth o Google Maps."
      }
    ],
    "hint": "Recorda que el KML és vectorial, no ràster, i s'utilitza per mostrar punts, línies o polígons sobre mapes."
  },
  {
    "guid": "e99db7f2-5b5c-45da-a245-3c09d4f15ab1",
    "subjectId": "T16",
    "difficulty": 2,
    "origin": "OPOS21_preguntes_practic.pdf",
    "type": "opos21",
    "question": "Es vol permetre que la ciutadania pugui descarregar informació sobre el soroll a la ciutat. Si aquestes dades incorporen geometries (punts, polígons...) a fi de poder ser utilitzades posteriorment en Sistemes d'Informació Geogràfics, quin d'aquests formats NO seria adequat?",
    "answerOptions": [
      {
        "text": "A. GeoJSON",
        "isCorrect": false,
        "rationale": "GeoJSON és un format obert basat en JSON per representar dades geogràfiques vectorials, molt adequat per a GIS."
      },
      {
        "text": "B. MKV",
        "isCorrect": true,
        "rationale": "MKV és un contenidor multimèdia de vídeo, no un format geoespacial; per tant, no és adequat per a dades SIG."
      },
      {
        "text": "C. KMZ",
        "isCorrect": false,
        "rationale": "KMZ és la versió comprimida de KML i és perfectament compatible amb aplicacions de mapes com Google Earth."
      },
      {
        "text": "D. GeoPackage",
        "isCorrect": false,
        "rationale": "GeoPackage (GPKG) és un format obert basat en SQLite per emmagatzemar dades geoespacials vectorials i ràster, totalment adequat per a GIS."
      }
    ],
    "hint": "Recorda que formats com GeoJSON, KMZ o GeoPackage són geoespacials. MKV és un contenidor de vídeo."
  }
]
