[
  {
    "guid": "b58e6a74-3ef1-45ac-9b2e-13b72cc03a6a",
    "subjectId": "T17",
    "difficulty": 2,
    "origin": "OPOS23_preguntes_practic.pdf",
    "type": "oposXX",
    "question": "La norma UNE-EN ISO 9001 “Sistemas de gestión de la calidad” és la versió oficial espanyola de la Norma Internacional ISO 9001:2015. Aquesta norma fa servir l’enfoc a:",
    "answerOptions": [
      { "text": "A. Producte.", "isCorrect": false, "rationale": "Incorrecte. L’enfoc de la ISO 9001 no és al producte sinó al procés." },
      { "text": "B. Serveis.", "isCorrect": false, "rationale": "Incorrecte. La norma és aplicable a serveis, però el seu enfoc és de processos." },
      { "text": "C. Processos.", "isCorrect": true, "rationale": "Correcte. La ISO 9001:2015 es fonamenta en l’enfocament basat en processos." },
      { "text": "D. Holístic.", "isCorrect": false, "rationale": "Incorrecte. Tot i que té una visió global, el terme normatiu és enfocament per processos." }
    ],
    "hint": "Recorda que la ISO 9001 busca millorar la qualitat mitjançant el control i millora dels processos."
  },
  {
    "guid": "5a90a8ab-d527-4b73-8de1-911fc3a5b9c5",
    "subjectId": "T17",
    "difficulty": 1,
    "origin": "OPOS23_preguntes_practic.pdf",
    "type": "oposXX",
    "question": "La norma UNE-EN ISO 9001 “Sistemas de gestión de la calidad” identifica quins són els principis de la gestió de la qualitat. Dels següents principis quin NO és un principi de la gestió de la qualitat?",
    "answerOptions": [
      { "text": "A. Lideratge.", "isCorrect": false, "rationale": "Incorrecte. El lideratge és un dels set principis fonamentals de la norma." },
      { "text": "B. Presa de decisions basat en l’evidència.", "isCorrect": false, "rationale": "Incorrecte. També és un dels principis bàsics." },
      { "text": "C. Enfoc al client.", "isCorrect": false, "rationale": "Incorrecte. És el primer dels set principis de gestió de la qualitat." },
      { "text": "D. Enfoc al servei.", "isCorrect": true, "rationale": "Correcte. El terme correcte és 'enfoc al client' i 'enfoc per processos', no 'enfoc al servei'." }
    ],
    "hint": "Revisa els set principis de la ISO 9001: enfoc al client, lideratge, participació, processos, millora contínua, decisions basades en dades i gestió de relacions."
  },
  {
    "guid": "8c17dc3e-2939-41a7-bb56-4f2e24443b3d",
    "subjectId": "T17",
    "difficulty": 3,
    "origin": "OPOS19_preguntes_practic.pdf",
    "type": "oposXX",
    "question": "És una metodologia de gestió que descriu els quatre passos essencials que s'han de dur a terme de forma sistemàtica per aconseguir la millora contínua en la gestió, que serien: Plan – Do – Check – Act.",
    "answerOptions": [
      { "text": "A. És una metodologia per establir objectius de qualitat.", "isCorrect": false, "rationale": "Incorrecte. Aquesta descripció no correspon al cicle PDCA." },
      { "text": "B. És una metodologia de gestió que descriu els quatre passos essencials que s'han de dur a terme de forma sistemàtica per aconseguir la millora contínua en la gestió, que serien: Plan – Do – Check – Act.", "isCorrect": true, "rationale": "Correcte. Es tracta del cicle de Deming (PDCA), base de la millora contínua de la ISO 9001." },
      { "text": "C. És una metodologia de gestió que descriu els quatre àmbits de l’organització que cal avaluar per aconseguir la millora contínua: Debilitats, Amenaces, Fortaleses i Oportunitats.", "isCorrect": false, "rationale": "Incorrecte. Això correspon a una anàlisi DAFO." },
      { "text": "D. Consisteix en una seqüència lògica d’etapes per dur a terme una anàlisi comparativa amb altres empreses del sector.", "isCorrect": false, "rationale": "Incorrecte. Això descriu el 'benchmarking'." }
    ],
    "hint": "El cicle PDCA (Plan–Do–Check–Act) és fonamental per entendre la ISO 9001."
  },
  {
    "guid": "4f97b2e5-8c7c-47f3-8d2a-3e87ebf6cf43",
    "subjectId": "T17",
    "difficulty": 2,
    "origin": "OPOS19_preguntes_practic.pdf",
    "type": "oposXX",
    "question": "En aquesta necessitat d’establir fites i objectius de millora, et demanen abordar la responsabilitat de gestió respecte a la qualitat seguint la trilogia de Juran. En què consisteix aquesta?",
    "answerOptions": [
      { "text": "A. Representa la relació entre la planificació de la qualitat, el control de la qualitat i la millora de la qualitat sobre un principi bàsic centrat en la successió de projectes.", "isCorrect": true, "rationale": "Correcte. La trilogia de Juran estableix la planificació, control i millora com a eixos de la gestió de la qualitat." },
      { "text": "B. Representa la relació entre la planificació de la qualitat, la implantació de la qualitat i la millora de la qualitat sobre un principi bàsic centrat en la successió de projectes.", "isCorrect": false, "rationale": "Incorrecte. Juran parla de control, no d'implantació." },
      { "text": "C. Representa la relació entre la planificació de la qualitat, la implantació de la qualitat i el control de la qualitat sobre un principi bàsic centrat en la successió de projectes.", "isCorrect": false, "rationale": "Incorrecte. Canvia l’ordre dels conceptes clau de Juran." },
      { "text": "D. Representa la relació entre el control de la qualitat, la implantació de la qualitat i la millora de la qualitat sobre un principi bàsic centrat en la successió de projectes.", "isCorrect": false, "rationale": "Incorrecte. La trilogia sempre comença amb la planificació." }
    ],
    "hint": "Recorda: Juran proposa la 'trilogia de la qualitat': planificació, control i millora contínua."
  },


  {
    "guid": "6e69c3fc-d200-47b3-b1e7-451ed266623d",
    "subjectId": "T17",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "Según la estructura de la norma ISO 9001:2015, ¿qué cláusula se asocia principalmente con la fase \"Check\" (Verificar) del ciclo PDCA?",
    "answerOptions": [
      {
        "text": "Cláusula 6: Planificación",
        "isCorrect": false,
        "rationale": "Esta cláusula corresponde a la fase 'Plan' (Planificar) del ciclo, donde se establecen los objetivos y se planifican las acciones para conseguirlos."
      },
      {
        "text": "Cláusula 8: Operación",
        "isCorrect": false,
        "rationale": "Esta cláusula se alinea con la fase 'Do' (Hacer) del ciclo, ya que se refiere a la implementación y ejecución de los procesos planificados."
      },
      {
        "text": "Cláusula 9: Evaluación del rendimiento",
        "isCorrect": true,
        "rationale": "Esta cláusula se enfoca en el seguimiento, medición, análisis y evaluación de los procesos y resultados, lo que se corresponde directamente con la fase 'Check' (Verificar)."
      },
      {
        "text": "Cláusula 10: Mejora",
        "isCorrect": false,
        "rationale": "Esta cláusula representa la fase 'Act' (Actuar) del ciclo, donde se toman acciones para mejorar el rendimiento a partir de los resultados de la verificación."
      }
    ],
    "hint": "Esta fase del ciclo se centra en monitorizar y medir los resultados para compararlos con los objetivos."
  },
  {
    "guid": "05722f1b-b728-449d-b981-d5b4164ce4a6",
    "subjectId": "T17",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "Un objetivo de calidad definido como \"Mejorar la reputación de la empresa\" no cumple completamente con los criterios SMART. ¿Qué criterio es el más evidentemente deficiente en esta definición?",
    "answerOptions": [
      {
        "text": "Relevante (Relevant)",
        "isCorrect": false,
        "rationale": "Mejorar la reputación probablemente está alineado con los objetivos estratégicos de la organización, por lo que se podría considerar relevante."
      },
      {
        "text": "Alcanzable (Achievable)",
        "isCorrect": false,
        "rationale": "No se puede determinar si es alcanzable sin más información, pero la principal debilidad del objetivo reside en su falta de concreción."
      },
      {
        "text": "Específico (Specific)",
        "isCorrect": false,
        "rationale": "Aunque es algo genérico, el principal problema no es la falta de especificidad, sino la incapacidad de saber si se ha logrado y cuándo."
      },
      {
        "text": "Medible (Measurable)",
        "isCorrect": true,
        "rationale": "La 'reputación' es un concepto abstracto; el objetivo carece de indicadores cuantificables para poder evaluar si se ha alcanzado la mejora."
      }
    ],
    "hint": "Piensa en cómo podrías demostrar con datos que has alcanzado este objetivo."
  },
  {
    "guid": "c553df08-d282-4b2a-9c4f-62f2ceb25bcd",
    "subjectId": "T17",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "Dentro de la estructura del Anexo SL de la norma ISO 9001, ¿en qué cláusula se establecen los requisitos para la competencia del personal y la toma de conciencia?",
    "answerOptions": [
      {
        "text": "Cláusula 4: Contexto de la organización",
        "isCorrect": false,
        "rationale": "La cláusula 4 se centra en comprender la organización, su entorno, y las necesidades de las partes interesadas, no en los recursos humanos."
      },
      {
        "text": "Cláusula 5: Liderazgo",
        "isCorrect": false,
        "rationale": "La cláusula 5 trata del compromiso de la dirección, la política de calidad y la asignación de roles y responsabilidades."
      },
      {
        "text": "Cláusula 7: Soporte",
        "isCorrect": true,
        "rationale": "Esta cláusula agrupa todos los recursos necesarios para el SGQ, incluyendo los recursos humanos (competencia, formación, toma de conciencia), la infraestructura y la información."
      },
      {
        "text": "Cláusula 6: Planificación",
        "isCorrect": false,
        "rationale": "La cláusula 6 aborda la planificación para tratar riesgos y oportunidades y para alcanzar los objetivos de calidad."
      }
    ],
    "hint": "Considera qué elementos son necesarios para sostener y apoyar el sistema de gestión de la calidad."
  },
  {
    "guid": "c2a35a7b-c8aa-4cca-9d88-f4b96f99cbef",
    "subjectId": "T17",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "¿Cuál de los siguientes es uno de los siete principios de gestión de la calidad en los que se basa la norma ISO 9001:2015?",
    "answerOptions": [
      {
        "text": "Maximización de beneficios",
        "isCorrect": false,
        "rationale": "Aunque es un objetivo empresarial común, no es uno de los principios fundacionales de la gestión de la calidad según la norma ISO 9001."
      },
      {
        "text": "Gestión de las relaciones",
        "isCorrect": true,
        "rationale": "Este principio destaca la importancia de mantener relaciones mutuamente beneficiosas con las partes interesadas pertinentes, como los proveedores."
      },
      {
        "text": "Enfoque al producto",
        "isCorrect": false,
        "rationale": "La norma utiliza un 'enfoque basado en procesos' para gestionar las actividades, no se centra exclusivamente en el producto final."
      },
      {
        "text": "Innovación tecnológica disruptiva",
        "isCorrect": false,
        "rationale": "La innovación puede ser un resultado de la mejora continua, pero no es en sí misma uno de los siete principios básicos de la gestión de la calidad."
      }
    ],
    "hint": "Este principio se enfoca en la interacción de la organización con sus socios y proveedores."
  },
  {
    "guid": "5279741b-b3d3-4269-a2e9-65a94c481252",
    "subjectId": "T17",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "¿Cuál es el objetivo principal del \"enfoque basado en riesgos\" que promueve la norma ISO 9001:2015?",
    "answerOptions": [
      {
        "text": "Eliminar por completo todos los posibles fallos en los procesos operativos.",
        "isCorrect": false,
        "rationale": "La eliminación total del riesgo es a menudo imposible; el enfoque se centra en gestionar y mitigar los riesgos de forma proactiva."
      },
      {
        "text": "Documentar cada riesgo potencial en un manual de calidad obligatorio.",
        "isCorrect": false,
        "rationale": "La norma es flexible con la documentación y no exige un manual de calidad; el énfasis está en la acción preventiva, no solo en el registro."
      },
      {
        "text": "Identificar y abordar proactivamente las amenazas y oportunidades.",
        "isCorrect": true,
        "rationale": "Este enfoque busca que la organización actúe de forma preventiva para minimizar los efectos negativos (riesgos) y maximizar los positivos (oportunidades)."
      },
      {
        "text": "Transferir la responsabilidad de los riesgos a auditores externos.",
        "isCorrect": false,
        "rationale": "La organización es siempre la responsable de gestionar sus riesgos; los auditores evalúan la eficacia de dicha gestión."
      }
    ],
    "hint": "Piensa en la diferencia entre reaccionar a los problemas y anticiparse a ellos."
  },
  {
    "guid": "b3646496-ca6e-4081-891e-e6ed06634a3c",
    "subjectId": "T17",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "Un cambio significativo en la versión ISO 9001:2015 es el concepto de \"información documentada\". ¿Qué implica este cambio en la práctica?",
    "answerOptions": [
      {
        "text": "Aumenta el número de documentos y registros obligatorios que la organización debe mantener.",
        "isCorrect": false,
        "rationale": "Al contrario, elimina la lista prescriptiva de procedimientos obligatorios, dando más libertad a la organización para definir lo que necesita."
      },
      {
        "text": "Ofrece mayor flexibilidad, permitiendo a la organización definir qué documentación necesita y en qué formato.",
        "isCorrect": true,
        "rationale": "Este concepto sustituye los términos 'documento' y 'registro' y elimina la exigencia de tener un 'manual de calidad', adaptándose a las necesidades de cada organización."
      },
      {
        "text": "Requiere que toda la documentación del sistema de gestión esté en formato exclusivamente digital.",
        "isCorrect": false,
        "rationale": "La norma no prescribe el formato; la información documentada puede estar en cualquier medio que la organización considere apropiado."
      },
      {
        "text": "Exige que se utilice un único mapa de procesos estandarizado por ISO.",
        "isCorrect": false,
        "rationale": "El mapa de procesos es una herramienta útil pero no estandarizada por ISO; cada organización debe crear el suyo si lo considera necesario."
      }
    ],
    "hint": "La versión actual se enfoca menos en la burocracia prescriptiva y más en la adaptación a cada organización."
  },
  {
    "guid": "79b67b74-76cc-4bb3-a3a3-294763049c1c",
    "subjectId": "T17",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "Cuando una organización combina los requisitos de la norma ISO 9001 (Calidad) con los de otras normas como ISO 14001 (Medio Ambiente), ¿cómo se denomina comúnmente a esta estructura unificada?",
    "answerOptions": [
      {
        "text": "Sistema de Calidad Total (TQM)",
        "isCorrect": false,
        "rationale": "TQM es una filosofía de gestión más amplia y no se refiere específicamente a la combinación de normas ISO certificables."
      },
      {
        "text": "Marco de Mejora Continua (MMC)",
        "isCorrect": false,
        "rationale": "Este es un término genérico que describe un concepto presente en muchas metodologías, pero no es el nombre específico para la combinación de normas."
      },
      {
        "text": "Sistema de Gestión Integrado (SGI)",
        "isCorrect": true,
        "rationale": "Este es el término estándar utilizado cuando múltiples sistemas de gestión basados en normas ISO se integran en un único marco dentro de una organización."
      },
      {
        "text": "Protocolo de Cumplimiento Holístico (PCH)",
        "isCorrect": false,
        "rationale": "Este término no es estándar en el contexto de las normas ISO y es demasiado genérico para describir la integración de sistemas de gestión."
      }
    ],
    "hint": "El nombre refleja la unión de diferentes sistemas de gestión en una única estructura, facilitada por la estructura común del Anexo SL."
  },
  {
    "guid": "64e188c1-e84a-4f02-a443-b69b9350d18d",
    "subjectId": "T17",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "¿Qué actividad es un requisito fundamental dentro de la Cláusula 10 \"Mejora\" de la norma ISO 9001:2015?",
    "answerOptions": [
      {
        "text": "La realización de auditorías internas.",
        "isCorrect": false,
        "rationale": "Las auditorías internas son una herramienta de evaluación y, por lo tanto, son un requisito de la Cláusula 9: Evaluación del rendimiento."
      },
      {
        "text": "La definición de la política de calidad.",
        "isCorrect": false,
        "rationale": "Establecer la política de calidad es una responsabilidad clave del liderazgo, cubierta en la Cláusula 5: Liderazgo."
      },
      {
        "text": "La gestión de no conformidades y la implementación de acciones correctivas.",
        "isCorrect": true,
        "rationale": "La Cláusula 10 se centra en reaccionar a los problemas (no conformidades) para corregirlos, evitar su recurrencia y buscar oportunidades de mejora continua."
      },
      {
        "text": "La determinación del alcance del Sistema de Gestión de la Calidad.",
        "isCorrect": false,
        "rationale": "Definir el alcance del SGQ es uno de los primeros pasos y se encuentra en la Cláusula 4: Contexto de la organización."
      }
    ],
    "hint": "Esta cláusula se enfoca en cómo la organización reacciona cuando algo sale mal para evitar que vuelva a ocurrir."
  },
  {
    "guid": "faf8edfd-207e-4500-9004-6c8a56acd357",
    "subjectId": "T17",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "Según la información proporcionada, ¿cuál es la relación entre el temario de OPOS 24 sobre ISO 9001 y el de la convocatoria anterior, OPOS 23?",
    "answerOptions": [
      {
        "text": "El contenido de ISO 9001 ya formaba parte del Tema 58 de OPOS 23, donde se trataba junto con ISO 20000.",
        "isCorrect": true,
        "rationale": "El texto indica que el Tema 17 (OPOS 24) se corresponde directamente con parte del Tema 58 de la convocatoria anterior (OPOS 23)."
      },
      {
        "text": "En OPOS 23, ISO 9001 era un tema independiente, y en OPOS 24 se ha fusionado con ISO 20000.",
        "isCorrect": false,
        "rationale": "La relación descrita es la inversa; en la convocatoria anterior estaban juntas y ahora ISO 9001 se trata de forma más específica."
      },
      {
        "text": "El Tema 17 de OPOS 24 es completamente nuevo y no tiene relación con el temario de OPOS 23.",
        "isCorrect": false,
        "rationale": "La fuente afirma explícitamente que hay una correspondencia directa con el contenido de la convocatoria anterior."
      },
      {
        "text": "ISO 9001 en OPOS 24 sustituye completamente a ISO 20000, que se trataba en OPOS 23.",
        "isCorrect": false,
        "rationale": "El texto no sugiere una sustitución, sino una reorganización del temario donde ambas normas se trataban juntas anteriormente."
      }
    ],
    "hint": "Revisa la sección \"Dades informatives\" para ver cómo se agrupaban las normas de calidad en la convocatoria previa."
  },
  {
    "guid": "4beebe9b-164c-4516-bb33-0d24e7990618",
    "subjectId": "T17",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "La norma ISO 9001:2015 está diseñada para ser genérica y universal. Esto significa que puede ser aplicada por...",
    "answerOptions": [
      {
        "text": "Únicamente grandes empresas de manufactura que exportan sus productos.",
        "isCorrect": false,
        "rationale": "Esta es una idea errónea común; la norma es aplicable a cualquier tipo y tamaño de empresa, no solo a las de manufactura."
      },
      {
        "text": "Exclusivamente organizaciones del sector público y administraciones para mejorar el servicio ciudadano.",
        "isCorrect": false,
        "rationale": "Aunque es muy útil para el sector público, su aplicación no se limita a este, siendo igualmente válida para el sector privado."
      },
      {
        "text": "Cualquier organización, sin importar su tamaño, sector o si ofrece productos o servicios.",
        "isCorrect": true,
        "rationale": "La universalidad es una característica clave de la norma, diseñada para que sus principios de gestión de la calidad puedan adaptarse a cualquier contexto."
      },
      {
        "text": "Solo a empresas de tecnología, ya que se integra bien con marcos como ITIL y CMMI.",
        "isCorrect": false,
        "rationale": "Su compatibilidad con marcos de TI es una ventaja, pero su campo de aplicación es mucho más amplio y abarca todos los sectores."
      }
    ],
    "hint": "Uno de los puntos fuertes de esta norma internacional es su capacidad de adaptación a diferentes contextos."
  },


  {
    "guid": "b6c7c75a-3073-4107-9d17-4634bb3b5b74",
    "subjectId": "T17",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Segons la font, quina és la relació entre el Tema 17 de les OPOS 24 i el temari de les OPOS 23?",
    "answerOptions": [
      {
        "text": "El Tema 17 de OPOS 24 és completament nou i no té relació amb temaris anteriors.",
        "isCorrect": false,
        "rationale": "El text especifica que hi ha una correspondència directa amb la convocatòria anterior."
      },
      {
        "text": "El contingut d'ISO 9001 del Tema 17 de OPOS 24 formava part del Tema 58 de OPOS 23, juntament amb ISO 20000.",
        "isCorrect": true,
        "rationale": "El document indica explícitament que el contingut d'ISO 9001 ja es tractava al Tema 58 de la convocatòria prèvia, compartint tema amb ISO 20000."
      },
      {
        "text": "El Tema 17 de OPOS 24 substitueix completament el Tema 58 de OPOS 23, eliminant ISO 20000.",
        "isCorrect": false,
        "rationale": "Si bé ara es tracta per separat, no substitueix el tema anterior, sinó que se n'extreu una part específica."
      },
      {
        "text": "El Tema 17 de OPOS 24 és un resum del Tema 58 de OPOS 23, tractant només els aspectes més bàsics.",
        "isCorrect": false,
        "rationale": "El text no suggereix que sigui un resum, sinó que el contingut d'ISO 9001 es correspon directament, indicant una cobertura completa."
      }
    ],
    "hint": "Revisa la secció 'Dades informatives' per entendre com es connecten les dues convocatòries d'oposicions."
  },
  {
    "guid": "0f14d8c7-090d-4254-926b-0401130ea898",
    "subjectId": "T17",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Quin dels següents NO és un dels set principis de gestió de la qualitat segons la norma ISO 9001:2015?",
    "answerOptions": [
      {
        "text": "Lideratge",
        "isCorrect": false,
        "rationale": "El lideratge és un pilar fonamental per establir la direcció i la cultura de qualitat en una organització."
      },
      {
        "text": "Reducció de costos",
        "isCorrect": true,
        "rationale": "Encara que la reducció de costos pot ser un benefici, no és un dels principis fonamentals de la gestió de la qualitat en si mateix."
      },
      {
        "text": "Presa de decisions basada en evidències",
        "isCorrect": false,
        "rationale": "Aquest principi emfatitza la importància d'utilitzar dades i anàlisis per prendre decisions informades."
      },
      {
        "text": "Gestió de les relacions",
        "isCorrect": false,
        "rationale": "Gestionar les relacions amb les parts interessades, com els proveïdors, és clau per a l'èxit sostingut."
      }
    ],
    "hint": "Pensa en els conceptes fonamentals que guien un Sistema de Gestió de la Qualitat, no en els resultats que pot produir."
  },
  {
    "guid": "7823c2ed-e982-4a7e-bce7-9d6b215a8989",
    "subjectId": "T17",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "L'estructura d'alt nivell comuna a totes les normes de sistemes de gestió ISO, com la ISO 9001:2015, es coneix com a:",
    "answerOptions": [
      {
        "text": "Cicle PDCA",
        "isCorrect": false,
        "rationale": "El cicle PDCA descriu la metodologia de millora contínua sobre la qual s'estructura la norma, però no és el nom de l'estructura de clàusules en si."
      },
      {
        "text": "Annex SL",
        "isCorrect": true,
        "rationale": "L'Annex SL defineix l'estructura comuna de 10 clàusules, terminologia i definicions per a totes les noves normes de sistemes de gestió ISO."
      },
      {
        "text": "Manual de Qualitat",
        "isCorrect": false,
        "rationale": "El manual de qualitat era un document exigit en versions anteriors de la norma, però no defineix l'estructura de la norma actual."
      },
      {
        "text": "Mapa de Processos",
        "isCorrect": false,
        "rationale": "El mapa de processos és una eina per visualitzar els processos de l'organització, no l'esquema de la norma."
      }
    ],
    "hint": "Busca el terme que fa referència a l'esquema comú que facilita la integració de diferents sistemes de gestió."
  },
  {
    "guid": "8f9caf13-e81f-47fe-9866-fd701f795eae",
    "subjectId": "T17",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Dins de l'estructura de la norma ISO 9001:2015, a quina clàusula pertany la definició de l'abast del Sistema de Gestió de la Qualitat (SGQ)?",
    "answerOptions": [
      {
        "text": "Clàusula 5: Lideratge",
        "isCorrect": false,
        "rationale": "La clàusula de Lideratge se centra en el compromís de la direcció i la política de qualitat, no en la definició de l'abast."
      },
      {
        "text": "Clàusula 6: Planificació",
        "isCorrect": false,
        "rationale": "La planificació tracta els riscos, oportunitats i objectius un cop l'abast ja ha estat definit."
      },
      {
        "text": "Clàusula 4: Context de l’organització",
        "isCorrect": true,
        "rationale": "Aquesta clàusula requereix entendre l'organització, les parts interessades i, conseqüentment, definir els límits i l'aplicabilitat del SGQ."
      },
      {
        "text": "Clàusula 8: Operació",
        "isCorrect": false,
        "rationale": "L'operació es refereix a l'execució dels processos per lliurar productes i serveis, la qual cosa passa dins de l'abast ja establert."
      }
    ],
    "hint": "Pensa en el primer pas necessari abans de poder planificar o executar els processos del sistema."
  },
  {
    "guid": "ba958b76-c896-4ab6-99f5-cfe73810373b",
    "subjectId": "T17",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Què caracteritza principalment l'enfocament de la documentació a la versió ISO 9001:2015 en comparació amb versions anteriors?",
    "answerOptions": [
      {
        "text": "Exigeix un manual de qualitat més extens i detallat.",
        "isCorrect": false,
        "rationale": "La versió de 2015 precisament elimina l'obligatorietat d'un manual de qualitat específic."
      },
      {
        "text": "Introdueix el concepte d'\"informació documentada\" que és més flexible.",
        "isCorrect": true,
        "rationale": "Aquest concepte substitueix els termes 'document' i 'registre', permetent a l'organització definir el format i la quantitat de documentació necessària."
      },
      {
        "text": "Requereix que tota la documentació estigui en format digital.",
        "isCorrect": false,
        "rationale": "La norma no especifica el format (digital o físic), només que la informació ha d'estar controlada."
      },
      {
        "text": "Elimina per complet la necessitat de documentar processos.",
        "isCorrect": false,
        "rationale": "Encara que és més flexible, la norma segueix requerint documentar la informació necessària per a l'eficàcia del SGQ."
      }
    ],
    "hint": "Considera com la norma s'ha adaptat per ser menys prescriptiva i més adaptable a diferents tipus d'organitzacions."
  },
  {
    "guid": "f7d981fd-3167-46d5-9a69-df586afe3726",
    "subjectId": "T17",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Quin dels següents objectius de qualitat està formulat correctament segons els criteris SMART?",
    "answerOptions": [
      {
        "text": "Millorar la qualitat dels nostres serveis de TI.",
        "isCorrect": false,
        "rationale": "Aquest objectiu no és específic, ni mesurable, ni té un termini definit."
      },
      {
        "text": "Formar a tot el personal tècnic en noves tecnologies.",
        "isCorrect": false,
        "rationale": "Encara que és més concret, li falta un indicador mesurable i un termini clar."
      },
      {
        "text": "Reduir el temps de resposta a les incidències dels usuaris un 15% durant el pròxim trimestre.",
        "isCorrect": true,
        "rationale": "Aquest objectiu és Específic (temps de resposta), Mesurable (15%), Assolible (pressumiblement), Rellevant (millora servei) i amb un Termini (pròxim trimestre)."
      },
      {
        "text": "Aconseguir la màxima satisfacció possible dels ciutadans.",
        "isCorrect": false,
        "rationale": "El terme 'màxima possible' no és mesurable, la qual cosa incompleix un dels criteris clau de SMART."
      }
    ],
    "hint": "Analitza cada opció buscant si compleix amb les cinc lletres de l'acrònim: Específic, Mesurable, Assolible, Rellevant i amb Termini."
  },
  {
    "guid": "812bb488-1f42-486e-ad2e-064b44525414",
    "subjectId": "T17",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "La relació entre el cicle PDCA (Planificar, Fer, Verificar, Actuar) i l'estructura de la norma ISO 9001:2015 és que:",
    "answerOptions": [
      {
        "text": "El PDCA només s'aplica a la clàusula 10 'Millora'.",
        "isCorrect": false,
        "rationale": "La millora correspon a la fase 'Actuar', però el cicle PDCA engloba moltes més clàusules de la norma."
      },
      {
        "text": "És una eina opcional que les empreses poden decidir no utilitzar.",
        "isCorrect": false,
        "rationale": "La pròpia estructura de la norma està fonamentada en aquest cicle, fent-lo intrínsec al seu funcionament."
      },
      {
        "text": "Totes les clàusules de requisits (4-10) s'alineen amb les fases del cicle PDCA.",
        "isCorrect": true,
        "rationale": "La norma està dissenyada de manera que les clàusules de Planificació (6), Suport i Operació (7, 8), Avaluació (9) i Millora (10) reflecteixen el cicle PDCA."
      },
      {
        "text": "El PDCA va ser substituït per l'enfocament basat en riscos a la versió 2015.",
        "isCorrect": false,
        "rationale": "L'enfocament basat en riscos és un concepte clau integrat dins del cicle PDCA, no un substitut."
      }
    ],
    "hint": "Pensa en com la seqüència de les clàusules de la norma reflecteix un cicle lògic de gestió i millora."
  },
  {
    "guid": "286b495c-7417-48dc-bc69-0ada065b2896",
    "subjectId": "T17",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Quin és un dels principals beneficis d'implementar ISO 9001 per a una empresa que vol treballar amb l'Administració Pública?",
    "answerOptions": [
      {
        "text": "Garanteix l'obtenció de beneficis econòmics el primer any.",
        "isCorrect": false,
        "rationale": "La norma millora l'eficiència, però no garanteix beneficis econòmics directes en un termini fix."
      },
      {
        "text": "Permet accedir a licitacions públiques que exigeixen aquesta certificació.",
        "isCorrect": true,
        "rationale": "El text menciona explícitament que moltes licitacions públiques requereixen la certificació ISO 9001 com a requisit."
      },
      {
        "text": "Redueix la càrrega fiscal de l'empresa.",
        "isCorrect": false,
        "rationale": "La certificació ISO 9001 no té cap impacte directe sobre les obligacions fiscals d'una organització."
      },
      {
        "text": "Automatitza completament la gestió de la qualitat.",
        "isCorrect": false,
        "rationale": "ISO 9001 estableix un sistema de gestió, però la seva execució requereix la participació de persones i no s'automatitza completament."
      }
    ],
    "hint": "Considera els requisits que solen aparèixer en els contractes amb el sector públic per assegurar la qualitat dels proveïdors."
  },
  {
    "guid": "e843daa1-5bfd-4997-8810-d5c18fd0ef4b",
    "subjectId": "T17",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "La gestió de la \"competència, formació i presa de consciència\" del personal es tracta principalment a la clàusula:",
    "answerOptions": [
      {
        "text": "Clàusula 5: Lideratge",
        "isCorrect": false,
        "rationale": "El lideratge estableix els rols i responsabilitats, però la gestió de les competències específiques es troba en una altra clàusula."
      },
      {
        "text": "Clàusula 4: Context de l'organització",
        "isCorrect": false,
        "rationale": "El context se centra en l'entorn de l'organització i les parts interessades, no en els recursos interns com el personal."
      },
      {
        "text": "Clàusula 8: Operació",
        "isCorrect": false,
        "rationale": "L'operació utilitza personal competent, però els requisits per assegurar aquesta competència es defineixen en una clàusula prèvia."
      },
      {
        "text": "Clàusula 7: Suport",
        "isCorrect": true,
        "rationale": "Aquesta clàusula agrupa tots els recursos necessaris per al SGQ, incloent-hi els recursos humans, la seva competència, la comunicació i la informació documentada."
      }
    ],
    "hint": "Pensa en quina secció de la norma s'agrupen tots els recursos i l'entorn necessari per fer funcionar el sistema."
  },
  {
    "guid": "3c93cbbf-c601-42bd-ad39-2e3f49709618",
    "subjectId": "T17",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "L'\"enfocament basat en riscos\" a ISO 9001:2015 implica principalment:",
    "answerOptions": [
      {
        "text": "Eliminar tots els riscos possibles de l'organització abans de certificar-se.",
        "isCorrect": false,
        "rationale": "L'objectiu no és eliminar tots els riscos, la qual cosa és impossible, sinó identificar-los i gestionar-los adequadament."
      },
      {
        "text": "Identificar i abordar riscos i oportunitats per assegurar que el SGQ assoleixi els seus objectius.",
        "isCorrect": true,
        "rationale": "Aquest enfocament és preventiu i busca anticipar problemes i aprofitar oportunitats per millorar els resultats."
      },
      {
        "text": "Contractar una assegurança per a cada procés de l'organització.",
        "isCorrect": false,
        "rationale": "La gestió de riscos en el context d'ISO 9001 és més àmplia que la simple transferència del risc mitjançant assegurances."
      },
      {
        "text": "Realitzar auditories només a les àrees considerades d'alt risc.",
        "isCorrect": false,
        "rationale": "Les auditories internes han de cobrir tot l'abast del SGQ, encara que la seva freqüència o profunditat pugui variar segons el risc."
      }
    ],
    "hint": "Aquest concepte clau no només es fixa en els problemes, sinó també en els aspectes positius que es poden potenciar."
  },
  {
    "guid": "f88f2eb7-68ad-4589-81aa-428819002502",
    "subjectId": "T17",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Quina activitat és fonamental dins de la clàusula 9 'Avaluació del rendiment'?",
    "answerOptions": [
      {
        "text": "Planificació dels canvis al SGQ.",
        "isCorrect": false,
        "rationale": "La planificació dels canvis és part de la clàusula 6 'Planificació'."
      },
      {
        "text": "Control dels proveïdors externs.",
        "isCorrect": false,
        "rationale": "El control dels processos externs forma part de la clàusula 8 'Operació'."
      },
      {
        "text": "Realització d'auditories internes.",
        "isCorrect": true,
        "rationale": "Les auditories internes són una eina clau per verificar sistemàticament si el SGQ funciona com s'ha planificat i és eficaç."
      },
      {
        "text": "Definició de la política de qualitat.",
        "isCorrect": false,
        "rationale": "La política de qualitat és establerta per la direcció i pertany a la clàusula 5 'Lideratge'."
      }
    ],
    "hint": "Pensa en els mecanismes que utilitza una organització per comprovar si està complint els seus propis requisits i els de la norma."
  },
  {
    "guid": "131b6d37-d244-4d39-a1b6-127df1f019ab",
    "subjectId": "T17",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Segons el text, com es pot integrar la norma ISO 9001 amb altres com ISO 27001 (Seguretat de la Informació) o ISO 14001 (Medi Ambient)?",
    "answerOptions": [
      {
        "text": "No es poden integrar, cada norma ha de tenir un sistema de gestió completament separat.",
        "isCorrect": false,
        "rationale": "El text indica que sí que es poden integrar gràcies a l'estructura comuna."
      },
      {
        "text": "Mitjançant un Sistema de Gestió Integrat (SGI).",
        "isCorrect": true,
        "rationale": "Un SGI aprofita l'estructura comuna (Annex SL) per gestionar diferents aspectes (qualitat, medi ambient, seguretat) de manera unificada i eficient."
      },
      {
        "text": "Escollint només una de les normes, ja que són excloents entre si.",
        "isCorrect": false,
        "rationale": "Les normes no són excloents; al contrari, són dissenyades per ser compatibles i complementàries."
      },
      {
        "text": "Aplicant només les clàusules comunes i ignorant les específiques de cada norma.",
        "isCorrect": false,
        "rationale": "La integració implica gestionar conjuntament els elements comuns, però sense deixar de complir els requisits específics de cada disciplina."
      }
    ],
    "hint": "Considera el concepte que permet unificar la gestió de diferents estàndards per evitar duplicitats i millorar l'eficiència."
  },
  {
    "guid": "632117d4-f9de-4edf-b701-3628cfbb8536",
    "subjectId": "T17",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "En el context de la fase \"Check\" (Verificar) del cicle PDCA, quina clàusula de la ISO 9001:2015 té el paper més rellevant?",
    "answerOptions": [
      {
        "text": "Clàusula 8: Operació",
        "isCorrect": false,
        "rationale": "La clàusula 8 correspon a la fase 'Do' (Fer), ja que és on s'executen els processos planificats."
      },
      {
        "text": "Clàusula 6: Planificació",
        "isCorrect": false,
        "rationale": "La clàusula 6 és la representació clara de la fase 'Plan' (Planificar) del cicle."
      },
      {
        "text": "Clàusula 10: Millora",
        "isCorrect": false,
        "rationale": "La clàusula 10 s'associa amb la fase 'Act' (Actuar), on es prenen accions basades en els resultats de la verificació."
      },
      {
        "text": "Clàusula 9: Avaluació del rendiment",
        "isCorrect": true,
        "rationale": "Aquesta clàusula se centra en el seguiment, mesura, anàlisi i avaluació, activitats pròpies de la fase de 'Check' (Verificar)."
      }
    ],
    "hint": "Busca la clàusula de la norma que s'enfoca en mesurar i analitzar si les coses s'estan fent segons el previst."
  },
  {
    "guid": "886d832d-0607-42eb-b83a-bb1015232cea",
    "subjectId": "T17",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Quin dels següents és considerat un repte o limitació en la implantació d'ISO 9001?",
    "answerOptions": [
      {
        "text": "La millora automàtica de la reputació de l'empresa.",
        "isCorrect": false,
        "rationale": "La millora de la reputació és un benefici, no una limitació o un repte."
      },
      {
        "text": "La possibilitat que el sistema esdevingui excessivament burocràtic.",
        "isCorrect": true,
        "rationale": "El text adverteix que si no es gestiona bé, la implementació pot portar a un excés de tràmits i paperassa innecessària."
      },
      {
        "text": "L'accés garantit a nous mercats internacionals.",
        "isCorrect": false,
        "rationale": "L'accés a nous mercats és un dels beneficis potencials, no un repte."
      },
      {
        "text": "L'obligatorietat d'utilitzar un software de gestió específic.",
        "isCorrect": false,
        "rationale": "La norma ISO 9001 no obliga a utilitzar cap eina o software concret, deixant llibertat a l'organització."
      }
    ],
    "hint": "Pensa en els aspectes negatius o les dificultats que una organització pot trobar durant el procés d'implementació i manteniment."
  },
  {
    "guid": "3eb51fdb-1f34-4008-ad58-bec16d5c0009",
    "subjectId": "T17",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Les clàusules 1, 2 i 3 de la norma ISO 9001:2015 es diferencien de les clàusules 4 a 10 perquè:",
    "answerOptions": [
      {
        "text": "Són les úniques clàusules que són auditables per a la certificació.",
        "isCorrect": false,
        "rationale": "Al contrari, les clàusules auditables i que contenen els requisits certificables són de la 4 a la 10."
      },
      {
        "text": "Tenen un caràcter introductori i informatiu, no contenen requisits certificables.",
        "isCorrect": true,
        "rationale": "Aquestes primeres clàusules defineixen l'objecte, les referències i els termes, preparant el terreny per als requisits que comencen a la clàusula 4."
      },
      {
        "text": "Només s'apliquen a empreses de serveis, mentre que les altres s'apliquen a producció.",
        "isCorrect": false,
        "rationale": "Tota la norma està dissenyada per aplicar-se a qualsevol organització, independentment del seu sector."
      },
      {
        "text": "Van ser les úniques que no van canviar respecte a la versió de 2008.",
        "isCorrect": false,
        "rationale": "Tota la norma va ser revisada i reestructurada a la versió de 2015, incloent-hi les primeres clàusules."
      }
    ],
    "hint": "Considera la funció de les primeres seccions d'un estàndard tècnic abans d'entrar en les exigències."
  },
  {
    "guid": "086da72b-9c83-4aca-b227-0dfcc99f0f79",
    "subjectId": "T17",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Una organització que analitza les seves fortaleses i debilitats internes, així com les amenaces i oportunitats externes, està treballant principalment en el que la ISO 9001 anomena:",
    "answerOptions": [
      {
        "text": "Avaluació del rendiment (Clàusula 9)",
        "isCorrect": false,
        "rationale": "L'avaluació del rendiment mesura els resultats dels processos, mentre que aquesta anàlisi és un pas previ per entendre l'entorn."
      },
      {
        "text": "Context de l'organització (Clàusula 4)",
        "isCorrect": true,
        "rationale": "La clàusula 4 requereix explícitament que l'organització determini les qüestions internes i externes pertinents per al seu propòsit estratègic."
      },
      {
        "text": "Millora (Clàusula 10)",
        "isCorrect": false,
        "rationale": "La millora actua sobre els resultats i les no conformitats detectades, no sobre l'anàlisi estratègica inicial."
      },
      {
        "text": "Lideratge (Clàusula 5)",
        "isCorrect": false,
        "rationale": "El lideratge utilitza aquesta anàlisi del context per definir la política i els objectius, però l'anàlisi en si pertany a la clàusula 4."
      }
    ],
    "hint": "Aquesta activitat és similar a una anàlisi DAFO i és fonamental per establir les bases del sistema de gestió."
  },
  {
    "guid": "8f3635bb-1897-43b5-a863-759cf99ef58b",
    "subjectId": "T17",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "En un projecte TIC per a l'Administració Pública, aplicar ISO 9001 ajudaria a assegurar:",
    "answerOptions": [
      {
        "text": "Que el projecte tingui el cost més baix possible del mercat.",
        "isCorrect": false,
        "rationale": "ISO 9001 busca l'eficiència, que pot reduir costos, però el seu objectiu principal és la qualitat i el compliment de requisits, no necessàriament el preu més baix."
      },
      {
        "text": "Que el software desenvolupat no contingui cap error.",
        "isCorrect": false,
        "rationale": "És pràcticament impossible garantir l'absència total d'errors; la norma busca gestionar la qualitat per minimitzar-los i gestionar-los adequadament."
      },
      {
        "text": "Que es compleixen els requisits en el desenvolupament i manteniment del software.",
        "isCorrect": true,
        "rationale": "L'exemple pràctic del document menciona específicament l'aplicació a projectes TIC per assegurar la qualitat en aquestes fases."
      },
      {
        "text": "Que s'utilitzi sempre la tecnologia més recent i innovadora.",
        "isCorrect": false,
        "rationale": "La norma no prescriu quina tecnologia utilitzar, sinó com gestionar els processos per assegurar la qualitat del resultat final."
      }
    ],
    "hint": "Revisa l'exemple pràctic que es dona al final del resum sobre l'aplicació de la norma en l'àmbit tecnològic."
  },
  {
    "guid": "bffcfb77-d888-402e-8557-4812e7e46f6d",
    "subjectId": "T17",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Què implica el principi de \"Participació del personal\"?",
    "answerOptions": [
      {
        "text": "Que només la direcció és responsable de la qualitat.",
        "isCorrect": false,
        "rationale": "Aquest principi sosté justament el contrari: tothom a l'organització té un paper en la qualitat."
      },
      {
        "text": "Que les persones competents i compromeses a tots els nivells són clau per crear valor.",
        "isCorrect": true,
        "rationale": "Reconeix que l'actiu més important d'una organització són les seves persones i la seva contribució és essencial."
      },
      {
        "text": "Que s'ha de contractar personal extern per a totes les auditories.",
        "isCorrect": false,
        "rationale": "Les auditories poden ser internes o externes, però aquest principi es refereix al personal propi de l'organització."
      },
      {
        "text": "Que el personal ha de seguir les instruccions sense qüestionar-les.",
        "isCorrect": false,
        "rationale": "La participació implica apoderament i compromís, fomentant que el personal aporti idees per a la millora."
      }
    ],
    "hint": "Aquest principi posa el focus en el valor que aporten els empleats a l'organització."
  },
  {
    "guid": "7d577e24-3fb2-4bd9-abe4-95c129ab50cb",
    "subjectId": "T17",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "El control de processos, productes i serveis subministrats externament (proveïdors) és un requisit de quina clàusula?",
    "answerOptions": [
      {
        "text": "Clàusula 7: Suport",
        "isCorrect": false,
        "rationale": "La clàusula de Suport proporciona els recursos, però la gestió directa de les compres i proveïdors es troba en una altra secció."
      },
      {
        "text": "Clàusula 9: Avaluació del rendiment",
        "isCorrect": false,
        "rationale": "Aquesta clàusula inclou l'avaluació del rendiment dels proveïdors, però el control operatiu de les compres és anterior."
      },
      {
        "text": "Clàusula 6: Planificació",
        "isCorrect": false,
        "rationale": "La planificació estableix els objectius, però no gestiona les transaccions operatives diàries amb tercers."
      },
      {
        "text": "Clàusula 8: Operació",
        "isCorrect": true,
        "rationale": "La clàusula d'Operació cobreix tots els aspectes de la producció i provisió del servei, incloent el control sobre els inputs provinents de proveïdors."
      }
    ],
    "hint": "Pensa on s'ubica la gestió de les activitats del dia a dia que fan possible lliurar el producte o servei."
  },
  {
    "guid": "4a64c28c-0fa7-4961-bf07-4565a7ce8b4f",
    "subjectId": "T17",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Segons el text, CMMI i ITIL són marcs de treball que es relacionen amb ISO 9001 perquè:",
    "answerOptions": [
      {
        "text": "Són versions alternatives de la norma ISO 9001 per al sector tecnològic.",
        "isCorrect": false,
        "rationale": "No són versions alternatives, sinó marcs de millors pràctiques que poden complementar i coexistir amb un SGQ basat en ISO 9001."
      },
      {
        "text": "Són obligatoris per poder obtenir la certificació ISO 9001 en empreses TIC.",
        "isCorrect": false,
        "rationale": "No són requisits obligatoris per a la certificació, sinó models de referència per a la millora."
      },
      {
        "text": "Se centren en la millora de serveis i processos, especialment en l'àmbit de TI.",
        "isCorrect": true,
        "rationale": "El document els cita com a exemples de models que, igual que ISO 9001, busquen la millora, essent CMMI més enfocat a la maduresa de processos i ITIL a la gestió de serveis de TI."
      },
      {
        "text": "Han estat reemplaçats completament per la norma ISO 20000.",
        "isCorrect": false,
        "rationale": "ISO 20000 és una norma de gestió de serveis TI, però no reemplaça ITIL (que és un marc de bones pràctiques) ni CMMI (un model de maduresa)."
      }
    ],
    "hint": "Revisa la secció 'Relació amb altres normes' i fixa't en l'especialització d'aquests dos models."
  },
  {
    "guid": "59d9d13f-a284-4a73-8c2a-e6236851f5e6",
    "subjectId": "T17",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "La \"Revisió per la direcció\" és una activitat periòdica clau que pertany a la clàusula:",
    "answerOptions": [
      {
        "text": "5: Lideratge",
        "isCorrect": false,
        "rationale": "Tot i que és la direcció qui la realitza, aquesta activitat específica de revisió forma part del procés d'avaluació, no de la definició inicial del lideratge."
      },
      {
        "text": "9: Avaluació del rendiment",
        "isCorrect": true,
        "rationale": "Aquesta clàusula inclou les tres grans activitats de verificació: seguiment i mesura, auditoria interna i la revisió per la direcció per avaluar la idoneïtat i eficàcia del SGQ."
      },
      {
        "text": "10: Millora",
        "isCorrect": false,
        "rationale": "Les decisions preses a la revisió per la direcció porten a accions de millora, però l'acte de la revisió en si és una avaluació."
      },
      {
        "text": "6: Planificació",
        "isCorrect": false,
        "rationale": "La planificació es revisa durant aquesta activitat, però la revisió com a tal és un mecanisme de control i avaluació."
      }
    ],
    "hint": "Aquesta activitat és un dels pilars de la fase de 'Verificar' (Check) del cicle PDCA, realitzada al més alt nivell de l'organització."
  },
  {
    "guid": "70e20bd3-78c2-4186-a7e1-d311374464a6",
    "subjectId": "T17",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Quina afirmació descriu millor el principi d'\"Enfocament al client\"?",
    "answerOptions": [
      {
        "text": "Donar al client sempre la raó, fins i tot si va en contra dels objectius de l'empresa.",
        "isCorrect": false,
        "rationale": "Aquest enfocament busca satisfer les necessitats del client, però de manera sostenible i alineada amb l'estratègia de l'organització."
      },
      {
        "text": "Realitzar enquestes de satisfacció un cop a l'any.",
        "isCorrect": false,
        "rationale": "Les enquestes són una eina per entendre el client, però el principi és molt més ampli i implica tota l'activitat de l'organització."
      },
      {
        "text": "Entendre les necessitats actuals i futures dels clients i esforçar-se per superar les seves expectatives.",
        "isCorrect": true,
        "rationale": "Aquest és el nucli del principi: no només complir amb el que demanen, sinó anticipar-se i buscar la seva satisfacció a llarg termini."
      },
      {
        "text": "Centrar-se únicament en els requisits especificats en el contracte amb el client.",
        "isCorrect": false,
        "rationale": "Complir els requisits contractuals és fonamental, però l'enfocament al client va més enllà, considerant també les expectatives no explícites."
      }
    ],
    "hint": "Pensa en una visió proactiva i a llarg termini de la relació amb els clients, no només en el compliment del mínim exigible."
  },
  {
    "guid": "c34f73b5-4b18-424a-831d-3beb7bfb08f1",
    "subjectId": "T17",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "El tractament de \"No conformitats i accions correctives\" és el focus principal de quin apartat de la norma?",
    "answerOptions": [
      {
        "text": "Planificació (Clàusula 6)",
        "isCorrect": false,
        "rationale": "La planificació busca prevenir problemes mitjançant l'anàlisi de riscos, però no gestiona les no conformitats un cop han ocorregut."
      },
      {
        "text": "Operació (Clàusula 8)",
        "isCorrect": false,
        "rationale": "Dins de l'operació es poden generar no conformitats, però el procés sistemàtic per tractar-les i aprendre d'elles es troba en una altra clàusula."
      },
      {
        "text": "Millora (Clàusula 10)",
        "isCorrect": true,
        "rationale": "Aquesta clàusula se centra en reaccionar davant les no conformitats per corregir-les i evitar que es repeteixin, impulsant així la millora contínua."
      },
      {
        "text": "Avaluació del rendiment (Clàusula 9)",
        "isCorrect": false,
        "rationale": "L'avaluació del rendiment (com les auditories) és on sovint es detecten les no conformitats, però la seva gestió posterior pertany a la clàusula de Millora."
      }
    ],
    "hint": "Aquesta activitat és reactiva i busca corregir errors i evitar que tornin a passar, encaixant en l'última fase del cicle de gestió."
  },
  {
    "guid": "d054e6a1-b5ff-4286-b246-17f77c115adf",
    "subjectId": "T17",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Si una empresa de disseny gràfic vol certificar-se amb ISO 9001, quina part de la clàusula 8 'Operació' seria especialment rellevant per a la seva activitat principal?",
    "answerOptions": [
      {
        "text": "Producció i provisió del servei.",
        "isCorrect": false,
        "rationale": "Encara que correcte, hi ha una secció més específica per a empreses que creen nous productes o serveis des de zero."
      },
      {
        "text": "Disseny i desenvolupament.",
        "isCorrect": true,
        "rationale": "Aquesta secció de la clàusula 8 estableix els requisits per a les organitzacions que dissenyen i desenvolupen productes o serveis, com és el cas d'una empresa de disseny."
      },
      {
        "text": "Activitats posteriors al lliurament.",
        "isCorrect": false,
        "rationale": "Això seria rellevant per a la garantia o el suport postvenda, però l'activitat central és la creació del disseny."
      },
      {
        "text": "Control de sortides no conformes.",
        "isCorrect": false,
        "rationale": "Això és important, però es refereix a la gestió d'errors, no al procés creatiu principal."
      }
    ],
    "hint": "Busca dins de la clàusula d'Operació la part que fa referència a la creació de nous productes o serveis, que sovint es pot excloure si no aplica."
  },
  {
    "guid": "ab27170d-6769-47cc-a016-d80a275b66d3",
    "subjectId": "T17",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Quin organisme publica la norma ISO 9001?",
    "answerOptions": [
      {
        "text": "AENOR (Asociación Española de Normalización y Certificación)",
        "isCorrect": false,
        "rationale": "AENOR és l'organisme de normalització a Espanya i publica les versions UNE de les normes ISO, però no és l'organisme internacional original."
      },
      {
        "text": "CEN (Comitè Europeu de Normalització)",
        "isCorrect": false,
        "rationale": "CEN és l'organisme de normalització a nivell europeu, no mundial."
      },
      {
        "text": "ISO (International Organization for Standardization)",
        "isCorrect": true,
        "rationale": "El resum GPT indica clarament que la norma és publicada per l'ISO, que és l'organisme internacional de normalització."
      },
      {
        "text": "ITIL (Information Technology Infrastructure Library)",
        "isCorrect": false,
        "rationale": "ITIL és un marc de bones pràctiques per a la gestió de serveis de TI, no un organisme de normalització."
      }
    ],
    "hint": "L'acrònim de l'organització internacional es troba en el propi nom de la norma."
  },
  {
    "guid": "58275b97-d479-465c-bfda-4f8949db1a27",
    "subjectId": "T17",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "L'\"enfocament basat en processos\" significa que una organització hauria de:",
    "answerOptions": [
      {
        "text": "Gestionar les seves activitats i recursos com a processos interrelacionats que funcionen com un sistema coherent.",
        "isCorrect": true,
        "rationale": "Aquesta definició captura l'essència del principi: entendre com les activitats es connecten per produir resultats i gestionar-les de forma integrada."
      },
      {
        "text": "Documentar cada tasca individual que realitza cada empleat en un manual de procediments.",
        "isCorrect": false,
        "rationale": "Això podria portar a una burocràcia excessiva; l'enfocament es centra en els processos i les seves interaccions, no necessàriament en cada tasca individual."
      },
      {
        "text": "Dividir l'organització en departaments aïllats, cadascun responsable del seu propi procés.",
        "isCorrect": false,
        "rationale": "Aquest enfocament busca precisament el contrari: trencar les sitges departamentals i entendre com els processos flueixen a través de l'organització."
      },
      {
        "text": "Centrar-se exclusivament en els processos de producció, deixant de banda els de suport.",
        "isCorrect": false,
        "rationale": "Un sistema de gestió de la qualitat eficaç considera tots els processos, incloent-hi els estratègics, els operatius i els de suport, com la gestió de recursos humans."
      }
    ],
    "hint": "Pensa en una visió global de l'organització, on les diferents parts treballen juntes cap a un objectiu comú."
  },
  {
    "guid": "8facaaff-518d-400d-828d-ba91d4e85dff",
    "subjectId": "T17",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Quina versió de la norma ISO 9001 va ser substituïda per la versió actual (ISO 9001:2015)?",
    "answerOptions": [
      {
        "text": "ISO 9001:2000",
        "isCorrect": false,
        "rationale": "La versió de l'any 2000 va ser una revisió important, però n'hi va haver una altra entre aquesta i la de 2015."
      },
      {
        "text": "ISO 9001:2008",
        "isCorrect": true,
        "rationale": "El text especifica que la versió actual, ISO 9001:2015, substitueix directament la versió de 2008."
      },
      {
        "text": "ISO 9001:1994",
        "isCorrect": false,
        "rationale": "Aquesta és una versió molt més antiga, substituïda per la del 2000."
      },
      {
        "text": "ISO 9001:2018",
        "isCorrect": false,
        "rationale": "No hi ha hagut cap revisió major de la norma l'any 2018; la versió de 2015 continua sent la vigent."
      }
    ],
    "hint": "El material font menciona explícitament quina edició va precedir l'actual en la introducció a la norma."
  },
  {
    "guid": "77d38bbe-d78c-4e17-87b7-3f6b87277910",
    "subjectId": "T17",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "La \"Comunicació\" és un requisit inclòs dins de la clàusula d'ISO 9001 anomenada:",
    "answerOptions": [
      {
        "text": "Lideratge",
        "isCorrect": false,
        "rationale": "El lideratge ha de comunicar la política de qualitat, però els requisits sistemàtics sobre què, quan i com comunicar es troben en una altra clàusula."
      },
      {
        "text": "Context de l'organització",
        "isCorrect": false,
        "rationale": "S'han de comunicar les necessitats de les parts interessades, però la gestió de la comunicació com a recurs del sistema pertany a una altra secció."
      },
      {
        "text": "Suport",
        "isCorrect": true,
        "rationale": "Juntament amb els recursos, la competència i la informació documentada, la comunicació (interna i externa) es considera un element de suport fonamental per al SGQ."
      },
      {
        "text": "Operació",
        "isCorrect": false,
        "rationale": "L'operació requereix comunicació (per exemple, amb el client), però la planificació general de la comunicació del sistema està definida prèviament."
      }
    ],
    "hint": "Aquest requisit es troba en la mateixa clàusula que gestiona els recursos, la competència i la informació documentada."
  },


  {
    "guid": "953d76f6-f3fa-4f73-b14a-ba1335a652ea",
    "subjectId": "T17",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Qué es la norma ISO 9001?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Es una norma internacional para implementar Sistemas de Gestión de la Calidad (SGQ)."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "2ff8e82f-1947-4aa1-8db3-ddef06f6dd0b",
    "subjectId": "T17",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Cuál es el objetivo principal de la norma ISO 9001?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Asegurar que las organizaciones proporcionen productos y servicios que cumplan con los requisitos de los clientes y los legales."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "c588c80e-62b1-4029-9791-bcf629d3deaf",
    "subjectId": "T17",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Qué organismo internacional publica la norma ISO 9001?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "La ISO (International Organization for Standardization)."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "df2a88b5-5979-43ed-83ee-c39c0bf0898e",
    "subjectId": "T17",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Cuál es la versión actual de la norma de gestión de calidad mencionada en el material de estudio?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "ISO 9001:2015."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "aea4722e-8f79-4639-9f14-42f8c3d8ba98",
    "subjectId": "T17",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "El principio de gestión de la calidad que se centra en entender y satisfacer las necesidades de los clientes se denomina _____.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Enfoque al cliente"
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "1bd55ea7-22a6-46ee-bd99-da7b009506ba",
    "subjectId": "T17",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Qué principio de gestión de la calidad establece que la dirección debe fijar objetivos y fomentar una cultura de calidad?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Liderazgo."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "bcac4664-1b08-426d-a152-543e4d87d469",
    "subjectId": "T17",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Qué principio de la gestión de la calidad considera que las personas son clave para aportar valor?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Participación del personal."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "4d423fd4-95a3-40ee-b86d-c9e13193a54a",
    "subjectId": "T17",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "Gestionar las actividades y recursos como procesos interrelacionados corresponde al principio de _____.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Enfoque basado en procesos"
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "0c02d63d-ae81-49ce-a700-0daf1216b7c1",
    "subjectId": "T17",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Qué principio de la gestión de la calidad se enfoca en el incremento constante de la eficiencia y la eficacia?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Mejora contínua."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "1a4e4aad-0ef0-4e5f-be1a-d168d6591415",
    "subjectId": "T17",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "Según los principios de gestión de la calidad, ¿en qué debe basarse la toma de decisiones?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "En evidencias (datos y hechos verificables)."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "2cb2e758-2e76-4beb-b8f7-4ac068f4e207",
    "subjectId": "T17",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Cuál es el principio de gestión de la calidad relacionado con la interacción con proveedores y socios?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Gestión de las relaciones."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "fef049f1-d9d0-4edf-9f00-264341477952",
    "subjectId": "T17",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "La norma ISO 9001:2015 sigue una estructura común a todas las normas de sistemas de gestión ISO, conocida como _____.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Anexo SL"
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "d0a438b4-ca72-4323-b632-4553f7a9d7d2",
    "subjectId": "T17",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Qué cláusulas de la norma ISO 9001:2015 contienen los requisitos que son certificables?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Las cláusulas 4 a 10."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "63751e1e-86b5-49bd-84ff-94088c82fd6a",
    "subjectId": "T17",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿De qué trata la cláusula 4 de la ISO 9001:2015, \"Contexto de la organización\"?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "De comprender la organización, su contexto, las necesidades de las partes interesadas y definir el alcance del SGQ."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "5bd161ce-107d-4874-923e-5b735f408adf",
    "subjectId": "T17",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Qué elementos clave aborda la cláusula 5 de la ISO 9001, \"Liderazgo\"?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "El compromiso de la dirección, la política de calidad, y los roles, responsabilidades y autoridades."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "87cd6816-9272-42ab-a306-ad4fd9878798",
    "subjectId": "T17",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿En qué cláusula de la ISO 9001:2015 se planifican los riesgos, oportunidades y objetivos de calidad?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "En la cláusula 6, \"Planificación\"."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "38d1a38f-25f8-4e20-8417-947285815313",
    "subjectId": "T17",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "La gestión de recursos, competencia del personal, comunicación e información documentada pertenece a la cláusula 7 de la ISO 9001, denominada _____.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Soporte"
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "8152c822-0d07-470a-abc6-95579033efbf",
    "subjectId": "T17",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Qué abarca la cláusula 8 de la ISO 9001, \"Operación\"?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "La planificación y control operativo, los requisitos del producto/servicio, el diseño, la producción y el control de proveedores externos."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "0e1e37c6-04c2-498b-b404-6b163c182785",
    "subjectId": "T17",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "El seguimiento, la medición, las auditorías internas y la revisión por la dirección son parte de la cláusula 9, llamada _____.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Evaluación del rendimiento"
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "456362bd-ebb0-4699-a4ee-f941933e4261",
    "subjectId": "T17",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Cuál es el propósito principal de la cláusula 10 de la ISO 9001, \"Mejora\"?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Gestionar las no conformidades y acciones correctivas, y fomentar la mejora contínua."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "27b0def9-589a-4104-b76b-a55202935ba0",
    "subjectId": "T17",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "Concepto: Mapa de procesos.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Definición: Representación gráfica de los procesos de la organización."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "22b15270-d06b-4bca-9c88-26fc309cef1f",
    "subjectId": "T17",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Qué implica el \"enfoque basado en riesgos\" en la ISO 9001?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Implica identificar riesgos y oportunidades para anticipar problemas y actuar preventivamente."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "abaafc94-1007-4506-bf24-4ec74797bb95",
    "subjectId": "T17",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "A diferencia de versiones anteriores, la ISO 9001:2015 habla de _____ en lugar de exigir un manual de calidad.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "información documentada"
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "7068ed20-ad94-4cf5-803a-5b1e9fb6ffbd",
    "subjectId": "T17",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Cuál es uno de los beneficios clave de implantar la ISO 9001 en relación con la competitividad?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Facilita el acceso a nuevos mercados, ya que muchas licitaciones públicas la exigen."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "3dab6978-2aa5-4654-a707-d67959e1c7d5",
    "subjectId": "T17",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Qué impacto tiene la implantación de la ISO 9001 en la eficiencia de una organización?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Aumenta la eficiencia operativa y ayuda a reducir costos."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "0f36d7d9-498f-404b-aec6-e495783990c9",
    "subjectId": "T17",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "Mencione uno de los principales retos o limitaciones al implantar y mantener un sistema ISO 9001.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "El costo y esfuerzo de implantación y mantenimiento."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "b647e915-e9d0-4cb9-8e9e-157fa6374b69",
    "subjectId": "T17",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Qué riesgo existe si un Sistema de Gestión de la Calidad (SGQ) no se gestiona de forma ágil?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Puede convertirse en un sistema excesivamente burocrático."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "2acedd16-6d67-4069-a2b5-ca738f8b459f",
    "subjectId": "T17",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Con qué área de gestión se relaciona directamente la norma ISO 20000?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Con la gestión de servicios de Tecnologías de la Información (TI)."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "de5a158d-944e-4b46-aded-a781393fe3f6",
    "subjectId": "T17",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Cuál es el campo de aplicación de la norma ISO 27001?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "La seguridad de la información."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "048b842b-82f2-47b9-a028-a8718760a820",
    "subjectId": "T17",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "La integración de normas como ISO 9001, ISO 14001 e ISO 27001 da lugar a un _____.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Sistema de Gestión Integrado (SGI)"
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "c390241b-a906-4e02-b93d-9bfd41ce7e67",
    "subjectId": "T17",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "En el acrónimo SMART para la definición de objetivos, ¿qué significa la 'S'?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Specific (Específicos): deben estar claramente definidos y sin ambigüedades."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "fd08889e-9a94-4bd3-a657-7eab1f8daa89",
    "subjectId": "T17",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Qué significa la 'M' en el acrónimo SMART para los objetivos de calidad?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Measurable (Mesurables): deben poder cuantificarse o evaluarse con indicadores."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "38931bde-db91-4323-8125-804c2dec39c3",
    "subjectId": "T17",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "Según los criterios SMART, ¿qué característica describe la letra 'A' (Achievable)?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Los objetivos deben ser realistas y alcanzables con los recursos disponibles."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "91921b46-cc33-41f7-afac-a49e46b518c0",
    "subjectId": "T17",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Qué implica que un objetivo sea 'Relevante' (R) según el criterio SMART?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Que debe estar alineado con la política de calidad y los objetivos estratégicos de la organización."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "b3d2a1a4-2149-4159-b1ab-b13596bdb085",
    "subjectId": "T17",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Qué requisito establece la 'T' (Time-bound) en los objetivos SMART?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Que deben tener un plazo definido para ser alcanzados y evaluados."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "0ec29c78-28c3-4eb8-ad72-1bd818599b70",
    "subjectId": "T17",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "En el ciclo de mejora contínua PDCA, ¿qué se realiza en la etapa 'P' (Plan)?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Se establecen los objetivos, procesos y recursos necesarios para conseguir los resultados."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "88de491f-8444-49dd-aaae-70231598efde",
    "subjectId": "T17",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Qué acción corresponde a la fase 'D' (Do) del ciclo PDCA?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Implementar y ejecutar lo que se ha planificado."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "fb5c8332-df41-4f3e-87b1-80c7187746d7",
    "subjectId": "T17",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "La etapa 'C' (Check) del ciclo PDCA consiste en _____.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "medir y analizar los resultados obtenidos, comparándolos con los objetivos planificados"
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "31b4cd40-269c-422e-b835-8fb8657e0d23",
    "subjectId": "T17",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Qué se debe hacer en la fase 'A' (Act) del ciclo PDCA?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Tomar acciones para mejorar el rendimiento y corregir las desviaciones detectadas."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "63777d47-0985-42b8-9655-ab55178717cb",
    "subjectId": "T17",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Cómo se relaciona la norma ISO 9001:2015 con el ciclo PDCA?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "La estructura de la norma está basada en el ciclo PDCA, aplicándolo tanto a procesos individuales como al SGQ en su conjunto."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "0881ab34-5f37-4ca5-aeda-3c90eb38fef3",
    "subjectId": "T17",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "Según el test de ejemplo, ¿por qué la \"cualificación del personal\" no forma parte del \"contexto de la organización\" (cláusula 4)?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Porque la competencia del personal se trata en la cláusula 7 (Soporte)."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "eb2ae1b3-74a2-46b1-af03-e770a9be3b3a",
    "subjectId": "T17",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "Según la pregunta de examen de OPOS 23, la norma ISO 9001:2015 utiliza un enfoque basado en _____.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Procesos."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },
  {
    "guid": "24679f4d-2e80-4b2c-89b2-d6d72e4016eb",
    "subjectId": "T17",
    "difficulty": 2,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "En una de las preguntas de examen de OPOS 23, se preguntó por un principio que NO corresponde a la gestión de la calidad. ¿Cuál era la respuesta correcta?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Enfoque al servicio."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "Cada intent suma! 💪"
      }
    ],
    "hint": ""
  },


  {
    "guid": "e6a1d46d-4e31-489a-9c2b-7a09e284c71b",
    "subjectId": "T17",
    "difficulty": 1,
    "origin": "OPOS24_gpt",
    "type": "truefalse",
    "question": "La norma ISO 9001:2015 és aplicable només a empreses privades del sector industrial.",
    "answerOptions": [
      {
        "text": "Cert",
        "isCorrect": false,
        "rationale": "Incorrecte. La ISO 9001 és aplicable a qualsevol organització, pública o privada, de qualsevol sector."
      },
      {
        "text": "Fals",
        "isCorrect": true,
        "rationale": "Correcte. La norma ISO 9001 s’aplica tant a empreses privades com a administracions públiques i entitats sense ànim de lucre."
      }
    ],
    "hint": "Recorda: ISO 9001 és universal i adaptable a qualsevol tipus d’organització."
  },
  {
    "guid": "4de0a6b7-cc03-4c98-84a9-1eacb276e594",
    "subjectId": "T17",
    "difficulty": 2,
    "origin": "OPOS24_gpt",
    "type": "truefalse",
    "question": "L’enfocament principal de la ISO 9001 és el control de la qualitat del producte final.",
    "answerOptions": [
      {
        "text": "Cert",
        "isCorrect": false,
        "rationale": "Incorrecte. L’enfocament de la norma és als processos, no al producte final."
      },
      {
        "text": "Fals",
        "isCorrect": true,
        "rationale": "Correcte. La ISO 9001 se centra en la gestió i millora dels processos per garantir la qualitat global."
      }
    ],
    "hint": "ISO 9001 es basa en l’enfocament per processos, no en el control puntual del producte."
  },
  {
    "guid": "c61a24ef-bbe2-4e2c-ae90-90cc3b0d1a6c",
    "subjectId": "T17",
    "difficulty": 3,
    "origin": "OPOS24_gpt",
    "type": "truefalse",
    "question": "El cicle PDCA (Plan-Do-Check-Act) és la base del funcionament de la millora contínua dins la ISO 9001.",
    "answerOptions": [
      {
        "text": "Cert",
        "isCorrect": true,
        "rationale": "Correcte. El cicle PDCA, també anomenat cicle de Deming, estructura la planificació, execució, verificació i millora."
      },
      {
        "text": "Fals",
        "isCorrect": false,
        "rationale": "Incorrecte. El PDCA és fonamental en la filosofia de millora contínua de la ISO 9001."
      }
    ],
    "hint": "PDCA = Planificar, Fer, Verificar, Actuar — fonament del SGQ."
  },
  {
    "guid": "52b4e2b0-17f2-46e4-b60c-40a32b8e4a9b",
    "subjectId": "T17",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "truefalse",
    "question": "Segons la ISO 9001, les auditories internes només poden ser realitzades per organismes certificadors externs.",
    "answerOptions": [
      {
        "text": "Cert",
        "isCorrect": false,
        "rationale": "Incorrecte. Les auditories internes les realitza la pròpia organització per verificar la conformitat del sistema."
      },
      {
        "text": "Fals",
        "isCorrect": true,
        "rationale": "Correcte. Les auditories internes són realitzades per personal de l’organització o per tercers autoritzats, no necessàriament certificadors externs."
      }
    ],
    "hint": "Diferencia entre auditories internes (1a part) i externes (3a part)."
  },
  {
    "guid": "baac91d7-5a76-4f5a-94ee-873e29c18bcd",
    "subjectId": "T17",
    "difficulty": 3,
    "origin": "OPOS24_gpt",
    "type": "truefalse",
    "question": "Un dels principis de la ISO 9001 és la presa de decisions basada en l’evidència.",
    "answerOptions": [
      {
        "text": "Cert",
        "isCorrect": true,
        "rationale": "Correcte. La ISO 9001 promou decisions fonamentades en dades objectives i resultats mesurables."
      },
      {
        "text": "Fals",
        "isCorrect": false,
        "rationale": "Incorrecte. Les decisions basades en dades són essencials per la gestió de la qualitat."
      }
    ],
    "hint": "Recorda: les decisions es prenen basant-se en dades, no en opinions."
  },
  {
    "guid": "3b38b97b-90d5-40b5-b4d9-29cccb96702e",
    "subjectId": "T17",
    "difficulty": 2,
    "origin": "OPOS24_gpt",
    "type": "truefalse",
    "question": "La gestió de relacions amb parts interessades és un dels set principis fonamentals de la gestió de la qualitat segons la ISO 9001:2015.",
    "answerOptions": [
      {
        "text": "Cert",
        "isCorrect": true,
        "rationale": "Correcte. La gestió de les relacions amb les parts interessades és el setè principi de la norma."
      },
      {
        "text": "Fals",
        "isCorrect": false,
        "rationale": "Incorrecte. El principi existeix i és clau per assegurar la col·laboració amb proveïdors, ciutadans o socis."
      }
    ],
    "hint": "Les parts interessades inclouen proveïdors, clients, empleats i la societat."
  },
  {
    "guid": "bc9f59de-b924-42f4-86d7-38c4697ac67b",
    "subjectId": "T17",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "truefalse",
    "question": "La norma ISO 9001 exigeix l’elaboració obligatòria d’un manual de qualitat en format imprès.",
    "answerOptions": [
      {
        "text": "Cert",
        "isCorrect": false,
        "rationale": "Incorrecte. Des de la versió 2015, el manual de qualitat tradicional ja no és obligatori; s’utilitza el concepte d’informació documentada."
      },
      {
        "text": "Fals",
        "isCorrect": true,
        "rationale": "Correcte. La ISO 9001:2015 substitueix el manual per la gestió flexible d’informació documentada, física o digital."
      }
    ],
    "hint": "Des de 2015, la norma simplifica la documentació requerida."
  },
  {
    "guid": "7e45b115-4270-4b9d-9d25-39e8de52c12b",
    "subjectId": "T17",
    "difficulty": 1,
    "origin": "OPOS24_gpt",
    "type": "truefalse",
    "question": "El principi de millora contínua estableix que el sistema de gestió de la qualitat ha d’evolucionar constantment per augmentar l’eficiència.",
    "answerOptions": [
      {
        "text": "Cert",
        "isCorrect": true,
        "rationale": "Correcte. La millora contínua és un objectiu permanent de la ISO 9001."
      },
      {
        "text": "Fals",
        "isCorrect": false,
        "rationale": "Incorrecte. La millora contínua és essencial per mantenir i augmentar l’eficàcia del sistema de qualitat."
      }
    ],
    "hint": "Millorar cada dia és un dels valors centrals del model ISO."
  },

  
  {
    "guid": "a4a9c833-7991-47da-8a15-57f82315e9e3",
    "subjectId": "T17",
    "difficulty": 1,
    "origin": "OPOS24_gpt",
    "type": "fillgap",
    "question": "La norma ISO 9001:2015 estableix un sistema de gestió de la qualitat basat en l’enfocament ________, orientat a millorar el rendiment global de l’organització.",
    "answerOptions": [
      {
        "text": "per processos",
        "isCorrect": true,
        "rationale": "Correcte. L’enfocament per processos és la base metodològica de la ISO 9001."
      },
      {
        "text": "per productes",
        "isCorrect": false,
        "rationale": "Incorrecte. La norma no se centra en el producte sinó en el procés."
      },
      {
        "text": "per departaments",
        "isCorrect": false,
        "rationale": "Incorrecte. No es tracta d’una divisió funcional, sinó transversal per processos."
      },
      {
        "text": "estratègic",
        "isCorrect": false,
        "rationale": "Incorrecte. Tot i que existeix un enfocament estratègic, la norma ISO 9001 posa el focus en els processos."
      }
    ],
    "hint": "Recorda: ISO 9001 → Enfocament per processos."
  },
  {
    "guid": "92c2a4b1-dad7-4059-b633-868d0992b5fc",
    "subjectId": "T17",
    "difficulty": 2,
    "origin": "OPOS24_gpt",
    "type": "fillgap",
    "question": "El cicle de millora contínua conegut com a cicle PDCA correspon a les fases: ________, ________, ________ i ________.",
    "answerOptions": [
      {
        "text": "Planificar, Fer, Verificar, Actuar",
        "isCorrect": true,
        "rationale": "Correcte. És el cicle de Deming, base de la millora contínua de la ISO 9001."
      },
      {
        "text": "Planificar, Executar, Tancar, Controlar",
        "isCorrect": false,
        "rationale": "Incorrecte. Aquesta seqüència és pròpia del cicle de vida d’un projecte, no del PDCA."
      },
      {
        "text": "Pensar, Dissenyar, Crear, Aplicar",
        "isCorrect": false,
        "rationale": "Incorrecte. No són fases normatives reconegudes dins la ISO 9001."
      },
      {
        "text": "Analitzar, Planificar, Implementar, Revisar",
        "isCorrect": false,
        "rationale": "Incorrecte. Encara que s’hi assembla, el nom oficial és PDCA."
      }
    ],
    "hint": "PDCA = Plan (planificar), Do (fer), Check (verificar), Act (actuar)."
  },
  {
    "guid": "53fbb8a1-3db4-4c34-bc78-bb915af01bce",
    "subjectId": "T17",
    "difficulty": 3,
    "origin": "OPOS24_gpt",
    "type": "fillgap",
    "question": "Un dels principis fonamentals de la gestió de la qualitat és la ________ basada en ________.",
    "answerOptions": [
      {
        "text": "presa de decisions / evidències",
        "isCorrect": true,
        "rationale": "Correcte. La presa de decisions basada en evidències és un dels set principis de la ISO 9001."
      },
      {
        "text": "planificació / resultats",
        "isCorrect": false,
        "rationale": "Incorrecte. El principi fa referència a les evidències objectives, no als resultats finals."
      },
      {
        "text": "millora / objectius",
        "isCorrect": false,
        "rationale": "Incorrecte. És un altre principi diferent de la norma."
      },
      {
        "text": "avaluació / intuïció",
        "isCorrect": false,
        "rationale": "Incorrecte. La norma evita basar-se en intuïcions o opinions."
      }
    ],
    "hint": "Les decisions han d’estar fonamentades en dades i evidències verificables."
  },
  {
    "guid": "4d8d1791-b47e-47ee-99ef-742891c08f4f",
    "subjectId": "T17",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "fillgap",
    "question": "Segons la ISO 9001, una ________ és un incompliment d’un requisit establert, mentre que una ________ és una acció per eliminar la seva causa.",
    "answerOptions": [
      {
        "text": "no conformitat / acció correctiva",
        "isCorrect": true,
        "rationale": "Correcte. És la relació bàsica entre el problema detectat i la seva solució dins del SGQ."
      },
      {
        "text": "no conformitat / acció preventiva",
        "isCorrect": false,
        "rationale": "Incorrecte. Les accions preventives van ser substituïdes pel concepte de gestió del risc a ISO 9001:2015."
      },
      {
        "text": "anomalia / verificació",
        "isCorrect": false,
        "rationale": "Incorrecte. El terme 'anomalia' no és utilitzat formalment a la norma."
      },
      {
        "text": "desviació / pla de millora",
        "isCorrect": false,
        "rationale": "Incorrecte. Tot i que pot ser semblant, la terminologia ISO parla de 'no conformitat' i 'acció correctiva'."
      }
    ],
    "hint": "Quan detectes una desviació, aplica una acció correctiva per eliminar-ne la causa."
  },
  {
    "guid": "04e53bfa-0165-4f3b-86d1-83dc1a63b85d",
    "subjectId": "T17",
    "difficulty": 2,
    "origin": "OPOS24_gpt",
    "type": "fillgap",
    "question": "El principi de ________ busca garantir que l’organització se centra a satisfer les necessitats actuals i futures del client.",
    "answerOptions": [
      {
        "text": "enfoc al client",
        "isCorrect": true,
        "rationale": "Correcte. És el primer principi de la gestió de la qualitat segons la ISO 9001."
      },
      {
        "text": "enfoc al servei",
        "isCorrect": false,
        "rationale": "Incorrecte. La norma no utilitza aquest terme, sinó 'enfoc al client'."
      },
      {
        "text": "millora contínua",
        "isCorrect": false,
        "rationale": "Incorrecte. Tot i que està relacionat, és un altre principi diferent."
      },
      {
        "text": "eficiència de processos",
        "isCorrect": false,
        "rationale": "Incorrecte. És un objectiu operatiu, no un principi."
      }
    ],
    "hint": "El client és el centre de tota l’organització segons ISO 9001."
  },
  {
    "guid": "cb2e98ab-c776-4f43-81a3-f04cfbe390f8",
    "subjectId": "T17",
    "difficulty": 3,
    "origin": "OPOS24_gpt",
    "type": "fillgap",
    "question": "El conjunt de processos relacionats i gestionats com un sistema coherent s’anomena ________, i el seu objectiu és assolir la ________ del client.",
    "answerOptions": [
      {
        "text": "Sistema de Gestió de Qualitat / satisfacció",
        "isCorrect": true,
        "rationale": "Correcte. El SGQ busca assegurar la satisfacció del client mitjançant la gestió per processos."
      },
      {
        "text": "Pla de Qualitat / millora contínua",
        "isCorrect": false,
        "rationale": "Incorrecte. El pla pot formar part del sistema, però no és l’objectiu final."
      },
      {
        "text": "Sistema de Control / reducció de costos",
        "isCorrect": false,
        "rationale": "Incorrecte. El control és una part, però no descriu el SGQ."
      },
      {
        "text": "Estructura Documental / eficiència interna",
        "isCorrect": false,
        "rationale": "Incorrecte. L’eficiència és un benefici, no l’objectiu principal."
      }
    ],
    "hint": "Pensa en el nom del sistema que regula tots els processos per aconseguir clients satisfets."
  }
]
