[
  {
    "guid": "6f9c3d4b-92a5-4b67-912a-82b5ab1722af",
    "subjectId": "T18",
    "difficulty": 2,
    "origin": "OPOS19_preguntes_especific.pdf",
    "type": "oposXX",
    "question": "D’acord a la norma ISO 20000, el cicle de millora contínua PHVA (“Planificar, Hacer, Verificar, Actuar”) es fonamenta en:",
    "answerOptions": [
      {
        "text": "Planificar, Fer, Comprovar, Actuar.",
        "isCorrect": true,
        "rationale": "És la traducció directa del cicle PDCA de Deming aplicat a la gestió de serveis segons ISO 20000."
      },
      {
        "text": "Planificar, Dissenyar, Controlar, Aprovar.",
        "isCorrect": false,
        "rationale": "No és la seqüència reconeguda per la norma ISO 20000."
      },
      {
        "text": "Planificar, Executar, Analitzar, Comunicar.",
        "isCorrect": false,
        "rationale": "Aquest cicle s'assembla a metodologies de projectes, no al PHVA."
      },
      {
        "text": "Preparar, Desplegar, Comprovar, Analitzar.",
        "isCorrect": false,
        "rationale": "No correspon a la nomenclatura estàndard PDCA."
      }
    ],
    "hint": "El cicle PDCA és la base de la millora contínua segons Deming i totes les normes ISO de gestió."
  },
  {
    "guid": "2b75b56d-13b0-4e58-b32c-11e444c82a1d",
    "subjectId": "T18",
    "difficulty": 3,
    "origin": "OPOS19_preguntes_practic.pdf",
    "type": "oposXX",
    "question": "Des de la perspectiva del client i dels usuaris, el valor del nou servei es composa de 2 factors i d’una combinació dels mateixos, d’acord a les pràctiques d’ITIL V3. Aquests aspectes consisteixen en:",
    "answerOptions": [
      {
        "text": "1. Garantia i 2. Infraestructura.",
        "isCorrect": false,
        "rationale": "‘Infraestructura’ no és un dels dos components definits per ITIL."
      },
      {
        "text": "1. Utilitat i 2. Garantia.",
        "isCorrect": true,
        "rationale": "ITIL defineix que el valor del servei es compon de la utilitat (fit for purpose) i la garantia (fit for use)."
      },
      {
        "text": "1. Funcionalitat i 2. Utilitat.",
        "isCorrect": false,
        "rationale": "Funcionalitat no és un terme ITIL per descriure valor."
      },
      {
        "text": "1. Funcionalitat i 2. Infraestructura.",
        "isCorrect": false,
        "rationale": "No correspon als termes d’ITIL V3."
      }
    ],
    "hint": "Recorda: ITIL defineix el valor en termes d'utilitat (què fa) i garantia (com ho fa)."
  },
  {
    "guid": "32c0cb55-1e2f-4212-92dc-9f31528e6e19",
    "subjectId": "T18",
    "difficulty": 2,
    "origin": "OPOS23_preguntes_practic.pdf",
    "type": "oposXX",
    "question": "Segons ITIL v3, el Cicle de Vida té com a finalitat implementar i gestionar serveis per a que funcionin de manera fluida i amb la màxima eficiència, segons 5 etapes que són:",
    "answerOptions": [
      {
        "text": "Planificació – Realització – Verificació – Validació – Millora continua del servei.",
        "isCorrect": false,
        "rationale": "Aquestes etapes no corresponen al cicle ITIL sinó al cicle PDCA de qualitat."
      },
      {
        "text": "Gestió del Catàleg – Disseny – Transició – Operació – Millora continua del servei.",
        "isCorrect": false,
        "rationale": "La fase inicial és Estratègia, no Gestió del Catàleg."
      },
      {
        "text": "Estratègia – Disseny – Transició – Operació – Millora continua del servei.",
        "isCorrect": true,
        "rationale": "Aquestes són exactament les 5 etapes del cicle de vida de serveis ITIL v3."
      },
      {
        "text": "Estratègia – Disponibilitat – Capacitat – Continuïtat – Millora continua del servei.",
        "isCorrect": false,
        "rationale": "Les fases de Disponibilitat i Capacitat són processos interns, no etapes del cicle de vida."
      }
    ],
    "hint": "Recorda les 5 etapes del cicle ITIL v3: Estratègia, Disseny, Transició, Operació i Millora contínua."
  },
  {
    "guid": "3df4ff47-9dbe-4038-9db2-09bcb1f37e93",
    "subjectId": "T18",
    "difficulty": 2,
    "origin": "OPOS23_preguntes_practic.pdf",
    "type": "oposXX",
    "question": "Segons ITIL v3, en relació a la Monitorització i la Gestió d’Esdeveniments, quina de les següents afirmacions és CORRECTA?",
    "answerOptions": [
      {
        "text": "La Monitorització es centra en la generació i detecció de notificacions significatives sobre l’estat dels serveis i Infraestructura de TI.",
        "isCorrect": true,
        "rationale": "Segons ITIL, la monitorització detecta esdeveniments rellevants per anticipar problemes."
      },
      {
        "text": "La Gestió d’Esdeveniments és un terme més ampli que la Monitorització.",
        "isCorrect": false,
        "rationale": "En realitat, la gestió d’esdeveniments és un procés específic dins l’operació del servei."
      },
      {
        "text": "Les dos àrees no tenen cap tipus de relació.",
        "isCorrect": false,
        "rationale": "Monitorització i gestió d’esdeveniments estan íntimament relacionades dins l’operació de servei."
      },
      {
        "text": "La Gestió d’Esdeveniments es centra en la generació i detecció de notificacions significatives sobre l’estat dels serveis i Infraestructura de TI.",
        "isCorrect": false,
        "rationale": "Aquesta definició correspon a la monitorització, no a la gestió d’esdeveniments."
      }
    ],
    "hint": "La monitorització detecta canvis o alertes; la gestió d’esdeveniments és la resposta a aquestes alertes."
  },
  {
    "guid": "f65a7e7c-10d3-4953-b478-7f8a08a84936",
    "subjectId": "T18",
    "difficulty": 3,
    "origin": "OPOS19_preguntes_especific.pdf",
    "type": "oposXX",
    "question": "Què hauria de garantir el procés de gestió de la disponibilitat segons la metodologia ITIL?",
    "answerOptions": [
      {
        "text": "Que tenim uns acords de nivells de servei definits.",
        "isCorrect": false,
        "rationale": "Els acords són part de la gestió de nivells de servei, no de disponibilitat."
      },
      {
        "text": "Que tenim implementat un sistema de recuperació davant desastres.",
        "isCorrect": false,
        "rationale": "Això forma part de la gestió de continuïtat, no de disponibilitat."
      },
      {
        "text": "Que la disponibilitat dels sistemes i serveis es correspongui amb les necessitats canviants acordades amb negoci.",
        "isCorrect": true,
        "rationale": "És la definició exacta del propòsit de la gestió de disponibilitat segons ITIL."
      },
      {
        "text": "Que la disponibilitat dels sistemes i serveis no té cap tall en horari d’oficina.",
        "isCorrect": false,
        "rationale": "La disponibilitat no implica absència total d’interrupcions."
      }
    ],
    "hint": "Disponibilitat = capacitat de proporcionar el servei d’acord amb el que requereix el negoci."
  },


  {
    "guid": "3b6d9a44-4e15-4f2b-8e1b-3c7d23f23b87",
    "subjectId": "T18",
    "difficulty": 1,
    "origin": "OPOS24_gpt",
    "type": "fillgap",
    "question": "La norma ISO 20000 és una norma internacional per a la gestió dels ________ de Tecnologies de la Informació (TI).",
    "answerOptions": [
      {
        "text": "serveis",
        "isCorrect": true,
        "rationale": "ISO 20000 tracta sobre la gestió de serveis TI (IT Service Management)."
      },
      {
        "text": "projectes",
        "isCorrect": false,
        "rationale": "La gestió de projectes correspon a PMBOK o PRINCE2, no a ISO 20000."
      },
      {
        "text": "productes",
        "isCorrect": false,
        "rationale": "La norma tracta sobre serveis, no productes tangibles."
      },
      {
        "text": "usuaris",
        "isCorrect": false,
        "rationale": "Els usuaris són receptors del servei, no l’objecte de gestió."
      }
    ],
    "hint": "Pensa en l’àmbit ITIL: serveis, no productes."
  },
  {
    "guid": "6f3c7a55-fd3d-429f-b51a-251b6435d141",
    "subjectId": "T18",
    "difficulty": 2,
    "origin": "OPOS24_gpt",
    "type": "fillgap",
    "question": "El cicle de millora contínua de la ISO 20000 es basa en el model ________, també conegut com a cicle de Deming.",
    "answerOptions": [
      {
        "text": "PDCA (Plan–Do–Check–Act)",
        "isCorrect": true,
        "rationale": "És el cicle de millora contínua aplicat a tots els sistemes de gestió ISO."
      },
      {
        "text": "SCRUM",
        "isCorrect": false,
        "rationale": "SCRUM és un marc àgil de desenvolupament de projectes, no un cicle de gestió de qualitat."
      },
      {
        "text": "V-model",
        "isCorrect": false,
        "rationale": "El V-model s’utilitza per al desenvolupament i proves de programari."
      },
      {
        "text": "Kanban",
        "isCorrect": false,
        "rationale": "Kanban és una tècnica àgil visual, no un model de millora de serveis."
      }
    ],
    "hint": "Recorda: Planifica, fes, comprova i actua."
  },
  {
    "guid": "b292f6cf-9b7e-4d8c-8c4d-f0e0de1881e3",
    "subjectId": "T18",
    "difficulty": 3,
    "origin": "OPOS24_gpt",
    "type": "fillgap",
    "question": "Segons la ISO 20000, el valor d’un servei es defineix per la seva ________ (fit for purpose) i la seva ________ (fit for use).",
    "answerOptions": [
      {
        "text": "utilitat / garantia",
        "isCorrect": true,
        "rationale": "ITIL i ISO 20000 defineixen el valor com la combinació d’utilitat (què fa) i garantia (com ho fa)."
      },
      {
        "text": "eficiència / disponibilitat",
        "isCorrect": false,
        "rationale": "Són característiques de servei, però no la definició de valor."
      },
      {
        "text": "capacitat / seguretat",
        "isCorrect": false,
        "rationale": "Aquests són processos de gestió dins de la norma, no definicions de valor."
      },
      {
        "text": "garantia / rendiment",
        "isCorrect": false,
        "rationale": "Només 'garantia' és correcta, falta 'utilitat' com a segon component."
      }
    ],
    "hint": "ITIL defineix el valor com a combinació de dos conceptes clau."
  },
  {
    "guid": "2cc1635b-9c18-4f0b-bc62-1178f4e1893d",
    "subjectId": "T18",
    "difficulty": 3,
    "origin": "OPOS24_gpt",
    "type": "fillgap",
    "question": "Els processos de la ISO 20000 estan organitzats seguint les fases del cicle de vida del servei: ________, Disseny, Transició, Operació i Millora contínua.",
    "answerOptions": [
      {
        "text": "Estratègia",
        "isCorrect": true,
        "rationale": "És la primera fase del cicle ITIL, adoptada també per la ISO 20000."
      },
      {
        "text": "Planificació",
        "isCorrect": false,
        "rationale": "Planificació és un pas dins del PDCA, no una fase del cicle de vida."
      },
      {
        "text": "Control",
        "isCorrect": false,
        "rationale": "No és una de les cinc fases definides per ITIL."
      },
      {
        "text": "Gestió del Catàleg",
        "isCorrect": false,
        "rationale": "És un procés dins de la fase de Disseny, no una fase pròpia."
      }
    ],
    "hint": "Pensa en les 5 etapes d’ITIL V3."
  },
  {
    "guid": "4b0d2e7f-b728-470e-9e21-c6040ccfb38d",
    "subjectId": "T18",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "fillgap",
    "question": "El procés que garanteix que els serveis TI es mantenen d’acord amb les necessitats de negoci canviants és la gestió de la ________.",
    "answerOptions": [
      {
        "text": "disponibilitat",
        "isCorrect": true,
        "rationale": "La gestió de la disponibilitat assegura que el nivell de servei s’adapta a les necessitats del negoci."
      },
      {
        "text": "continuïtat",
        "isCorrect": false,
        "rationale": "La continuïtat tracta la recuperació davant desastres, no l’adaptació diària a les necessitats de negoci."
      },
      {
        "text": "capacitat",
        "isCorrect": false,
        "rationale": "La gestió de capacitat controla recursos, però no l’adaptació al negoci."
      },
      {
        "text": "configuració",
        "isCorrect": false,
        "rationale": "Gestiona els components i la seva relació, no la disponibilitat del servei."
      }
    ],
    "hint": "Relaciona-ho amb l’objectiu d’assegurar que els serveis estan disponibles segons l’acordat."
  },
  {
    "guid": "b1fa8b7c-c0a8-4ab8-8e63-70c23e9c5a61",
    "subjectId": "T18",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "fillgap",
    "question": "En la ISO 20000, la gestió de la seguretat de la informació s’alinea amb la norma ________, que defineix els requisits per establir un SGSI.",
    "answerOptions": [
      {
        "text": "ISO 27001",
        "isCorrect": true,
        "rationale": "La ISO 27001 és la norma per a sistemes de gestió de seguretat de la informació."
      },
      {
        "text": "ISO 9001",
        "isCorrect": false,
        "rationale": "Aquesta norma tracta la qualitat general, no la seguretat."
      },
      {
        "text": "ISO 22301",
        "isCorrect": false,
        "rationale": "Aquesta tracta la continuïtat del negoci, no la seguretat de la informació."
      },
      {
        "text": "ISO 31000",
        "isCorrect": false,
        "rationale": "Defineix principis de gestió de riscos, no un SGSI concret."
      }
    ],
    "hint": "És la norma específica per a seguretat de la informació, complementària a ISO 20000."
  },
  
  {
    "guid": "e56bde69-8cb1-4568-9723-3e4c8cb8c39b",
    "subjectId": "T18",
    "difficulty": 1,
    "origin": "OPOS24_gpt",
    "type": "truefalse",
    "question": "La norma ISO 20000 estableix requisits per a la gestió de serveis TI, seguint el model de millora contínua PDCA.",
    "answerOptions": [
      {
        "text": "Cert",
        "isCorrect": true,
        "rationale": "El cicle PDCA (Plan-Do-Check-Act) és la base de totes les normes ISO de gestió, inclosa la 20000."
      },
      {
        "text": "Fals",
        "isCorrect": false,
        "rationale": "La ISO 20000 utilitza explícitament el model PDCA per a la millora contínua dels serveis TI."
      }
    ],
    "hint": "Recorda: la millora contínua és un principi transversal a totes les normes ISO."
  },
  {
    "guid": "c2b6e39a-264e-4b73-a3b9-32e7b0ac12d9",
    "subjectId": "T18",
    "difficulty": 2,
    "origin": "OPOS24_gpt",
    "type": "truefalse",
    "question": "La ISO 20000 és una norma exclusiva per a empreses privades que ofereixen serveis tecnològics al mercat.",
    "answerOptions": [
      {
        "text": "Cert",
        "isCorrect": false,
        "rationale": "També s’aplica a administracions públiques o departaments interns de TI; no és exclusiva per al sector privat."
      },
      {
        "text": "Fals",
        "isCorrect": true,
        "rationale": "És una norma internacional aplicable a qualsevol organització que gestioni serveis TI, independentment del sector."
      }
    ],
    "hint": "Tant organismes públics com privats poden certificar-se en ISO 20000."
  },
  {
    "guid": "4e442c94-b5cd-4bfb-a9b1-4e7b25a21b82",
    "subjectId": "T18",
    "difficulty": 3,
    "origin": "OPOS24_gpt",
    "type": "truefalse",
    "question": "El valor d’un servei segons ITIL i ISO 20000 es determina únicament per la seva utilitat, independentment de la garantia.",
    "answerOptions": [
      {
        "text": "Cert",
        "isCorrect": false,
        "rationale": "El valor d’un servei es compon de la seva utilitat (fit for purpose) i de la seva garantia (fit for use)."
      },
      {
        "text": "Fals",
        "isCorrect": true,
        "rationale": "Segons ITIL, tant la utilitat com la garantia són necessàries per definir el valor global del servei."
      }
    ],
    "hint": "ITIL defineix dos pilars del valor: utilitat i garantia."
  },
  {
    "guid": "a4518747-0b4f-4c3e-9e5a-62a199cb198f",
    "subjectId": "T18",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "truefalse",
    "question": "La gestió de la disponibilitat dins de la ISO 20000 té com a objectiu assegurar que els serveis TI estan disponibles segons el que s’ha acordat amb el negoci.",
    "answerOptions": [
      {
        "text": "Cert",
        "isCorrect": true,
        "rationale": "El procés de gestió de disponibilitat busca garantir que els serveis compleixin els acords de nivell de servei (SLA)."
      },
      {
        "text": "Fals",
        "isCorrect": false,
        "rationale": "Aquest és exactament l’objectiu de la gestió de disponibilitat dins del marc ITIL i ISO 20000."
      }
    ],
    "hint": "Disponibilitat = capacitat del servei per complir el nivell acordat amb el negoci."
  },
  {
    "guid": "d5d4cc06-f59d-4ef0-81c3-2876f1ac9282",
    "subjectId": "T18",
    "difficulty": 2,
    "origin": "OPOS24_gpt",
    "type": "truefalse",
    "question": "ISO 9001 i ISO 20000 no poden coexistir dins del mateix sistema de gestió d’una organització.",
    "answerOptions": [
      {
        "text": "Cert",
        "isCorrect": false,
        "rationale": "Ambdues normes comparteixen estructura (Annex SL) i poden integrar-se fàcilment en un sistema únic de gestió."
      },
      {
        "text": "Fals",
        "isCorrect": true,
        "rationale": "És habitual integrar ISO 20000 (serveis TI) amb ISO 9001 (qualitat) dins un mateix SGI."
      }
    ],
    "hint": "La majoria d’organitzacions combinen diverses normes ISO dins un sistema integrat."
  },
  {
    "guid": "f95df1e1-5a0a-4c78-b8b8-2ab04eeb9ee5",
    "subjectId": "T18",
    "difficulty": 3,
    "origin": "OPOS24_gpt",
    "type": "truefalse",
    "question": "La gestió de la seguretat de la informació en la ISO 20000 s’alinea amb la norma ISO 27001.",
    "answerOptions": [
      {
        "text": "Cert",
        "isCorrect": true,
        "rationale": "La ISO 27001 és la norma de referència per a la seguretat de la informació i complementa la ISO 20000."
      },
      {
        "text": "Fals",
        "isCorrect": false,
        "rationale": "Les dues normes són compatibles i sovint s’apliquen conjuntament per garantir seguretat i qualitat del servei."
      }
    ],
    "hint": "Recorda: ISO 27001 = seguretat; ISO 20000 = gestió de serveis TI."
  },
  {
    "guid": "39bcda38-5fc7-4ce0-8b26-2ad4de134da1",
    "subjectId": "T18",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "truefalse",
    "question": "La ISO 20000 descriu exactament els procediments que cada organització ha d’aplicar per gestionar els seus serveis TI.",
    "answerOptions": [
      {
        "text": "Cert",
        "isCorrect": false,
        "rationale": "La norma estableix requisits, no procediments específics. Cada organització adapta els seus processos per complir-los."
      },
      {
        "text": "Fals",
        "isCorrect": true,
        "rationale": "ISO 20000 defineix què s’ha de complir, però deixa llibertat sobre com implementar-ho."
      }
    ],
    "hint": "Les normes ISO defineixen el marc i requisits, no la metodologia exacta."
  }
]
