[
    {
        "guid": "c88c4958-8664-4a34-9807-ac162a23a5bb",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4.xml",
        "type": "test",
        "question": "¿Cuál de las siguientes opciones proporciona al usuario acceso a un sistema?",
        "answerOptions": [
            {
                "text": "El requerimiento de un servicio.",
                "isCorrect": false,
                "rationale": "Una solicitud de servicio es la petición formal del usuario, pero por sí misma no proporciona acceso; desencadena el proceso para que el proveedor lo habilite."
            },
            {
                "text": "El acuerdo de los servicios.",
                "isCorrect": false,
                "rationale": "Un acuerdo de servicio (SLA) define expectativas y niveles de servicio, pero no es el mecanismo operativo que otorga acceso al sistema."
            },
            {
                "text": "El consumo de servicios.",
                "isCorrect": false,
                "rationale": "El consumo de servicios es el uso del servicio una vez que el acceso ya ha sido concedido, no el acto de proporcionarlo."
            },
            {
                "text": "La provisión de servicios.",
                "isCorrect": true,
                "rationale": "La provisión de servicios incluye actividades como otorgar acceso a los usuarios, suministro de recursos y soporte al servicio; por eso es la opción que efectivamente proporciona acceso al sistema."
            }
        ]
    },
    {
        "guid": "3ec04235-1184-4881-b3da-3bd2c0e13e2c",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4.xml",
        "type": "test",
        "question": "¿Qué principio se centra en los consumidores del servicio?",
        "answerOptions": [
            {
                "text": "Comenzar donde esté.",
                "isCorrect": false,
                "rationale": "“Comenzar donde esté” se centra en aprovechar lo que ya existe, no en focalizarse explícitamente en el consumidor del servicio."
            },
            {
                "text": "Optimizar y automatizar.",
                "isCorrect": false,
                "rationale": "Este principio busca mejorar y automatizar procesos, pero no define el foco en el consumidor como su idea central."
            },
            {
                "text": "Mantenerlo Sencillo.",
                "isCorrect": false,
                "rationale": "“Mantenerlo sencillo y práctico” se orienta a evitar complejidad innecesaria, no a centrar la gestión en el consumidor."
            },
            {
                "text": "Enfocarse en el valor.",
                "isCorrect": true,
                "rationale": "“Enfocarse en el valor” es el principio guía que enfatiza que todo lo que hace la organización debe estar dirigido a generar valor para los consumidores del servicio."
            }
        ]
    },
    {
        "guid": "c152ed6a-0cc5-4c15-8e9e-7708d1f788fc",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4.xml",
        "type": "test",
        "question": "¿Cuáles de las siguientes opciones son importantes en un registro de mejora continua (CIR)?",
        "answerOptions": [
            {
                "text": "Documentar, evaluar y priorizar las ideas de mejora.",
                "isCorrect": true,
                "rationale": "El registro de mejora continua debe servir para dejar constancia de las ideas, evaluarlas y priorizarlas, de forma que pueda gestionarse un backlog de mejoras."
            },
            {
                "text": "Guardar en un solo CIR las ideas de mejora de muchas fuentes.",
                "isCorrect": false,
                "rationale": "Aunque es buena práctica consolidar las oportunidades de mejora en un único registro, la clave del CIR no es solo el origen, sino su gestión (documentar, evaluar y priorizar)."
            },
            {
                "text": "Eliminar del CIR que no se apliquen de manera inmediata.",
                "isCorrect": false,
                "rationale": "Las mejoras que no se aplican de inmediato no deben eliminarse, sino mantenerse con su prioridad y estado para ser consideradas en el futuro."
            },
            {
                "text": "Probar, acordar y financiar las ideas de mejora.",
                "isCorrect": false,
                "rationale": "El CIR registra y gestiona oportunidades de mejora; la prueba, acuerdo y financiación pertenecen a otros procesos (como gestión del cambio o gestión financiera)."
            }
        ]
    },
    {
        "guid": "36b3c99d-c366-4d2f-87df-3d18890487a8",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4.xml",
        "type": "test",
        "question": "¿Qué actividad contribuye al paso \"¿Dónde estamos ahora?\" del modelo de mejora continua?",
        "answerOptions": [
            {
                "text": "Ejecutar acciones de mejora.",
                "isCorrect": false,
                "rationale": "Ejecutar acciones de mejora corresponde a la fase de implementación de la mejora, no a la fase de diagnóstico de la situación actual."
            },
            {
                "text": "Realizar evaluaciones de línea de base.",
                "isCorrect": true,
                "rationale": "Las evaluaciones de línea de base (baseline) permiten entender el estado actual antes de planificar cualquier mejora; encajan directamente con el paso \"¿Dónde estamos ahora?\"."
            },
            {
                "text": "Definir plan de mejora.",
                "isCorrect": false,
                "rationale": "Definir el plan de mejora corresponde a pasos posteriores, cuando ya se han analizado la situación y los objetivos."
            },
            {
                "text": "Comprender la misión del negocio.",
                "isCorrect": false,
                "rationale": "Comprender la misión del negocio está más relacionada con el paso \"¿Dónde queremos estar?\" que con el análisis detallado de la situación actual."
            }
        ]
    },
    {
        "guid": "db8b29cc-45a2-49ec-ba1e-5ced4cce6dd5",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4.xml",
        "type": "test",
        "question": "¿De qué manera contribuye un consumidor de servicios a la reducción del riesgo?",
        "answerOptions": [
            {
                "text": "Al pagar por el servicio.",
                "isCorrect": false,
                "rationale": "El pago traslada ciertos costes al consumidor, pero no contribuye directamente a reducir el riesgo del servicio."
            },
            {
                "text": "Al gestionar el hardware del servidor.",
                "isCorrect": false,
                "rationale": "La gestión del hardware del servidor suele corresponder al proveedor de servicios, no al consumidor."
            },
            {
                "text": "Al comunicar restricciones.",
                "isCorrect": true,
                "rationale": "Cuando el consumidor comunica sus restricciones (por ejemplo, regulatorias o operativas), ayuda al proveedor a gestionar mejor el riesgo y evitar impactos indeseados."
            },
            {
                "text": "Al gestionar la disponibilidad del personal.",
                "isCorrect": false,
                "rationale": "La disponibilidad del personal del proveedor es responsabilidad de éste, no del consumidor; por sí misma no afecta al riesgo del servicio gestionado."
            }
        ]
    },
    {
        "guid": "5303af1b-39de-4efa-b890-3a908e9ea1e3",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4.xml",
        "type": "test",
        "question": "Identifique las palabras que faltan en el siguiente enunciado: \"El uso de (?) deberá respaldar, no reemplazar, lo que se observa, cuando se usa el principio 'Comenzar donde esté'\".",
        "answerOptions": [
            {
                "text": "Una medición.",
                "isCorrect": true,
                "rationale": "El principio guía indica que las mediciones deben apoyar lo que se observa, no sustituirlo; se trata de combinar datos cuantitativos con observación cualitativa."
            },
            {
                "text": "Herramientas.",
                "isCorrect": false,
                "rationale": "Las herramientas son importantes, pero la formulación del principio se refiere específicamente a mediciones, no a herramientas en general."
            },
            {
                "text": "Planes.",
                "isCorrect": false,
                "rationale": "Los planes no son el foco del enunciado; el principio enfatiza la observación real respaldada por mediciones."
            },
            {
                "text": "Un proceso.",
                "isCorrect": false,
                "rationale": "El enunciado oficial de ITIL habla de mediciones, no de procesos, como elemento que debe respaldar y no reemplazar la observación."
            }
        ]
    },
    {
        "guid": "57c6a1cc-e489-441b-a7bb-0892976072e0",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4.xml",
        "type": "test",
        "question": "¿Cuál es un medio para posibilitar la creación conjunta de valor al facilitar los resultados que los clientes deseen obtener sin que estos asuman costos ni riesgos específicos?",
        "answerOptions": [
            {
                "text": "Gestión de Servicios.",
                "isCorrect": false,
                "rationale": "La gestión de servicios es el conjunto de actividades de la organización para gestionar servicios, pero la definición dada en el enunciado corresponde a \"servicio\"."
            },
            {
                "text": "Mejora Continua.",
                "isCorrect": false,
                "rationale": "La mejora continua optimiza servicios y prácticas, pero no es el concepto definido por la frase del enunciado."
            },
            {
                "text": "Un servicio.",
                "isCorrect": true,
                "rationale": "La frase es la definición estándar de \"servicio\" en ITIL 4: un medio para posibilitar la co-creación de valor facilitando resultados sin que el cliente deba gestionar costes y riesgos específicos."
            },
            {
                "text": "Un activo de TI.",
                "isCorrect": false,
                "rationale": "Un activo de TI es un componente que contribuye al servicio, pero no es el medio completo de creación conjunta de valor descrito en la definición."
            }
        ]
    },
    {
        "guid": "5812f0c6-dcab-4521-ab81-c85adc0ac633",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4.xml",
        "type": "test",
        "question": "¿Cuáles son las tres etapas de la gestión del problema?",
        "answerOptions": [
            {
                "text": "Registro de problemas, clasificación de problemas y resolución de problemas.",
                "isCorrect": false,
                "rationale": "Esta secuencia es incompleta y no refleja la estructura formal de la gestión de problemas en ITIL 4."
            },
            {
                "text": "Gestión de incidentes, gestión de problemas y control de cambios.",
                "isCorrect": false,
                "rationale": "Aquí se mezclan prácticas distintas (incidentes y cambios) con gestión de problemas; no son etapas internas de la práctica."
            },
            {
                "text": "Identificación de problemas, control de problemas y control de errores.",
                "isCorrect": true,
                "rationale": "ITIL define la gestión de problemas en tres grandes etapas: identificación, control de problemas y control de errores."
            },
            {
                "text": "Análisis de problemas, identificación de errores y resolución de incidentes.",
                "isCorrect": false,
                "rationale": "Aunque contiene términos relacionados, incluye resolución de incidentes, que pertenece a otra práctica."
            }
        ]
    },
    {
        "guid": "c8e03eea-8fe1-490f-9006-ea7d22494394",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4.xml",
        "type": "test",
        "question": "¿Cuál de las siguientes opciones ejemplifica MEJOR un cambio estándar?",
        "answerOptions": [
            {
                "text": "La revisión y la autorización de un cambio solicitado por el cliente.",
                "isCorrect": false,
                "rationale": "Esto sugiere un cambio normal que requiere evaluación y autorización específica, no un cambio estándar preautorizado."
            },
            {
                "text": "La implementación de un parche en un software crítico como respuesta a una problemática de seguridad de un proveedor.",
                "isCorrect": false,
                "rationale": "Los parches de seguridad críticos suelen tratarse como cambios de emergencia o normales, según el riesgo, no como estándar."
            },
            {
                "text": "La instalación de una aplicación de software como respuesta a una solicitud de servicio.",
                "isCorrect": true,
                "rationale": "La instalación repetitiva, bien documentada y de bajo riesgo es un ejemplo típico de cambio estándar, habitualmente vinculado a solicitudes de servicio."
            },
            {
                "text": "El reemplazo de un componente como respuesta a un incidente mayor.",
                "isCorrect": false,
                "rationale": "Los cambios derivados de incidentes mayores suelen ser normales o de emergencia, dependiendo del impacto y urgencia."
            }
        ]
    },
    {
        "guid": "9360899e-a0a1-4d0a-aa0d-71095c9427a6",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4.xml",
        "type": "test",
        "question": "¿Qué dimensión considera la manera en que deberían protegerse los activos de conocimiento?",
        "answerOptions": [
            {
                "text": "Organizaciones y personas.",
                "isCorrect": false,
                "rationale": "Esta dimensión se centra en estructura organizativa, cultura y competencias, no en la protección de activos de conocimiento como tal."
            },
            {
                "text": "Socios y proveedores.",
                "isCorrect": false,
                "rationale": "Esta dimensión trata sobre relaciones con terceros, contratos y acuerdos, no sobre la protección de los activos de información y conocimiento."
            },
            {
                "text": "Información y tecnología.",
                "isCorrect": true,
                "rationale": "La dimensión \"Información y tecnología\" abarca el tratamiento, almacenamiento y protección de la información y del conocimiento en la organización."
            },
            {
                "text": "Procesos y flujos de valor.",
                "isCorrect": false,
                "rationale": "Esta dimensión se focaliza en cómo se organiza el trabajo y la creación de valor, no específicamente en la protección de activos de conocimiento."
            }
        ]
    },
    {
        "guid": "daef08b2-87a4-454e-994a-2ae0d05dbf1a",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4.xml",
        "type": "test",
        "question": "¿De qué manera la información sobre problemas y errores conocidos contribuye a la gestión de incidentes?",
        "answerOptions": [
            {
                "text": "Permite un diagnóstico rápido y eficiente de los incidentes.",
                "isCorrect": true,
                "rationale": "La base de datos de errores conocidos y problemas ayuda a los agentes a identificar rápidamente causas y soluciones, acelerando la resolución de incidentes."
            },
            {
                "text": "Elimina la necesidad de actualizaciones regulares hacia los clientes.",
                "isCorrect": false,
                "rationale": "Aunque mejora la resolución, no elimina la necesidad de mantener informados a los clientes sobre el estado de sus incidentes."
            },
            {
                "text": "Elimina la necesidad de colaboración durante la resolución de los incidentes.",
                "isCorrect": false,
                "rationale": "La colaboración sigue siendo necesaria, especialmente para incidentes complejos; la información previa no la sustituye."
            },
            {
                "text": "Permite volver a evaluar errores conocidos.",
                "isCorrect": false,
                "rationale": "La reevaluación de errores conocidos forma parte de la gestión de problemas, no es la contribución principal a la gestión de incidentes."
            }
        ]
    },
    {
        "guid": "4b0c226b-4e11-490e-8ab9-3ce57f5f4aa5",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4.xml",
        "type": "test",
        "question": "¿Qué opción describe MEJOR el propósito de la actividad \"mejorar\" de la cadena de valor?",
        "answerOptions": [
            {
                "text": "Organizar una iniciativa de mejora mayor en muchas iniciativas más pequeñas.",
                "isCorrect": false,
                "rationale": "Dividir iniciativas grandes en pequeñas puede ser útil, pero no refleja todo el propósito de la actividad \"mejorar\" en la cadena de valor."
            },
            {
                "text": "Hacer que funciones y servicios, tanto nuevos como mejorados, estén disponibles para unirse.",
                "isCorrect": false,
                "rationale": "Esta descripción se alinea más con actividades de obtención/construcción o despliegue, no con la actividad de mejora continua."
            },
            {
                "text": "Asegurar la comprensión compartida de la visión y el objetivo de mejora para todos los productos y servicios.",
                "isCorrect": false,
                "rationale": "La comprensión de la visión está más relacionada con planificar; la actividad de mejora tiene un alcance más amplio sobre todos los servicios y prácticas."
            },
            {
                "text": "Mejorar de forma continua todos los productos y servicios en todas las actividades de la cadena de valor.",
                "isCorrect": true,
                "rationale": "Ésta es la formulación que mejor encaja con la actividad \"mejorar\": asegurar la mejora continua de productos, servicios y prácticas en todo el sistema de valor."
            }
        ]
    },
    {
        "guid": "971109ff-bcf1-4fa8-9246-29a2dc482782",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4.xml",
        "type": "test",
        "question": "¿Qué se debe hacer siempre antes de automatizar una actividad?",
        "answerOptions": [
            {
                "text": "Comprobar que ya se haya optimizado la actividad.",
                "isCorrect": true,
                "rationale": "El principio \"optimizar y automatizar\" indica que primero se debe optimizar el proceso y, sólo después, automatizarlo; automatizar un proceso ineficiente perpetúa la ineficiencia."
            },
            {
                "text": "Comprobar que se haya comprado tecnologías nuevas adecuadas.",
                "isCorrect": false,
                "rationale": "La compra de tecnología no debe ser el primer paso; la optimización del proceso es previa y prioritaria."
            },
            {
                "text": "Asegurar que DevOps se haya implementado correctamente.",
                "isCorrect": false,
                "rationale": "DevOps es un enfoque útil, pero no es un prerrequisito obligatorio para automatizar una actividad en el contexto de ITIL."
            },
            {
                "text": "Asegurar que la solución elimine la necesidad de intervención humana.",
                "isCorrect": false,
                "rationale": "Eliminar completamente la intervención humana no es un requisito; muchas automatizaciones contemplan supervisión o intervención puntual."
            }
        ]
    },
    {
        "guid": "e2f04df8-da60-494d-ba67-ec9fb0222baf",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4.xml",
        "type": "test",
        "question": "¿Qué es \"garantía\"?",
        "answerOptions": [
            {
                "text": "Certeza de un producto o servicio cumplirá con los requisitos acordados.",
                "isCorrect": true,
                "rationale": "La garantía se refiere a que el servicio cumplirá con niveles acordados de disponibilidad, capacidad, continuidad y seguridad; en resumen, que cumplirá los requisitos acordados."
            },
            {
                "text": "Cantidad de dinero que se gasta en una actividad o un recurso específicos.",
                "isCorrect": false,
                "rationale": "Esto describe un coste, no la garantía."
            },
            {
                "text": "Funcionalidad de un producto o servicio para satisfacer una necesidad particular.",
                "isCorrect": false,
                "rationale": "Esta es la definición de utilidad, no de garantía."
            },
            {
                "text": "Utilidad, importancia y beneficios percibidos de algo.",
                "isCorrect": false,
                "rationale": "Esto se acerca a la definición de valor, no de garantía."
            }
        ]
    },
    {
        "guid": "4f8d6fca-6df5-4feb-8939-221d995904d6",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4.xml",
        "type": "test",
        "question": "¿Cuál de las siguientes prácticas usa técnicas como el análisis SWOT, las revisiones de cuadro de mando integral (balanced scorecard) y las evaluaciones de madurez?",
        "answerOptions": [
            {
                "text": "Gestión de incidentes.",
                "isCorrect": false,
                "rationale": "La gestión de incidentes se centra en restaurar servicios rápidamente, no suele utilizar herramientas de análisis estratégico como SWOT o balanced scorecard."
            },
            {
                "text": "Gestión de problemas.",
                "isCorrect": false,
                "rationale": "Aunque analiza causas raíz, no es la práctica principal asociada a análisis de madurez y cuadros de mando integrales."
            },
            {
                "text": "Mejora continua.",
                "isCorrect": true,
                "rationale": "La práctica de mejora continua utiliza técnicas como SWOT, balanced scorecard y evaluaciones de madurez para identificar oportunidades de mejora y priorizarlas."
            },
            {
                "text": "Gestión de solicitudes de servicio.",
                "isCorrect": false,
                "rationale": "Esta práctica gestiona solicitudes estándar de los usuarios, pero no es la principal usuaria de estas herramientas de análisis estratégico."
            }
        ]
    },
    {
        "guid": "6f217a18-2fc5-4d28-9bb5-11c230079f27",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4.xml",
        "type": "test",
        "question": "¿Qué se define como \"cualquier cambio de estado que es significativo para la gestión de un servicio de TI\"?",
        "answerOptions": [
            {
                "text": "Evento.",
                "isCorrect": true,
                "rationale": "Un evento es precisamente un cambio de estado significativo para la gestión del servicio o de un elemento de configuración."
            },
            {
                "text": "Incidente.",
                "isCorrect": false,
                "rationale": "Un incidente es una interrupción o degradación del servicio, no cualquier cambio de estado significativo."
            },
            {
                "text": "Problema.",
                "isCorrect": false,
                "rationale": "Un problema es la causa subyacente de uno o varios incidentes, no cualquier cambio de estado."
            },
            {
                "text": "Error conocido.",
                "isCorrect": false,
                "rationale": "Un error conocido es un problema analizado con una causa raíz identificada y, normalmente, con una solución temporal documentada."
            }
        ]
    },
    {
        "guid": "6977d150-e3e9-4a1f-aa3f-da2fffcb9dd8",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4.xml",
        "type": "test",
        "question": "¿Cuál es el propósito de la práctica de gestión de relaciones?",
        "answerOptions": [
            {
                "text": "Establecer y promover vínculos entre la organización y otras partes interesadas.",
                "isCorrect": true,
                "rationale": "La gestión de relaciones se encarga de mantener relaciones positivas y productivas con clientes y otras partes interesadas."
            },
            {
                "text": "Analizar las prácticas y los servicios de la organización con las necesidades cambiantes del negocio.",
                "isCorrect": false,
                "rationale": "Esto se acerca más al propósito de la gestión de niveles de servicio o de la mejora continua que a la gestión de relaciones en sí."
            },
            {
                "text": "Definir con claridad los objetivos de desempeño comercial de los servicios.",
                "isCorrect": false,
                "rationale": "La definición de objetivos de desempeño está vinculada a acuerdos de nivel de servicio y a la gestión de niveles de servicio."
            },
            {
                "text": "Respaldar la cantidad acordada de un servicio mediante la gestión de todas las solicitudes de servicio acordadas iniciadas por el usuario.",
                "isCorrect": false,
                "rationale": "Esta descripción se ajusta más a la gestión de solicitudes de servicio que a la gestión de relaciones."
            }
        ]
    },
    {
        "guid": "2c8b91b2-0027-426e-a653-3cfafc490fc3",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4.xml",
        "type": "test",
        "question": "¿Cuál de estas opciones se debería registrar y gestionar como un problema?",
        "answerOptions": [
            {
                "text": "Cuando un usuario solicita la entrega de un equipo de cómputo.",
                "isCorrect": false,
                "rationale": "Esto es una solicitud de servicio estándar, no un problema."
            },
            {
                "text": "Cuando una herramienta de monitoreo detecta un cambio de estado de un servicio.",
                "isCorrect": false,
                "rationale": "Esto es un evento; no necesariamente implica un problema hasta que se interprete su impacto."
            },
            {
                "text": "Cuando el análisis de tendencias muestra un alto número de incidentes similares.",
                "isCorrect": true,
                "rationale": "Una alta recurrencia de incidentes similares indica la posible existencia de una causa raíz común; debe registrarse como problema."
            },
            {
                "text": "Cuando la práctica de mejora continua necesita priorizar una oportunidad de mejora.",
                "isCorrect": false,
                "rationale": "La priorización de oportunidades de mejora pertenece al registro de mejora continua, no a la gestión de problemas."
            }
        ]
    },
    {
        "guid": "60a70ab8-c733-4adb-844f-df27d648717a",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4.xml",
        "type": "test",
        "question": "¿Qué práctica requiere que el personal demuestre excelentes habilidades de servicio al cliente, como empatía e inteligencia emocional?",
        "answerOptions": [
            {
                "text": "Gestión de problemas.",
                "isCorrect": false,
                "rationale": "La gestión de problemas es normalmente una práctica de segundo/tercer nivel, con menos interacción directa con el usuario final."
            },
            {
                "text": "Gestión de proveedores.",
                "isCorrect": false,
                "rationale": "Aunque requiere habilidades de negociación y gestión de contratos, no es la práctica principal centrada en la atención directa al usuario."
            },
            {
                "text": "Gestión de liberaciones.",
                "isCorrect": false,
                "rationale": "Esta práctica se centra en mover versiones de servicios a entornos, con poca interacción directa con usuarios finales."
            },
            {
                "text": "Mesa de servicios.",
                "isCorrect": true,
                "rationale": "La mesa de servicios es el punto de contacto con el usuario; requiere habilidades de comunicación, empatía e inteligencia emocional."
            }
        ]
    },
    {
        "guid": "e74e3448-0ebb-47e7-9413-005759fa5c4e",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4.xml",
        "type": "test",
        "question": "Identifique las palabras que faltan en el siguiente enunciado: \"El propósito de la práctica de gestión de la configuración de servicios consiste en asegurar que la información precisa y confiable sobre la configuración de servicios y los (?) detrás de estos esté disponible en el momento y lugar que se requiera\".",
        "answerOptions": [
            {
                "text": "Proveedores.",
                "isCorrect": false,
                "rationale": "Los proveedores no son el foco directo de la gestión de configuración; esta se centra en elementos internos del servicio."
            },
            {
                "text": "Elementos de configuración.",
                "isCorrect": true,
                "rationale": "La práctica mantiene información sobre servicios y sus elementos de configuración (CI), que son los componentes que los sustentan."
            },
            {
                "text": "Clientes.",
                "isCorrect": false,
                "rationale": "Los clientes son consumidores del servicio, pero la gestión de configuración no se centra en su información."
            },
            {
                "text": "Activos.",
                "isCorrect": false,
                "rationale": "Aunque muchos CI son activos, el término formal usado en la práctica es \"elementos de configuración\"."
            }
        ]
    },
    {
        "guid": "6c6df170-8395-47a7-87f0-dc341d32b7c7",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4.xml",
        "type": "test",
        "question": "¿Cuál es el propósito de la práctica de gestión de seguridad de la información?",
        "answerOptions": [
            {
                "text": "Proteger la información que la organización necesita para llevar a cabo sus actividades empresariales.",
                "isCorrect": true,
                "rationale": "El foco es salvaguardar confidencialidad, integridad y disponibilidad de la información crítica para la organización."
            },
            {
                "text": "Observar los servicios y sus componentes.",
                "isCorrect": false,
                "rationale": "Observar servicios es parte de la monitorización y gestión de eventos, no de la seguridad de la información."
            },
            {
                "text": "Asegurar que la información precisa y confiable sobre la configuración de servicios esté disponible cuando y donde se requiera.",
                "isCorrect": false,
                "rationale": "Esta es la definición de la práctica de gestión de la configuración de servicios."
            },
            {
                "text": "Planificar y gestionar el ciclo de vida completo de todos los activos de TI.",
                "isCorrect": false,
                "rationale": "Esto corresponde a la gestión de activos de TI, no a la seguridad de la información."
            }
        ]
    },
    {
        "guid": "315a4266-2d7d-45f7-9c6b-0268ef21d3c3",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4.xml",
        "type": "test",
        "question": "¿A qué práctica corresponde la gestión y propiedad de problemáticas, consultas y solicitudes de los usuarios?",
        "answerOptions": [
            {
                "text": "Gestión de incidentes.",
                "isCorrect": false,
                "rationale": "La gestión de incidentes gestiona interrupciones, pero la propiedad del contacto con el usuario suele recaer en la mesa de servicios."
            },
            {
                "text": "Mesa de Servicios.",
                "isCorrect": true,
                "rationale": "La mesa de servicios es el punto único de contacto, responsable de la gestión y propiedad de consultas, solicitudes y problemáticas de los usuarios."
            },
            {
                "text": "Control de cambios.",
                "isCorrect": false,
                "rationale": "El control de cambios se centra en la evaluación y autorización de cambios, no en la relación directa con el usuario."
            },
            {
                "text": "Gestión de problemas.",
                "isCorrect": false,
                "rationale": "La gestión de problemas actúa sobre causas raíz técnicas, no sobre la atención global al usuario."
            }
        ]
    },
    {
        "guid": "f5f4f4b7-420d-4c67-98a1-001b7bc73aea",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4.xml",
        "type": "test",
        "question": "¿Qué práctica tiene el propósito de asegurar que los proveedores de una organización y sus niveles de desempeño se gestionan adecuadamente para posibilitar el suministro de productos y servicios de calidad sin interrupciones?",
        "answerOptions": [
            {
                "text": "Gestión de liberaciones.",
                "isCorrect": false,
                "rationale": "La gestión de liberaciones se centra en desplegar versiones de servicios, no en la relación global con proveedores."
            },
            {
                "text": "Gestión de proveedores.",
                "isCorrect": true,
                "rationale": "La gestión de proveedores asegura que los proveedores y sus contratos soportan la entrega continua y de calidad de los servicios."
            },
            {
                "text": "Gestión de servicios.",
                "isCorrect": false,
                "rationale": "La gestión de servicios es un término genérico para todas las actividades de gestión; la práctica concreta aquí es la gestión de proveedores."
            },
            {
                "text": "Gestión de relaciones.",
                "isCorrect": false,
                "rationale": "La gestión de relaciones es más amplia y se centra en las relaciones con todas las partes interesadas, no específicamente en proveedores."
            }
        ]
    },
    {
        "guid": "4a123b6a-b8c1-483f-a2d5-96a09120af6c",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4.xml",
        "type": "test",
        "question": "¿Cuándo se debería hacer una evaluación de riesgos completa y la autorización en el caso de un cambio estándar?",
        "answerOptions": [
            {
                "text": "Cada vez que se implemente el cambio estándar.",
                "isCorrect": false,
                "rationale": "Los cambios estándar están preautorizados; no requieren una evaluación completa de riesgos en cada ejecución."
            },
            {
                "text": "Cuando se crea el procedimiento para el cambio estándar.",
                "isCorrect": true,
                "rationale": "La evaluación de riesgos completa y la autorización se realizan al definir el modelo de cambio estándar, no en cada ejecución repetitiva."
            },
            {
                "text": "Por lo menos una vez al año.",
                "isCorrect": false,
                "rationale": "La frecuencia está ligada a la revisión del modelo o a cambios en el contexto, no necesariamente a un periodo fijo."
            },
            {
                "text": "Cuando se requiere un cambio de emergencia.",
                "isCorrect": false,
                "rationale": "Un cambio de emergencia es un tipo distinto de cambio y requiere su propio proceso de evaluación y autorización urgente."
            }
        ]
    },
    {
        "guid": "4584ef88-a12a-4cbb-88ca-c030c13e02c0",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4.xml",
        "type": "test",
        "question": "¿Qué se debería usar para establecer las expectativas del usuario con respecto a los tiempos de cumplimiento de una solicitud?",
        "answerOptions": [
            {
                "text": "El tiempo que el cliente indica para la entrega del servicio.",
                "isCorrect": false,
                "rationale": "El tiempo deseado por el cliente puede ser irrealista; debe equilibrarse con la capacidad real de la organización."
            },
            {
                "text": "La demanda del servicio por parte del consumidor.",
                "isCorrect": false,
                "rationale": "La demanda influye en la planificación de capacidad, pero no define directamente los tiempos prometidos al usuario."
            },
            {
                "text": "El tiempo necesario para suministrar el servicio de manera realista.",
                "isCorrect": true,
                "rationale": "Los acuerdos de tiempos de cumplimiento deben basarse en lo que la organización puede cumplir de forma fiable y realista."
            },
            {
                "text": "Los niveles de servicio del proveedor.",
                "isCorrect": false,
                "rationale": "Los niveles de servicio del proveedor pueden ser un input, pero las expectativas al usuario deben basarse en compromisos realistas integrados."
            }
        ]
    },
    {
        "guid": "89402982-745b-4566-8864-9127e445dfa1",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4.xml",
        "type": "test",
        "question": "Una organización le pide a una parte interesada revisar un cambio planificado. ¿Qué principio guía demuestra esto?",
        "answerOptions": [
            {
                "text": "Colaborar promover la visibilidad.",
                "isCorrect": true,
                "rationale": "Este principio fomenta la colaboración con las partes interesadas y la transparencia, lo que encaja con solicitarles la revisión de cambios planificados."
            },
            {
                "text": "Comenzar donde esté.",
                "isCorrect": false,
                "rationale": "Este principio trata sobre partir de la situación actual y aprovechar lo que ya existe, no sobre la revisión colaborativa de cambios."
            },
            {
                "text": "Enfocarse en el valor.",
                "isCorrect": false,
                "rationale": "Aunque colaborar aporta valor, el principio concreto que se aplica directamente es el de colaboración y visibilidad."
            },
            {
                "text": "Mantenerlo sencillo y práctico.",
                "isCorrect": false,
                "rationale": "Este principio se centra en evitar complejidad, no en la implicación de partes interesadas para revisar cambios."
            }
        ]
    },
    {
        "guid": "e762ea46-9a55-4987-a530-395351a6d22d",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4.xml",
        "type": "test",
        "question": "¿Qué opción representa un enfoque CORRECTO cuando se aplica el principio guía \"mantenerlo sencillo y práctico\"?",
        "answerOptions": [
            {
                "text": "Solo agregar controles y métricas cuando sean necesarios.",
                "isCorrect": true,
                "rationale": "El principio indica evitar controles, pasos o métricas innecesarias; solo deben añadirse los que aporten valor claro."
            },
            {
                "text": "Diseñar primero controles y métricas, luego eliminar los que no agregan valor.",
                "isCorrect": false,
                "rationale": "Este enfoque tiende a la sobreingeniería inicial, lo contrario de mantenerlo sencillo y práctico."
            },
            {
                "text": "Diseñar controles y métricas, y agregarlos de forma individual hasta implementarlos todos.",
                "isCorrect": false,
                "rationale": "Implementar todos los controles y métricas diseñados sin evaluar su necesidad va contra el principio de simplicidad."
            },
            {
                "text": "Solo agregar controles y métricas que se requieran para fines de conformidad.",
                "isCorrect": false,
                "rationale": "La conformidad es importante, pero puede haber otros controles y métricas sencillas que aportan valor sin ser exigidos normativamente."
            }
        ]
    },
    {
        "guid": "e0ba640a-2803-45c2-aa63-6fca52e0c2a0",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4.xml",
        "type": "test",
        "question": "¿Qué afirmaciones acerca de la práctica de gestión de solicitudes de servicio son CORRECTAS? Seleccione dos opciones:\n1. Las solicitudes de servicio son parte normal de la entrega de servicio\n2. Las quejas se pueden tratar como solicitudes de servicio\n3. Las solicitudes de servicio son el resultado de una falla en un servicio.\n4. Los cambios normales se deberían tratar como solicitudes de servicio",
        "answerOptions": [
            {
                "text": "1 y 2",
                "isCorrect": true,
                "rationale": "Las solicitudes de servicio son parte normal de la entrega del servicio y, en muchos casos, las quejas pueden tramitarse mediante el mismo flujo de gestión de solicitudes."
            },
            {
                "text": "2 y 3",
                "isCorrect": false,
                "rationale": "La afirmación 3 es incorrecta, porque las solicitudes de servicio no se desencadenan por fallos; eso corresponde a incidentes."
            },
            {
                "text": "3 y 4",
                "isCorrect": false,
                "rationale": "Ambas afirmaciones son incorrectas; los cambios normales no deben tramitarse simplemente como solicitudes estándar."
            },
            {
                "text": "1 y 4",
                "isCorrect": false,
                "rationale": "La afirmación 1 es correcta, pero la 4 es incorrecta, ya que los cambios normales siguen su propio proceso de gestión."
            }
        ]
    },
    {
        "guid": "ab25df82-031c-420e-9f79-808a0f7083e9",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4.xml",
        "type": "test",
        "question": "¿Qué práctica mejora la satisfacción del cliente y el usuario al reducir el impacto negativo de las interrupciones de servicio?",
        "answerOptions": [
            {
                "text": "Gestión de solicitudes de servicio.",
                "isCorrect": false,
                "rationale": "La gestión de solicitudes atiende peticiones estándar, pero no es la principal responsable de minimizar el impacto de interrupciones."
            },
            {
                "text": "Gestión de niveles de servicio.",
                "isCorrect": false,
                "rationale": "Define y revisa niveles de servicio, pero la reducción directa del impacto de interrupciones se consigue mediante la gestión de incidentes."
            },
            {
                "text": "Gestión de incidentes.",
                "isCorrect": true,
                "rationale": "La gestión de incidentes busca restaurar el servicio lo antes posible, reduciendo así el impacto en clientes y usuarios."
            },
            {
                "text": "Control de cambios.",
                "isCorrect": false,
                "rationale": "El control de cambios gestiona modificaciones, pero no es su misión principal reducir el impacto de las interrupciones ya ocurridas."
            }
        ]
    },
    {
        "guid": "2ca0316d-c8e2-4868-bdef-22921ffa5a88",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4.xml",
        "type": "test",
        "question": "¿Qué dimensión se relaciona MÁS con las habilidades, las competencias, los roles y las responsabilidades?",
        "answerOptions": [
            {
                "text": "Organizaciones y personas.",
                "isCorrect": true,
                "rationale": "Esta dimensión trata sobre estructura organizativa, cultura, roles, responsabilidades, habilidades y competencias."
            },
            {
                "text": "Información y tecnología.",
                "isCorrect": false,
                "rationale": "Aunque puede requerir competencias técnicas, la dimensión se centra en los activos de información y la tecnología en sí misma."
            },
            {
                "text": "Socios y proveedores.",
                "isCorrect": false,
                "rationale": "Esta dimensión se centra en la relación con terceros, no en las habilidades internas del personal."
            },
            {
                "text": "Procesos y flujos de valor.",
                "isCorrect": false,
                "rationale": "Se refiere a cómo se organiza el trabajo y se crean flujos de valor, más que a las competencias individuales."
            }
        ]
    },
    {
        "guid": "f3d573a8-b50b-4aa1-b2df-990a7df5478d",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4.xml",
        "type": "test",
        "question": "¿En qué situaciones se deberían tener en cuenta los principios guía de ITIL?\n1. En todas las iniciativas\n2. En las relaciones con las partes interesadas\n3. Solo en iniciativas específicas donde el principio sea relevante\n4. Solo en relaciones específicas con partes interesadas donde el principio sea relevante",
        "answerOptions": [
            {
                "text": "1 y 2",
                "isCorrect": true,
                "rationale": "Los principios guía de ITIL son universales y se deben considerar en todas las iniciativas y relaciones con partes interesadas, no solo en casos específicos."
            },
            {
                "text": "2 y 3",
                "isCorrect": false,
                "rationale": "La afirmación 3 limita indebidamente el alcance de los principios guía."
            },
            {
                "text": "3 y 4",
                "isCorrect": false,
                "rationale": "Ambas afirmaciones restringen el uso de los principios guía a contextos concretos, lo cual es contrario a su carácter universal."
            },
            {
                "text": "1 y 4",
                "isCorrect": false,
                "rationale": "La afirmación 1 es correcta, pero la 4 restringe indebidamente la aplicación de los principios."
            }
        ]
    },
    {
        "guid": "49f604ff-e914-4e3c-887e-d4190ff20816",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4.xml",
        "type": "test",
        "question": "¿Cuál de las siguientes opciones es un propósito de la gestión de liberaciones?",
        "answerOptions": [
            {
                "text": "Proteger la información de la organización.",
                "isCorrect": false,
                "rationale": "Esto es propósito de la seguridad de la información, no de la gestión de liberaciones."
            },
            {
                "text": "Gestionar las solicitudes de servicio iniciadas por un usuario.",
                "isCorrect": false,
                "rationale": "Corresponde a la gestión de solicitudes de servicio."
            },
            {
                "text": "Hacer que tanto servicios nuevos como modificados estén disponibles para su uso.",
                "isCorrect": true,
                "rationale": "Éste es el propósito de la gestión de liberaciones: poner en producción servicios nuevos o modificados de forma controlada."
            },
            {
                "text": "Mover el hardware y el software a los entornos de producción.",
                "isCorrect": false,
                "rationale": "Esto se aproxima, pero es más específico de despliegue; la gestión de liberaciones tiene un alcance más amplio, incluyendo planificación y coordinación."
            }
        ]
    },
    {
        "guid": "abf5b4fe-ffd0-4b63-9273-850d1326810b",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4.xml",
        "type": "test",
        "question": "¿Cuál de estas opciones contiene elementos del sistema de valor de un servicio (SVS)?",
        "answerOptions": [
            {
                "text": "Provisión de servicios, consumo de servicios y gestión de relaciones de servicio.",
                "isCorrect": false,
                "rationale": "Esto describe la relación de servicio (provisión y consumo), no los componentes del sistema de valor de servicio."
            },
            {
                "text": "Gobierno, cadena valor del servicio y prácticas.",
                "isCorrect": true,
                "rationale": "El SVS incluye gobierno, cadena de valor del servicio y prácticas, entre otros componentes como los principios guía y la mejora continua."
            },
            {
                "text": "Resultados, utilidad y ganancia.",
                "isCorrect": false,
                "rationale": "Estos términos se relacionan con valor y resultados, pero no describen los componentes del SVS."
            },
            {
                "text": "Valor del cliente, valor de la parte interesada y organización.",
                "isCorrect": false,
                "rationale": "Aunque conectados con el concepto de valor, no son los elementos formales que componen el SVS en ITIL 4."
            }
        ]
    },
    {
        "guid": "e5e253cf-38eb-44a5-9406-e015bcdcfd60",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4.xml",
        "type": "test",
        "question": "¿Qué opción describe los cambios normales?",
        "answerOptions": [
            {
                "text": "Cambios de riesgo bajo y que cuentan con autorización previa.",
                "isCorrect": false,
                "rationale": "Esta es la descripción de los cambios estándar, no de los cambios normales."
            },
            {
                "text": "Cambios que se necesitan programar y evaluar mediante un proceso.",
                "isCorrect": true,
                "rationale": "Los cambios normales requieren evaluación, planificación y autorización a través del proceso de control de cambios."
            },
            {
                "text": "Cambios que a menudo se inician como solicitudes de servicio.",
                "isCorrect": false,
                "rationale": "Esto aplica comúnmente a cambios estándar, que suelen estar asociados a solicitudes de servicio."
            },
            {
                "text": "Cambios que deben implementarse lo antes posible.",
                "isCorrect": false,
                "rationale": "Esta es una característica típica de los cambios de emergencia, no de los normales."
            }
        ]
    },
    {
        "guid": "f74744d6-22ff-47ba-b051-1d01c6a0bc36",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4.xml",
        "type": "test",
        "question": "¿Cuál es un requerimiento clave para lograr un acuerdo de nivel de servicio exitoso?",
        "answerOptions": [
            {
                "text": "Debería estar escrito en lenguaje legal.",
                "isCorrect": false,
                "rationale": "El uso de lenguaje legal suele dificultar la comprensión por parte de usuarios y gestores operativos."
            },
            {
                "text": "Debería estar escrito de manera simple y fácil de entender.",
                "isCorrect": true,
                "rationale": "Los acuerdos de nivel de servicio efectivos deben ser claros y comprensibles para todas las partes."
            },
            {
                "text": "Debería basarse en el punto de vista que el proveedor tiene del servicio.",
                "isCorrect": false,
                "rationale": "Los SLA deben reflejar las necesidades del cliente y el valor entregado, no solo el punto de vista del proveedor."
            },
            {
                "text": "Debería estar relacionado con métricas operacionales simples.",
                "isCorrect": false,
                "rationale": "Las métricas operacionales son útiles, pero el éxito de un SLA depende de métricas alineadas con el valor percibido por el cliente."
            }
        ]
    },
    {
        "guid": "967828f2-36e7-4558-82f1-e2ea35c8bd66",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4.xml",
        "type": "test",
        "question": "¿Qué afirmación acerca de los resultados es CORRECTA?",
        "answerOptions": [
            {
                "text": "Los resultados son uno o más servicios que satisfacen las necesidades de un consumidor de servicios.",
                "isCorrect": false,
                "rationale": "Los resultados (outcomes) no son servicios en sí mismos, sino los efectos logrados por el consumidor al usar los servicios."
            },
            {
                "text": "Los proveedores de servicios ayudan a que los consumidores de servicios perciban los resultados.",
                "isCorrect": true,
                "rationale": "El proveedor facilita los resultados mediante la provisión del servicio, pero los resultados se logran en el contexto del consumidor."
            },
            {
                "text": "Los resultados ayudan a que los consumidores de servicios obtengan salidas.",
                "isCorrect": false,
                "rationale": "En ITIL, las salidas (outputs) son productos tangibles del servicio, mientras que los resultados (outcomes) son efectos y beneficios; la relación no se define en este sentido."
            },
            {
                "text": "Ayudar a los consumidores de servicios a obtener resultados reduce los costos del proveedor de servicios.",
                "isCorrect": false,
                "rationale": "No hay una relación directa ni garantizada entre ayudar a obtener resultados y reducir los costes del proveedor."
            }
        ]
    },
    {
        "guid": "5fc70161-e4f6-4b3a-af7e-8ea57bbd2b48",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4.xml",
        "type": "test",
        "question": "¿Qué se define como cualquier componente que se necesite gestionar para entregar un servicio de TI?",
        "answerOptions": [
            {
                "text": "Una solicitud de servicio.",
                "isCorrect": false,
                "rationale": "La solicitud de servicio es una petición del usuario, no un componente que se gestiona de forma persistente."
            },
            {
                "text": "Un elemento de configuración (CI).",
                "isCorrect": true,
                "rationale": "Un CI es cualquier componente que se necesita gestionar para entregar un servicio de TI (hardware, software, documentación, etc.)."
            },
            {
                "text": "Un incidente.",
                "isCorrect": false,
                "rationale": "Un incidente es un evento que interrumpe o degrada el servicio, no un componente gestionado de forma estable."
            },
            {
                "text": "Un activo de TI.",
                "isCorrect": false,
                "rationale": "Aunque muchos activos de TI son CI, el término formal que responde a la definición es \"elemento de configuración\"."
            }
        ]
    },
    {
        "guid": "d424a1b7-2141-4af8-9740-54de39db31b8",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4.xml",
        "type": "test",
        "question": "¿Qué opción representa una entrada externa en la cadena de valor del servicio?",
        "answerOptions": [
            {
                "text": "La actividad \"mejora\" de la cadena de valor.",
                "isCorrect": false,
                "rationale": "Las actividades de la cadena de valor son componentes internos del sistema de valor del servicio."
            },
            {
                "text": "Un plan general.",
                "isCorrect": false,
                "rationale": "El plan suele considerarse una entrada interna (derivada del gobierno y la estrategia)."
            },
            {
                "text": "Los requerimientos del cliente.",
                "isCorrect": true,
                "rationale": "Los requerimientos del cliente son una entrada externa clave para la cadena de valor del servicio."
            },
            {
                "text": "Los bucles de retroalimentación.",
                "isCorrect": false,
                "rationale": "Los bucles de retroalimentación forman parte del propio sistema de valor y su funcionamiento continuo."
            }
        ]
    },
    {
        "guid": "6d2789ca-1b57-433a-a7d5-4ed98e622f2c",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4.xml",
        "type": "test",
        "question": "¿Cuáles son las habilidades más importantes que debe tener el personal de la mesa de servicio?",
        "answerOptions": [
            {
                "text": "Habilidad para el análisis de incidentes.",
                "isCorrect": false,
                "rationale": "Aunque es útil, el valor clave de la mesa de servicio está más ligado a la interacción con usuarios que al análisis técnico profundo."
            },
            {
                "text": "Habilidades técnicas.",
                "isCorrect": false,
                "rationale": "Se requieren habilidades técnicas básicas, pero la práctica hace más énfasis en capacidades de comunicación y resolución."
            },
            {
                "text": "Habilidades para la resolución de problemas.",
                "isCorrect": true,
                "rationale": "La mesa de servicio debe ser capaz de resolver y encauzar problemas de los usuarios, combinando comunicación, orientación al cliente y capacidad de resolución."
            },
            {
                "text": "Habilidades para las gestiones de proveedores.",
                "isCorrect": false,
                "rationale": "La gestión de proveedores es una práctica distinta, no el foco principal del personal de la mesa de servicio."
            }
        ]
    },
    {
        "guid": "acb549d4-ff6f-47ca-917b-4fd1bd72d597",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4.xml",
        "type": "test",
        "question": "¿Qué métricas de nivel de servicio permiten medir MEJOR la experiencia del usuario?",
        "answerOptions": [
            {
                "text": "Métricas basadas en un único sistema.",
                "isCorrect": false,
                "rationale": "Medir un único sistema no capta necesariamente la experiencia end-to-end del usuario."
            },
            {
                "text": "Métricas para el porcentaje de tiempo de funcionamiento de un servicio.",
                "isCorrect": false,
                "rationale": "El uptime es importante, pero no refleja por sí solo la experiencia percibida por el usuario."
            },
            {
                "text": "Métricas operacionales.",
                "isCorrect": false,
                "rationale": "Las métricas operacionales (CPU, memoria, etc.) describen el comportamiento interno, no la experiencia de usuario."
            },
            {
                "text": "Métricas vinculadas con resultados definidos.",
                "isCorrect": true,
                "rationale": "Las métricas alineadas con los resultados que el usuario desea obtener (outcomes) capturan mejor su experiencia y percepción de valor."
            }
        ]
    },
    {
        "guid": "bcf0f2e1-8b98-439c-8845-66be30111bc0",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4.xml",
        "type": "test",
        "question": "¿Qué afirmación describe MEJOR una práctica de ITIL?",
        "answerOptions": [
            {
                "text": "Un conjunto de recursos organizativos diseñados para realizar un trabajo o lograr un objetivo.",
                "isCorrect": true,
                "rationale": "Esta es la definición oficial de práctica en ITIL 4: un conjunto de recursos organizativos diseñados para realizar un trabajo o lograr un objetivo."
            },
            {
                "text": "Un paso definido de un proceso específico.",
                "isCorrect": false,
                "rationale": "Un paso del proceso forma parte de un flujo concreto, pero no define lo que es una práctica."
            },
            {
                "text": "Una herramienta que soporta la gestión de servicios.",
                "isCorrect": false,
                "rationale": "Las herramientas pueden apoyar prácticas, pero no son prácticas en sí mismas."
            },
            {
                "text": "Una descripción detallada de la manera en que deben modelarse los procesos.",
                "isCorrect": false,
                "rationale": "Esto se aproxima a documentación o políticas, pero no describe el concepto de práctica en ITIL."
            }
        ]
    },
    {
        "guid": "83e076a5-5782-4b12-8429-6254147d031b",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4.xml",
        "type": "test",
        "question": "¿Qué afirmación describe MEJOR la utilidad?",
        "answerOptions": [
            {
                "text": "La funcionalidad que ofrece un servicio para satisfacer una necesidad.",
                "isCorrect": true,
                "rationale": "La utilidad es 'fitness for purpose': la capacidad funcional del servicio para cumplir una necesidad."
            },
            {
                "text": "La garantía de que un servicio cumplirá niveles específicos.",
                "isCorrect": false,
                "rationale": "Esto define la 'garantía', no la utilidad."
            },
            {
                "text": "La percepción del valor total del servicio.",
                "isCorrect": false,
                "rationale": "El valor es la combinación de utilidad y garantía según la percepción del consumidor."
            },
            {
                "text": "La importancia de un servicio para las operaciones del negocio.",
                "isCorrect": false,
                "rationale": "Esta afirmación describe el 'valor' o la 'criticidad', no la utilidad."
            }
        ]
    },
    {
        "guid": "86010188-283a-4d6b-b800-307872ded42f",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4_v2.xml",
        "type": "test",
        "question": "¿Qué principio guía propicia una respuesta más rápida a las necesidades de los clientes mediante actividades con tiempos previamente acordados para su cumplimiento y el aprendizaje a partir de las salidas de actividades anteriores?",
        "answerOptions": [
            {
                "text": "Foco en el valor",
                "isCorrect": false,
                "rationale": "El principio 'foco en el valor' se centra en asegurar que todo lo que hace la organización contribuye al valor percibido por el cliente, pero no menciona explícitamente trabajo iterativo ni aprendizaje basado en ciclos."
            },
            {
                "text": "Progrese de forma iterativa con retroalimentación",
                "isCorrect": true,
                "rationale": "Este principio describe precisamente trabajar en iteraciones con tiempos acotados y aprender de los resultados de las iteraciones anteriores para responder de forma más rápida y ajustada a las necesidades del cliente."
            },
            {
                "text": "Colabore y promueva la visibilidad",
                "isCorrect": false,
                "rationale": "Este principio se centra en la colaboración y la transparencia, no específicamente en dividir el trabajo en actividades iterativas con tiempos acordados."
            },
            {
                "text": "Optimice y automatice",
                "isCorrect": false,
                "rationale": "Hace referencia a mejorar y automatizar procesos, pero no a la idea de avanzar iterativamente con retroalimentación."
            }
        ]
    },
    {
        "guid": "b50a21a2-02b3-4a1e-bdf5-720d53885ecc",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4_v2.xml",
        "type": "test",
        "question": "¿Qué práctica tiene un propósito que incluye maximizar el número de adiciones, modificaciones o eliminaciones exitosas de cualquier aspecto que pueda tener un efecto en un servicio?",
        "answerOptions": [
            {
                "text": "Habilitación del cambio",
                "isCorrect": true,
                "rationale": "La habilitación del cambio (change enablement) tiene como propósito maximizar el número de cambios exitosos asegurando que se evalúan, autorizan y planifican adecuadamente."
            },
            {
                "text": "Mesa de servicios",
                "isCorrect": false,
                "rationale": "La mesa de servicios es el punto de contacto con el usuario, no la práctica responsable de maximizar el éxito de los cambios."
            },
            {
                "text": "Gestión de solicitudes de servicio",
                "isCorrect": false,
                "rationale": "Gestión de solicitudes de servicio se centra en peticiones estándar de los usuarios, no en la gestión integral de cambios que afectan a los servicios."
            },
            {
                "text": "Gestión de incidentes",
                "isCorrect": false,
                "rationale": "Gestión de incidentes se orienta a restaurar el servicio tras interrupciones, no a planificar y controlar cambios."
            }
        ]
    },
    {
        "guid": "904ade54-80ab-43d9-94b6-de2fa18304ca",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4_v2.xml",
        "type": "test",
        "question": "¿En qué situación gestión de incidentes utilizará NORMALMENTE un proceso independiente?",
        "answerOptions": [
            {
                "text": "Cuando no exista un plazo de resolución objetivo",
                "isCorrect": false,
                "rationale": "La ausencia de un plazo objetivo no implica por sí misma un proceso independiente; el proceso de gestión de incidentes sigue siendo el mismo."
            },
            {
                "text": "Cuando debe diagnosticarse la causa",
                "isCorrect": false,
                "rationale": "El diagnóstico de causa raíz es propio de la gestión de problemas, no de un proceso independiente dentro de la gestión de incidentes."
            },
            {
                "text": "Para incidentes de seguridad de la información",
                "isCorrect": true,
                "rationale": "Los incidentes de seguridad de la información suelen tratarse mediante procesos específicos que integran gestión de incidentes y seguridad de la información, por su sensibilidad y requisitos particulares."
            },
            {
                "text": "Para incidentes de bajo impacto",
                "isCorrect": false,
                "rationale": "Los incidentes de bajo impacto suelen seguir el proceso estándar de gestión de incidentes, sin requerir un proceso independiente."
            }
        ]
    },
    {
        "guid": "b57a3395-029c-4fb5-8d09-9d7305e545c6",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4_v2.xml",
        "type": "test",
        "question": "¿Qué práctica minimiza el impacto en la operación normal del servicio al gestionar recursos en respuesta a reducciones no planificadas de la calidad del servicio?",
        "answerOptions": [
            {
                "text": "Habilitación del cambio",
                "isCorrect": false,
                "rationale": "Habilitación del cambio se centra en cambios planificados; la pregunta habla de reducciones no planificadas de la calidad del servicio."
            },
            {
                "text": "Mejora continua",
                "isCorrect": false,
                "rationale": "La mejora continua busca identificar y llevar a cabo mejoras, pero no gestiona en tiempo real reducciones no planificadas de la calidad del servicio."
            },
            {
                "text": "Gestión de niveles de servicio",
                "isCorrect": false,
                "rationale": "Gestión de niveles de servicio supervisa acuerdos y rendimiento global, pero quien responde operativamente a degradaciones es la gestión de incidentes."
            },
            {
                "text": "Gestión de incidentes",
                "isCorrect": true,
                "rationale": "Gestión de incidentes tiene como propósito restaurar la operación normal del servicio lo antes posible cuando hay reducciones no planificadas de la calidad."
            }
        ]
    },
    {
        "guid": "3e1be362-712e-41b8-8996-78b89e808491",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4_v2.xml",
        "type": "test",
        "question": "¿Qué práctica utiliza los métodos de Lean Agile y DevOps?",
        "answerOptions": [
            {
                "text": "Mesa de servicios",
                "isCorrect": false,
                "rationale": "La mesa de servicios puede beneficiarse de estos enfoques, pero no es la práctica citada explícitamente en ITIL como usuaria de Lean, Agile y DevOps."
            },
            {
                "text": "Gestión de incidentes",
                "isCorrect": false,
                "rationale": "Gestión de incidentes no se define en ITIL 4 como una práctica que utilice de forma específica Lean, Agile y DevOps."
            },
            {
                "text": "Mejora continua",
                "isCorrect": true,
                "rationale": "La práctica de mejora continua se apoya explícitamente en enfoques como Lean, Agile y DevOps para impulsar mejoras iterativas y frecuentes."
            },
            {
                "text": "Gestión de problemas",
                "isCorrect": false,
                "rationale": "Gestión de problemas se centra en causas raíz y errores conocidos; no se menciona de forma específica como práctica basada en Lean, Agile y DevOps."
            }
        ]
    },
    {
        "guid": "01e89a96-aa6e-4cd8-80bc-b79174ae6b4a",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4_v2.xml",
        "type": "test",
        "question": "Identifique la palabra que falta en el siguiente enunciado: Patrocinador es el rol que autoriza el presupuesto para el (la) [¿?] de servicios.",
        "answerOptions": [
            {
                "text": "Gestión",
                "isCorrect": false,
                "rationale": "El patrocinador financia el consumo del servicio, no la 'gestión' en abstracto."
            },
            {
                "text": "Provisión",
                "isCorrect": false,
                "rationale": "El proveedor se encarga de la provisión; el patrocinador financia el uso del servicio por parte del consumidor."
            },
            {
                "text": "Valor",
                "isCorrect": false,
                "rationale": "El patrocinador busca valor, pero lo que autoriza explícitamente es el presupuesto para consumir el servicio."
            },
            {
                "text": "Consumo",
                "isCorrect": true,
                "rationale": "Según ITIL 4, el patrocinador es quien autoriza el presupuesto para el consumo de servicios."
            }
        ]
    },
    {
        "guid": "a4496345-af2b-4fd6-a87d-b3faefebdea6",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4_v2.xml",
        "type": "test",
        "question": "¿Qué afirmación sobre las ofertas de servicios es CORRECTA?",
        "answerOptions": [
            {
                "text": "Las ofertas de servicios describen como proveedores y consumidores cooperan para cocrear valor",
                "isCorrect": false,
                "rationale": "Esta descripción encaja mejor con la relación de servicio, no con la oferta de servicios."
            },
            {
                "text": "Cada servicio debería ser descrito a los consumidores como una única oferta de servicios",
                "isCorrect": false,
                "rationale": "Un mismo servicio puede soportar múltiples ofertas de servicio adaptadas a distintos segmentos de clientes."
            },
            {
                "text": "El mismo producto puede servir de base para más de una oferta de servicios",
                "isCorrect": true,
                "rationale": "ITIL 4 indica que un producto puede soportar varias ofertas de servicio dirigidas a diferentes grupos de consumidores."
            },
            {
                "text": "Las ofertas de servicios incluyen la transferencia de bienes del consumidor hacia el proveedor",
                "isCorrect": false,
                "rationale": "Las ofertas de servicio pueden incluir bienes, acceso a recursos y acciones de servicio suministradas por el proveedor, no bienes transferidos desde el consumidor."
            }
        ]
    },
    {
        "guid": "1390e2ce-402a-4927-b54b-83210e71f39f",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4_v2.xml",
        "type": "test",
        "question": "¿Para cuál de las siguientes opciones se utiliza un calendario de cambios?",
        "answerOptions": [
            {
                "text": "Acelerar la planificación y autorización de los cambios de emergencia",
                "isCorrect": false,
                "rationale": "Los cambios de emergencia se gestionan por vías específicas y no son el objetivo principal del calendario de cambios."
            },
            {
                "text": "Proporcionar un medio para iniciar y evaluar los cambios normales",
                "isCorrect": false,
                "rationale": "La iniciación y evaluación de cambios normales se gestiona mediante el proceso de habilitación del cambio, no exclusivamente con el calendario."
            },
            {
                "text": "Realizar el seguimiento y gestionar ideas de mejora desde la identificación hasta la acción final",
                "isCorrect": false,
                "rationale": "Esto es el propósito del registro de mejora continua (CIR), no del calendario de cambios."
            },
            {
                "text": "Proporcionar información sobre los cambios implementados para ayudar a gestionar incidentes y problemas",
                "isCorrect": true,
                "rationale": "El calendario de cambios (change schedule) ofrece visibilidad de cambios pasados y futuros, útil para la gestión de incidentes y problemas."
            }
        ]
    },
    {
        "guid": "5580e103-c829-4381-b4b7-d746094eb250",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4_v2.xml",
        "type": "test",
        "question": "¿Qué afirmación sobre los flujos de valores es CORRECTA?",
        "answerOptions": [
            {
                "text": "Cada flujo de valor debe diseñarse para una situación especifica",
                "isCorrect": true,
                "rationale": "Un flujo de valor se diseña para un propósito o escenario específico, como la provisión de un servicio concreto o la gestión de una solicitud particular."
            },
            {
                "text": "Cada flujo de valor debe incluir proveedores o socios",
                "isCorrect": false,
                "rationale": "Algunos flujos de valor pueden no requerir relación directa con proveedores o socios."
            },
            {
                "text": "Cada flujo de valor debe incluir todas las 34 prácticas de ITIL",
                "isCorrect": false,
                "rationale": "Solo se utilizan las prácticas necesarias para ese flujo; no es obligatorio incluir todas las prácticas."
            },
            {
                "text": "Cada flujo de valor debe incluir todas las seis actividades de la cadena de valor",
                "isCorrect": false,
                "rationale": "Un flujo de valor puede utilizar solo algunas de las actividades de la cadena de valor del servicio."
            }
        ]
    },
    {
        "guid": "9295460f-1a33-4aaf-a071-4737a865cdf9",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4_v2.xml",
        "type": "test",
        "question": "¿Cuál de las opciones siguientes forma parte de la propuesta de valor de un servicio?",
        "answerOptions": [
            {
                "text": "Riesgos que el servicio impone al consumidor",
                "isCorrect": false,
                "rationale": "La propuesta de valor destaca, entre otros, los riesgos que el servicio ayuda a reducir o eliminar, no los que impone."
            },
            {
                "text": "Costos que el servicio elimina al consumidor",
                "isCorrect": true,
                "rationale": "La propuesta de valor incluye beneficios como los costos que el servicio ayuda a evitar o eliminar para el consumidor."
            },
            {
                "text": "Salidas del servicio recibidas por el consumidor",
                "isCorrect": false,
                "rationale": "Las salidas (outputs) forman parte del servicio, pero la propuesta de valor pone énfasis en el valor percibido, incluyendo costes y riesgos eliminados."
            },
            {
                "text": "Costos que el servicio impone al consumidor",
                "isCorrect": false,
                "rationale": "Los costos impuestos reducen el valor percibido; no son un elemento positivo de la propuesta de valor."
            }
        ]
    },
    {
        "guid": "d4de8348-bce3-4766-8e0c-b391751cc56d",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4_v2.xml",
        "type": "test",
        "question": "¿Por qué un gerente de niveles de servicio debería realizar revisiones periódicas del servicio?",
        "answerOptions": [
            {
                "text": "Para capturar información sobre las problemáticas y el desempeño del servicio con respecto a los objetivos acordados",
                "isCorrect": true,
                "rationale": "Las revisiones de servicio se utilizan para revisar el rendimiento real frente a los objetivos acordados y registrar problemáticas y desviaciones."
            },
            {
                "text": "Para recopilar información sobre las metas y objetivos de los consumidores de servicios",
                "isCorrect": false,
                "rationale": "Conocer las metas de los consumidores es importante, pero se suele tratar en la definición o revisión de SLAs, no es el objetivo principal de todas las revisiones de servicio."
            },
            {
                "text": "Para asegurar que los acuerdos están redactados de forma sencilla y son fáciles de entender",
                "isCorrect": false,
                "rationale": "La redacción clara es deseable, pero no es el motivo principal de realizar revisiones periódicas del servicio."
            },
            {
                "text": "Para asegurar la mejora continua de los servicios, de modo que respondan a las necesidades cambiantes de los consumidores de servicios",
                "isCorrect": false,
                "rationale": "La mejora continua se apoya en la información de las revisiones, pero el propósito inmediato de estas es evaluar desempeño y problemas frente a los acuerdos."
            }
        ]
    },
    {
        "guid": "b3c28f7e-39a9-486b-9ce4-11e1a945ffa9",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4_v2.xml",
        "type": "test",
        "question": "Un defecto en una aplicación puede provocar que un servicio falle. El personal de TI está analizando activamente la aplicación para tratar de entender qué sucede. ¿Cuál es el nombre correcto de este tipo de defecto?",
        "answerOptions": [
            {
                "text": "Evento",
                "isCorrect": false,
                "rationale": "Un evento es cualquier cambio de estado significativo para la gestión del servicio, no necesariamente un defecto en análisis."
            },
            {
                "text": "Error conocido",
                "isCorrect": false,
                "rationale": "Un error conocido requiere que ya se haya identificado la causa raíz y, normalmente, una solución temporal; aquí aún se está analizando."
            },
            {
                "text": "Problema",
                "isCorrect": true,
                "rationale": "Un problema es la causa o causa potencial de uno o más incidentes; mientras se analiza un defecto que puede provocar fallas, se trata de un problema."
            },
            {
                "text": "Incidente",
                "isCorrect": false,
                "rationale": "Un incidente es una interrupción o degradación del servicio, no el defecto subyacente en análisis."
            }
        ]
    },
    {
        "guid": "9c613d02-71e6-4178-a277-b7611795068b",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4_v2.xml",
        "type": "test",
        "question": "¿Qué actividad de la cadena de valor asegura que la actividad de servicio continuo cumple las expectativas de los usuarios?",
        "answerOptions": [
            {
                "text": "Participar",
                "isCorrect": false,
                "rationale": "La actividad 'participar' se centra en la interacción y entendimiento de las partes interesadas, no en la prestación continua del servicio."
            },
            {
                "text": "Entregar y apoyar",
                "isCorrect": true,
                "rationale": "La actividad 'entregar y apoyar' se encarga de la prestación continua de los servicios de acuerdo con las especificaciones y expectativas de los usuarios."
            },
            {
                "text": "Planear",
                "isCorrect": false,
                "rationale": "La actividad 'planear' establece visión y dirección, pero no gestiona la prestación diaria del servicio."
            },
            {
                "text": "Obtener construir",
                "isCorrect": false,
                "rationale": "Esta actividad se centra en obtener y crear componentes y servicios, no en asegurar la prestación continua a los usuarios finales."
            }
        ]
    },
    {
        "guid": "50948f92-1565-485f-a607-63a4a2ae2e3b",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4_v2.xml",
        "type": "test",
        "question": "¿Qué propósito de la práctica incluye la creación de relaciones más estrechas y colaborativas?",
        "answerOptions": [
            {
                "text": "Gestión de proveedores",
                "isCorrect": true,
                "rationale": "La gestión de proveedores tiene como propósito asegurar relaciones productivas, colaborativas y de confianza con los proveedores."
            },
            {
                "text": "Gestión de la configuración de servicios",
                "isCorrect": false,
                "rationale": "Gestión de la configuración de servicios se centra en la información sobre servicios y CI, no en la relación con terceros."
            },
            {
                "text": "Gestión de la seguridad de la información",
                "isCorrect": false,
                "rationale": "Su propósito es proteger la información crítica, no establecer relaciones colaborativas con proveedores."
            },
            {
                "text": "Gestión de liberaciones",
                "isCorrect": false,
                "rationale": "Se ocupa de poner nuevas versiones en uso, pero no tiene como objetivo principal la creación de relaciones colaborativas."
            }
        ]
    },
    {
        "guid": "85e9d4ae-9a58-4ba2-baba-0f478646178b",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4_v2.xml",
        "type": "test",
        "question": "¿Cuáles DOS de las siguientes opciones son entradas para el sistema de valor del servicio? \n1. Demanda\n2. Productos\n3. Valor\n4. Oportunidad",
        "answerOptions": [
            {
                "text": "1 y 4",
                "isCorrect": true,
                "rationale": "Las entradas del sistema de valor del servicio (SVS) son 'oportunidad' y 'demanda'; de él sale 'valor'."
            },
            {
                "text": "3 y 4",
                "isCorrect": false,
                "rationale": "El valor es una salida del SVS, no una entrada; solo 'oportunidad' y 'demanda' son entradas."
            },
            {
                "text": "2 y 3",
                "isCorrect": false,
                "rationale": "Los productos se consideran parte de la oferta, no entradas al sistema de valor; el valor es una salida."
            },
            {
                "text": "1 y 2",
                "isCorrect": false,
                "rationale": "Solo la demanda es una entrada; los productos no son una entrada al sistema de valor del servicio."
            }
        ]
    },
    {
        "guid": "120fa313-ba3f-475e-8092-37e414dc0c31",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4_v2.xml",
        "type": "test",
        "question": "¿Qué rol sería el más adecuado para alguien con amplia experiencia de trabajo en roles de TI y del negocio? También tiene experiencia en la gestión de las relaciones con diversas partes interesadas, incluidos proveedores y gerentes del negocio",
        "answerOptions": [
            {
                "text": "Autoridad de cambios",
                "isCorrect": false,
                "rationale": "La autoridad de cambios decide sobre la aprobación de cambios, pero no necesariamente necesita experiencia amplia en relaciones con clientes y proveedores."
            },
            {
                "text": "Analista de problemas",
                "isCorrect": false,
                "rationale": "El analista de problemas se centra en el análisis técnico y de causas raíz, no tanto en gestionar relaciones múltiples."
            },
            {
                "text": "Gerente de niveles de servicio",
                "isCorrect": true,
                "rationale": "Este rol actúa como enlace entre TI y negocio, y requiere una fuerte capacidad de gestionar relaciones con clientes, proveedores y otras partes interesadas."
            },
            {
                "text": "Agente de la mesa de servicios",
                "isCorrect": false,
                "rationale": "La mesa de servicios requiere habilidades de comunicación, pero el escenario descrito apunta a un rol más estratégico como el gerente de niveles de servicio."
            }
        ]
    },
    {
        "guid": "fa2f4468-4813-4bc8-9806-92eb2ef6778c",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4_v2.xml",
        "type": "test",
        "question": "¿Qué representa la adición, modificación o eliminación de cualquier aspecto que pueda afectar a los servicios?",
        "answerOptions": [
            {
                "text": "Un incidente",
                "isCorrect": false,
                "rationale": "Un incidente es una interrupción o degradación de un servicio, no un cambio planificado en sus componentes."
            },
            {
                "text": "Un problema",
                "isCorrect": false,
                "rationale": "Un problema es la causa o causa potencial de uno o más incidentes, no una modificación en el servicio."
            },
            {
                "text": "Un cambio",
                "isCorrect": true,
                "rationale": "Un cambio es cualquier adición, modificación o eliminación de algo que pueda afectar a los servicios."
            },
            {
                "text": "Un evento",
                "isCorrect": false,
                "rationale": "Un evento es un cambio de estado significativo para la gestión, pero no necesariamente una modificación planificada del servicio."
            }
        ]
    },
    {
        "guid": "8cb9b4d2-58cf-4389-bb30-4ad5655f8aa2",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4_v2.xml",
        "type": "test",
        "question": "¿Qué principio guía recomienda tener en cuenta las cuatro dimensiones para que algo sea tan eficaz y útil como debe ser?",
        "answerOptions": [
            {
                "text": "Optimice y automatice",
                "isCorrect": false,
                "rationale": "Este principio se centra en simplificar y automatizar, pero no hace referencia directa a las cuatro dimensiones."
            },
            {
                "text": "Piense y trabaje holísticamente",
                "isCorrect": true,
                "rationale": "Este principio indica que se deben considerar todas las dimensiones y perspectivas relevantes para que las soluciones sean eficaces y útiles."
            },
            {
                "text": "Comience donde se encuentre",
                "isCorrect": false,
                "rationale": "Se refiere a partir del estado actual y reutilizar lo existente, no a considerar explícitamente las cuatro dimensiones."
            },
            {
                "text": "Foco en el valor",
                "isCorrect": false,
                "rationale": "Aunque el valor es central, este principio no enfatiza directamente las cuatro dimensiones como factor clave."
            }
        ]
    },
    {
        "guid": "ebd76be3-d7ea-48eb-9e76-ae91efb9dcd0",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4_v2.xml",
        "type": "test",
        "question": "¿Qué práctica es MÁS PROBABLE que haga uso de inteligencia artificial, automatización robótica de procesos y chatbots?",
        "answerOptions": [
            {
                "text": "Mesa de servicios",
                "isCorrect": true,
                "rationale": "La mesa de servicios suele incorporar chatbots, RPA e IA para dar soporte a los usuarios de forma más rápida y eficiente."
            },
            {
                "text": "Mejora continua",
                "isCorrect": false,
                "rationale": "Puede usar análisis de datos, pero no es la práctica más asociada con chatbots y RPA orientados al usuario."
            },
            {
                "text": "Gestión de incidentes",
                "isCorrect": false,
                "rationale": "Se beneficia de automatización, pero la interacción usuario–sistema mediante chatbots se encuadra sobre todo en la mesa de servicios."
            },
            {
                "text": "Gestión de problemas",
                "isCorrect": false,
                "rationale": "Gestiona causas raíz y análisis profundo; la IA puede ayudar, pero no es la práctica más típica para chatbots."
            }
        ]
    },
    {
        "guid": "e923d162-addc-4835-8695-caccf2dabdf6",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4_v2.xml",
        "type": "test",
        "question": "¿Qué es un problema que se ha analizado, pero no se ha resuelto?",
        "answerOptions": [
            {
                "text": "Error conocido",
                "isCorrect": true,
                "rationale": "Un error conocido es un problema cuya causa raíz ha sido identificada y, normalmente, con una solución temporal documentada, aunque no se haya resuelto definitivamente."
            },
            {
                "text": "Solución temporal",
                "isCorrect": false,
                "rationale": "La solución temporal es el workaround aplicado, no el problema en sí mismo."
            },
            {
                "text": "Evento",
                "isCorrect": false,
                "rationale": "Un evento es un cambio de estado significativo, no un problema analizado."
            },
            {
                "text": "Incidente",
                "isCorrect": false,
                "rationale": "Un incidente es la interrupción o degradación del servicio, no el problema subyacente analizado."
            }
        ]
    },
    {
        "guid": "bda9c149-d2dd-4b0c-9336-0ed3384be658",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4_v2.xml",
        "type": "test",
        "question": "¿Qué se describe en la dimensión 'organizaciones y personas' de la gestión de servicios?",
        "answerOptions": [
            {
                "text": "Contratos y acuerdos",
                "isCorrect": false,
                "rationale": "Los contratos y acuerdos pertenecen principalmente a la dimensión 'socios y proveedores'."
            },
            {
                "text": "Comunicación y colaboración",
                "isCorrect": true,
                "rationale": "La dimensión 'organizaciones y personas' incluye cultura, roles, responsabilidades, comunicación y colaboración."
            },
            {
                "text": "Entradas y salidas",
                "isCorrect": false,
                "rationale": "Entradas y salidas se relacionan con los flujos de valor y procesos, no con la dimensión de personas."
            },
            {
                "text": "Flujos de trabajo y controles",
                "isCorrect": false,
                "rationale": "Los flujos de trabajo y controles pertenecen a la dimensión de 'procesos y flujos de valor'."
            }
        ]
    },
    {
        "guid": "3c86fd9e-d550-40c7-8b5f-f35d3584f0e1",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4_v2.xml",
        "type": "test",
        "question": "¿Qué facilita los resultados que los clientes desean conseguir?",
        "answerOptions": [
            {
                "text": "Organización",
                "isCorrect": false,
                "rationale": "La organización habilita la provisión, pero el concepto que facilita directamente los resultados es el servicio."
            },
            {
                "text": "Servicio",
                "isCorrect": true,
                "rationale": "ITIL 4 define 'servicio' como un medio para posibilitar la co-creación de valor facilitando los resultados que los clientes desean obtener."
            },
            {
                "text": "Activo de TI",
                "isCorrect": false,
                "rationale": "Los activos de TI son componentes del servicio, pero por sí mismos no facilitan directamente los resultados de negocio."
            },
            {
                "text": "Garantía",
                "isCorrect": false,
                "rationale": "La garantía describe el nivel de rendimiento asegurado del servicio, pero no es el medio completo para facilitar resultados."
            }
        ]
    },
    {
        "guid": "00db0a31-edcb-4bfe-b5d8-0273ff09dac2",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4_v2.xml",
        "type": "test",
        "question": "¿Qué práctica recomienda que las organizaciones desarrollen competencias en técnicas como análisis de fortalezas, oportunidades, debilidades y amenazas (FODA) y cuadros de mando integral?",
        "answerOptions": [
            {
                "text": "Habilitación del cambio",
                "isCorrect": false,
                "rationale": "Habilitación del cambio se centra en controlar cambios; estas técnicas estratégicas no son su foco principal."
            },
            {
                "text": "Mejora continua",
                "isCorrect": true,
                "rationale": "La práctica de mejora continua utiliza técnicas como FODA y cuadros de mando integral para evaluar el rendimiento y priorizar mejoras."
            },
            {
                "text": "Gestión de incidentes",
                "isCorrect": false,
                "rationale": "Gestión de incidentes busca restaurar servicios, no suele utilizar estas herramientas de análisis estratégico."
            },
            {
                "text": "Gestión de solicitudes de servicio",
                "isCorrect": false,
                "rationale": "Esta práctica gestiona peticiones estándar y no es la principal usuaria de estas técnicas."
            }
        ]
    },
    {
        "guid": "321937c7-c4a3-485e-acd0-134392dc1f77",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4_v2.xml",
        "type": "test",
        "question": "¿Qué concepto de ITIL ayuda a una organización a tomar buenas decisiones?",
        "answerOptions": [
            {
                "text": "Cadena de valor del servicio",
                "isCorrect": false,
                "rationale": "La cadena de valor describe cómo se crea valor, pero no es el concepto principal diseñado para guiar decisiones en todos los contextos."
            },
            {
                "text": "Prácticas",
                "isCorrect": false,
                "rationale": "Las prácticas describen cómo se realiza el trabajo, pero no son, por sí solas, guías de decisión generales."
            },
            {
                "text": "Principios guía",
                "isCorrect": true,
                "rationale": "Los principios guía proporcionan recomendaciones universales y perdurables que ayudan a tomar decisiones en múltiples situaciones."
            },
            {
                "text": "Cuatro dimensiones de la gestión de servicios",
                "isCorrect": false,
                "rationale": "Las cuatro dimensiones ayudan a tener una visión completa, pero los principios guía son los que orientan las decisiones."
            }
        ]
    },
    {
        "guid": "db20d421-9813-4f56-bda3-e629a1264021",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4_v2.xml",
        "type": "test",
        "question": "¿Cuál de las siguientes opciones es una recomendación para aplicar el principio guía 'manténgalo simple y práctico'?",
        "answerOptions": [
            {
                "text": "Si una práctica es más fácil de seguir, es más probable que se adopte",
                "isCorrect": true,
                "rationale": "Este enunciado refleja la idea de que la simplicidad favorece la adopción, alineado con el principio de mantenerlo simple y práctico."
            },
            {
                "text": "A veces, no hay nada del estado actual que pueda reutilizarse",
                "isCorrect": false,
                "rationale": "Esto se opone al espíritu de 'comience donde se encuentre', que recomienda reaprovechar lo que funciona."
            },
            {
                "text": "Comuníquese de forma que el público pueda escuchar",
                "isCorrect": false,
                "rationale": "Esta recomendación se alinea mejor con 'colabore y promueva la visibilidad'."
            },
            {
                "text": "Rápido no es sinónimo de incompleto",
                "isCorrect": false,
                "rationale": "Este mensaje encaja más con 'progrese de forma iterativa con retroalimentación'."
            }
        ]
    },
    {
        "guid": "25c93481-f6f8-4f47-bf71-fb0978c0b472",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4_v2.xml",
        "type": "test",
        "question": "¿Qué práctica tiene un propósito que incluye la respuesta a las condiciones que podrían provocar fallas o incidentes potenciales?",
        "answerOptions": [
            {
                "text": "Gestión de solicitudes de servicio",
                "isCorrect": false,
                "rationale": "Gestiona peticiones estándar de los usuarios, no se centra en responder a condiciones de fallo potencial."
            },
            {
                "text": "Gestión de problemas",
                "isCorrect": false,
                "rationale": "Se ocupa de causas raíz de incidentes existentes, no de la detección temprana a partir de eventos."
            },
            {
                "text": "Gestión de incidentes",
                "isCorrect": false,
                "rationale": "Responde a incidentes ya ocurridos, no a condiciones previas detectadas como eventos."
            },
            {
                "text": "Monitoreo y gestión de eventos",
                "isCorrect": true,
                "rationale": "Su propósito es observar servicios y CI, y responder a eventos, incluidos aquellos que indican fallas o incidentes potenciales."
            }
        ]
    },
    {
        "guid": "0a772bf2-a27c-4ee7-9a8f-0040ef999035",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4_v2.xml",
        "type": "test",
        "question": "¿Qué rol sería el más adecuado para un recién graduado con grandes niveles de empatía y entendimiento de las problemáticas del negocio? También tiene buenas habilidades de comunicación, elevada inteligencia emocional y un amplio entendimiento de la tecnología de TI",
        "answerOptions": [
            {
                "text": "Agente de la mesa de servicios",
                "isCorrect": true,
                "rationale": "El papel de agente de mesa de servicios requiere empatía, habilidades de comunicación, inteligencia emocional y comprensión básica de la tecnología."
            },
            {
                "text": "Analista de problemas",
                "isCorrect": false,
                "rationale": "Este rol se centra más en el análisis técnico profundo que en la interacción directa y constante con usuarios."
            },
            {
                "text": "Autoridad de cambios",
                "isCorrect": false,
                "rationale": "La autoridad de cambios requiere experiencia y responsabilidad sobre aprobaciones de alto impacto, menos adecuado para un recién graduado."
            },
            {
                "text": "Gerente de niveles de servicio",
                "isCorrect": false,
                "rationale": "Este rol es más estratégico y requiere experiencia previa en gestión de relaciones y servicios."
            }
        ]
    },
    {
        "guid": "c8523da6-c290-4c86-91f2-a3bea7e4d9e2",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4_v2.xml",
        "type": "test",
        "question": "¿Qué práctica fomenta los vínculos con las partes interesadas a nivel estratégico y táctico?",
        "answerOptions": [
            {
                "text": "Gestión de proveedores",
                "isCorrect": false,
                "rationale": "Gestión de proveedores se focaliza en relaciones con proveedores, no con todas las partes interesadas."
            },
            {
                "text": "Gestión de niveles de servicio",
                "isCorrect": false,
                "rationale": "Se centra en acuerdos y niveles de servicio, no en la gestión global de relaciones con todas las partes interesadas."
            },
            {
                "text": "Mejora continua",
                "isCorrect": false,
                "rationale": "Mejora continua usa el feedback de las partes interesadas, pero no es la práctica principal para fomentar vínculos a nivel estratégico y táctico."
            },
            {
                "text": "Gestión de relaciones",
                "isCorrect": true,
                "rationale": "La gestión de relaciones mantiene y fortalece vínculos con clientes y otras partes interesadas a niveles estratégico y táctico."
            }
        ]
    },
    {
        "guid": "45e1512c-257a-4ebd-ac4b-3f0649340e9a",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4_v2.xml",
        "type": "test",
        "question": "¿Cuál de las siguientes opciones es una forma de aplicar el principio guía 'foco en el valor'?",
        "answerOptions": [
            {
                "text": "Comprendiendo la totalidad, pero sin dejar de avanzar",
                "isCorrect": false,
                "rationale": "Esta formulación encaja mejor con 'piense y trabaje holísticamente' combinado con trabajo iterativo."
            },
            {
                "text": "Reconociendo la complejidad de los sistemas",
                "isCorrect": false,
                "rationale": "Se relaciona más con el pensamiento sistémico y el trabajo holístico, no con el foco directo en el valor."
            },
            {
                "text": "Haciendo menos cosas, pero haciéndolas mejor",
                "isCorrect": false,
                "rationale": "Se asocia a simplificación y priorización, alineado con 'manténgalo simple y práctico'."
            },
            {
                "text": "Entendiendo como los consumidores de servicios utilizan los servicios",
                "isCorrect": true,
                "rationale": "Comprender cómo el consumidor usa el servicio permite centrar las decisiones en el valor que realmente obtiene."
            }
        ]
    },
    {
        "guid": "20409144-3850-4c9d-987d-62e12887bafd",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4_v2.xml",
        "type": "test",
        "question": "¿Cuál de las siguientes opciones NO está recomendada por el principio guía 'comience donde se encuentre'?",
        "answerOptions": [
            {
                "text": "Recopilar datos directamente de la fuente",
                "isCorrect": false,
                "rationale": "Recopilar datos fiables de la fuente es coherente con comenzar desde una comprensión realista del estado actual."
            },
            {
                "text": "Construir algo completamente nuevo",
                "isCorrect": true,
                "rationale": "El principio recomienda reutilizar y aprovechar lo existente; construir algo totalmente nuevo sin considerar lo actual va en su contra."
            },
            {
                "text": "Plantear preguntas que parezcan estúpidas",
                "isCorrect": false,
                "rationale": "Hacer preguntas abiertas y básicas ayuda a comprender el estado actual y evitar suposiciones."
            },
            {
                "text": "Identificar que está disponible para ser aprovechado",
                "isCorrect": false,
                "rationale": "Identificar activos, capacidades y procesos existentes es precisamente una recomendación del principio."
            }
        ]
    },
    {
        "guid": "df635044-63eb-4e5e-aa50-0d32da27eebb",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4_v2.xml",
        "type": "test",
        "question": "¿Cuál de las opciones siguientes es un uso de un registro de mejora continua?",
        "answerOptions": [
            {
                "text": "Describir los servicios diseñados para cumplir con las necesidades de un grupo de consumidores",
                "isCorrect": false,
                "rationale": "Esto corresponde al catálogo de servicios, no al registro de mejora continua."
            },
            {
                "text": "Planificar los cambios, asistir en la comunicación, evitar conflictos y asignar recursos",
                "isCorrect": false,
                "rationale": "Esas funciones son propias del calendario de cambios y de la habilitación del cambio."
            },
            {
                "text": "Realizar el seguimiento y gestionar ideas de mejora desde la identificación hasta la acción final",
                "isCorrect": true,
                "rationale": "Éste es precisamente el uso del registro de mejora continua (CIR): gestionar el ciclo de vida de las ideas de mejora."
            },
            {
                "text": "Seleccionar el método modelo o técnica adecuados para identificar mejoras",
                "isCorrect": false,
                "rationale": "Esto forma parte de la práctica de mejora continua, pero no del uso del registro en sí."
            }
        ]
    },
    {
        "guid": "83a2a097-3178-461f-be58-2e549a03af08",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4_v2.xml",
        "type": "test",
        "question": "¿Qué práctica utiliza procedimientos predefinidos y estandarizados para habilitar la comunicación clara de los plazos de cumplimiento?",
        "answerOptions": [
            {
                "text": "Gestión de solicitudes de servicio",
                "isCorrect": true,
                "rationale": "La gestión de solicitudes de servicio se basa en procedimientos estándar con plazos definidos, que pueden comunicarse claramente a los usuarios."
            },
            {
                "text": "Gestión de problemas",
                "isCorrect": false,
                "rationale": "La gestión de problemas no suele trabajar con plazos estándar de cumplimiento comunicados al usuario de la misma forma que las solicitudes de servicio."
            },
            {
                "text": "Gestión de incidentes",
                "isCorrect": false,
                "rationale": "Aunque existen objetivos de resolución, no se basa en procedimientos tan estandarizados y repetibles como en las solicitudes de servicio."
            },
            {
                "text": "Gestión de niveles de servicio",
                "isCorrect": false,
                "rationale": "Define objetivos y acuerdos, pero no gestiona directamente el cumplimiento de cada solicitud."
            }
        ]
    },
    {
        "guid": "c608e6b5-55df-4ec9-b794-fabfb9561812",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4_v2.xml",
        "type": "test",
        "question": "¿Cuáles DOS de las opciones siguientes son consideraciones de la habilitación del cambio?\n1. Gestionar los aspectos del cambio relacionados con las personas\n2. Asegurar que las transformaciones organizacionales son exitosas\n3. Maximizar el número de cambios de servicio exitosos\n4. Asegurar que los cambios se evalúen adecuadamente",
        "answerOptions": [
            {
                "text": "1 y 2",
                "isCorrect": false,
                "rationale": "Estas consideraciones pertenecen más a la gestión del cambio organizacional que a la habilitación del cambio en ITIL."
            },
            {
                "text": "2 y 3",
                "isCorrect": false,
                "rationale": "La 2 es organizacional; la 3 sí es propia de habilitación del cambio, pero esta combinación no es correcta."
            },
            {
                "text": "3 y 4",
                "isCorrect": true,
                "rationale": "Habilitación del cambio busca maximizar cambios exitosos y asegurar que los cambios se evalúan adecuadamente antes de su implementación."
            },
            {
                "text": "1 y 4",
                "isCorrect": false,
                "rationale": "La 4 sí encaja, pero la 1 corresponde a gestión del cambio organizacional, no a habilitación del cambio en ITIL."
            }
        ]
    },
    {
        "guid": "ea9f5753-e911-492d-bf0d-df5947332bc9",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4_v2.xml",
        "type": "test",
        "question": "¿Cómo puede un consumidor de servicios contribuir con la reducción del riesgo?",
        "answerOptions": [
            {
                "text": "Al gestionar el nivel de riesgo detallado en representación del proveedor de servicios",
                "isCorrect": false,
                "rationale": "La gestión detallada del riesgo es responsabilidad del proveedor, no del consumidor."
            },
            {
                "text": "Al entender plenamente sus propios requerimientos para el servicio",
                "isCorrect": true,
                "rationale": "Si el consumidor entiende y comunica bien sus requisitos, ayuda al proveedor a diseñar y operar el servicio con un riesgo mejor controlado."
            },
            {
                "text": "Al proveer el servicio de acuerdo con los requerimientos",
                "isCorrect": false,
                "rationale": "Proveer el servicio es responsabilidad del proveedor, no del consumidor."
            },
            {
                "text": "Al asegurar que los recursos del proveedor de servicios están correctamente configurados",
                "isCorrect": false,
                "rationale": "La configuración de los recursos del proveedor también es parte de la responsabilidad del proveedor."
            }
        ]
    },
    {
        "guid": "6a4c051d-dd29-4851-bb42-b8fcdff7bb7a",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4_v2.xml",
        "type": "test",
        "question": "¿En qué caso se registraría un problema?",
        "answerOptions": [
            {
                "text": "Cuando se identifica la causa, pero no se resuelve",
                "isCorrect": false,
                "rationale": "En este punto el problema ya está identificado y suele considerarse error conocido; el registro del problema normalmente se hace antes, al detectar patrones de incidentes."
            },
            {
                "text": "Cuando un usuario informa de una interrupción no planificada del servicio",
                "isCorrect": false,
                "rationale": "Esto desencadena normalmente un incidente, no un problema directamente."
            },
            {
                "text": "Tras identificar y documentar una solución temporal",
                "isCorrect": false,
                "rationale": "La solución temporal se asocia con errores conocidos; el problema ya debería estar registrado."
            },
            {
                "text": "Tras el análisis de la información sobre errores de un proveedor",
                "isCorrect": true,
                "rationale": "Si un proveedor informa de errores que pueden afectar al servicio, se puede registrar proactivamente un problema para gestionarlos antes de que generen incidentes."
            }
        ]
    },
    {
        "guid": "04604199-d17f-4e16-bcc3-6c03bdf24f1c",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4_v2.xml",
        "type": "test",
        "question": "Identifique la palabra que falta en el siguiente enunciado. El propósito de la práctica de gestión de la configuración de servicios consiste en asegurar que la información precisa y confiable sobre la configuración de (¿?) y los elementos de configuración (CI) que los soportan, esté disponible en el momento y lugar que se requiera.",
        "answerOptions": [
            {
                "text": "Resultados",
                "isCorrect": false,
                "rationale": "Los resultados son efectos logrados por los consumidores, no el foco de la configuración gestionada."
            },
            {
                "text": "Organizaciones",
                "isCorrect": false,
                "rationale": "La práctica se centra en servicios y CI, no en la estructura organizativa."
            },
            {
                "text": "Relaciones",
                "isCorrect": false,
                "rationale": "Las relaciones entre CI son parte del modelo, pero el término que falta en la definición es 'servicios'."
            },
            {
                "text": "Servicios",
                "isCorrect": true,
                "rationale": "La definición estándar habla de la configuración de servicios y los CI que los soportan."
            }
        ]
    },
    {
        "guid": "cd71ff37-b30b-405b-9298-a9c2b556eab7",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4_v2.xml",
        "type": "test",
        "question": "¿Qué práctica ayuda a asegurar que los servicios que se entregan a los clientes están alineados con sus necesidades?",
        "answerOptions": [
            {
                "text": "Gestión de niveles de servicio",
                "isCorrect": true,
                "rationale": "Su propósito es establecer, documentar y gestionar objetivos claros de servicio alineados con las necesidades del cliente."
            },
            {
                "text": "Gestión de solicitudes de servicio",
                "isCorrect": false,
                "rationale": "Gestiona peticiones específicas, pero no define ni mantiene el alineamiento global de los servicios con las necesidades del cliente."
            },
            {
                "text": "Habilitación del cambio",
                "isCorrect": false,
                "rationale": "Se centra en cambios individuales, no en el alineamiento de los servicios con las necesidades del cliente."
            },
            {
                "text": "Gestión de problemas",
                "isCorrect": false,
                "rationale": "Se orienta a causas raíz de incidentes, no a la definición de niveles de servicio alineados con el negocio."
            }
        ]
    },
    {
        "guid": "47153e22-5907-4dc7-b726-cec4846752b7",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4_v2.xml",
        "type": "test",
        "question": "¿Qué decisiones de gestión de solicitudes de servicio requieren que las políticas sean establecidas?",
        "answerOptions": [
            {
                "text": "Decidir cómo manejar las solicitudes de servicio cuando los pasos son desconocidos",
                "isCorrect": false,
                "rationale": "Los pasos desconocidos indicarían que no es una solicitud estándar; esto se resuelve más por procesos que por políticas."
            },
            {
                "text": "Decidir que solicitudes de servicio requieren aprobación",
                "isCorrect": true,
                "rationale": "Es necesario establecer políticas claras sobre qué solicitudes requieren aprobación y en qué condiciones."
            },
            {
                "text": "Decidir cuando deberían utilizarse soluciones temporales",
                "isCorrect": false,
                "rationale": "El uso de soluciones temporales está más relacionado con gestión de incidentes y problemas."
            },
            {
                "text": "Decidir cómo se resuelven las degradaciones del servicio",
                "isCorrect": false,
                "rationale": "Las degradaciones se abordan principalmente mediante gestión de incidentes, no como solicitudes de servicio."
            }
        ]
    },
    {
        "guid": "c3c97161-5cfd-45be-bade-48af9818213c",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4_v2.xml",
        "type": "test",
        "question": "¿Qué dimensión de la gestión de servicios tiene en cuenta como se coordinan las actividades?",
        "answerOptions": [
            {
                "text": "Procesos y flujos de valor",
                "isCorrect": true,
                "rationale": "Esta dimensión aborda cómo se coordinan las actividades, flujos de trabajo y procesos para crear valor."
            },
            {
                "text": "Organizaciones y personas",
                "isCorrect": false,
                "rationale": "Se centra en roles, cultura, habilidades y estructura, no en la coordinación detallada de actividades."
            },
            {
                "text": "Información y tecnología",
                "isCorrect": false,
                "rationale": "Trata de los sistemas, herramientas y datos, no directamente de la coordinación del trabajo."
            },
            {
                "text": "Socios y proveedores",
                "isCorrect": false,
                "rationale": "Se ocupa de la relación con terceros, no de la coordinación de actividades internas de extremo a extremo."
            }
        ]
    },
    {
        "guid": "e9f1bfbb-b48b-4045-9b57-8bcdb9863ed9",
        "subjectId": "T24",
        "difficulty": 1,
        "origin": "itilv4_v2.xml",
        "type": "test",
        "question": "Un usuario se pone en contacto con la mesa de servicios para preguntar cómo puede crear un informe. ¿Qué práctica es MÁS PROBABLE que contribuya a resolver esta problemática?",
        "answerOptions": [
            {
                "text": "Gestión de incidentes",
                "isCorrect": false,
                "rationale": "No se trata de una interrupción o degradación del servicio, sino de una solicitud de información o ayuda estándar."
            },
            {
                "text": "Gestión de solicitudes de servicio",
                "isCorrect": true,
                "rationale": "Las solicitudes de información o asesoramiento son un tipo de solicitud de servicio y se gestionan mediante esta práctica."
            },
            {
                "text": "Habilitación del cambio",
                "isCorrect": false,
                "rationale": "No se requiere un cambio en el servicio o infraestructura para explicar cómo crear un informe."
            },
            {
                "text": "Gestión de niveles de servicio",
                "isCorrect": false,
                "rationale": "Define y supervisa acuerdos de nivel de servicio, pero no resuelve solicitudes individuales de ayuda de usuario."
            }
        ]
    }
]