[
  {
    "guid": "c96d2d76-a2e4-44fa-bbb4-68ed722165cf",
    "subjectId": "T20",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "Según ITIL v3, ¿cuál es la principal diferencia entre el Portafolio de Servicios y el Catálogo de Servicios?",
    "answerOptions": [
      {
        "text": "El Portafolio contiene solo los servicios activos y retirados, mientras que el Catálogo incluye los servicios en fase de diseño.",
        "isCorrect": false,
        "rationale": "Esta opción describe incorrectamente el contenido de ambos. El Portafolio es más amplio y no excluye los servicios en diseño."
      },
      {
        "text": "El Catálogo de Servicios es una vista para el cliente de los servicios del Portafolio que están activos o disponibles para su despliegue.",
        "isCorrect": true,
        "rationale": "El Catálogo es efectivamente una parte del Portafolio, presentando específicamente aquellos servicios que están operativos y son visibles para el negocio o los clientes."
      },
      {
        "text": "El Portafolio de Servicios es una base de datos técnica, mientras que el Catálogo de Servicios es un documento contractual.",
        "isCorrect": false,
        "rationale": "Ni el Portafolio es meramente una base de datos técnica ni el Catálogo es un contrato en sí mismo, aunque la información del Catálogo se use para definir SLAs."
      },
      {
        "text": "No existe diferencia; ambos términos se utilizan indistintamente para referirse a los servicios disponibles para el cliente.",
        "isCorrect": false,
        "rationale": "ITIL establece una distinción clara y fundamental entre estos dos conceptos; el Portafolio gestiona el ciclo de vida completo de todos los servicios."
      }
    ],
    "hint": "Piensa en el ciclo de vida completo de un servicio, desde la idea hasta su retirada."
  },
  {
    "guid": "d38330ec-6022-4efb-9d27-265bbf2aad68",
    "subjectId": "T20",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "Un servicio de tramitación online es funcionalmente perfecto, permitiendo realizar todas las gestiones necesarias (fitness for purpose). Sin embargo, sufre caídas frecuentes y es lento en horas punta. ¿Qué componente del valor del servicio está fallando principalmente?",
    "answerOptions": [
      {
        "text": "La Utilidad (Utility), porque el rendimiento afecta a su propósito.",
        "isCorrect": false,
        "rationale": "La Utilidad se refiere a 'lo que hace' el servicio, y en este caso, el servicio cumple su función. El problema reside en 'cómo lo hace'."
      },
      {
        "text": "La Garantía (Warranty), ya que no cumple con los niveles adecuados de disponibilidad y capacidad.",
        "isCorrect": true,
        "rationale": "La Garantía (fitness for use) se centra en aspectos como la disponibilidad, capacidad, continuidad y seguridad, que son los que fallan en el escenario descrito."
      },
      {
        "text": "Los Activos del Servicio, porque faltan recursos de hardware.",
        "isCorrect": false,
        "rationale": "La falta de recursos puede ser la causa raíz del problema, pero el componente de valor que se ve directamente afectado es la Garantía."
      },
      {
        "text": "La Capacidad (Capability), porque el personal no sabe gestionar los picos de demanda.",
        "isCorrect": false,
        "rationale": "Aunque la gestión del personal es una capacidad, el fallo que experimenta el usuario final se mide y define dentro del concepto de Garantía."
      }
    ],
    "hint": "El valor de un servicio se compone de dos elementos clave: lo que hace y qué tan bien lo hace."
  },
  {
    "guid": "2e7f8c03-eae3-429f-95d0-62532bc0d5e6",
    "subjectId": "T20",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "¿En qué fase del ciclo de vida de ITIL se encuentra el proceso de Gestión de la Demanda (Demand Management)?",
    "answerOptions": [
      {
        "text": "En la fase de Diseño del Servicio, porque dimensiona la capacidad necesaria.",
        "isCorrect": false,
        "rationale": "Aunque la Gestión de la Demanda proporciona información crucial para el Diseño, su origen y propósito estratégico se sitúan en una fase anterior."
      },
      {
        "text": "En la fase de Estrategia del Servicio, porque busca entender y alinear el consumo de servicios con los objetivos del negocio.",
        "isCorrect": true,
        "rationale": "Este proceso es estratégico por naturaleza, ya que analiza los patrones de negocio (PBA) para influir y gestionar la demanda antes de diseñar la solución técnica."
      },
      {
        "text": "En la fase de Operación del Servicio, porque gestiona la demanda en tiempo real.",
        "isCorrect": false,
        "rationale": "En Operación se gestionan los eventos y la carga de trabajo diaria, pero el proceso estratégico de análisis de patrones y planificación de la demanda es anterior."
      },
      {
        "text": "En la fase de Transición del Servicio, ya que prepara el servicio para soportar la demanda prevista.",
        "isCorrect": false,
        "rationale": "La Transición se enfoca en el despliegue y puesta en marcha del servicio, basándose en los requisitos de demanda ya definidos en fases previas."
      }
    ],
    "hint": "Este proceso es una de las trampas clásicas en los exámenes, ya que su nombre puede llevar a confusión sobre su ubicación en el ciclo de vida."
  },
  {
    "guid": "4806a3f0-4c56-4344-8e7d-e619ace2c64a",
    "subjectId": "T20",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "El Ayuntamiento detecta que durante la primera semana de cada mes hay un pico masivo de solicitudes de un trámite específico. Según la Gestión de la Demanda, ¿cómo se denomina a este comportamiento recurrente del negocio?",
    "answerOptions": [
      {
        "text": "Paquete de Utilidad de Servicio (SUA).",
        "isCorrect": false,
        "rationale": "El SUA no es el patrón de comportamiento, sino la combinación de recursos y capacidades asignados para responder a dicho patrón."
      },
      {
        "text": "Patrón de Actividad del Negocio (PBA).",
        "isCorrect": true,
        "rationale": "Un PBA es precisamente un patrón de comportamiento de los usuarios o del negocio que se repite en el tiempo y que la Gestión de la Demanda debe analizar."
      },
      {
        "text": "Modelo de Demanda.",
        "isCorrect": false,
        "rationale": "Un Modelo de Demanda es un concepto más amplio que se construye a partir del análisis de uno o varios PBA, pero el patrón en sí tiene un nombre específico."
      },
      {
        "text": "Requisito de Nivel de Servicio (SLR).",
        "isCorrect": false,
        "rationale": "Un SLR es un requisito del cliente para un servicio, que podría incluir la necesidad de soportar picos, pero no es el nombre del patrón de comportamiento."
      }
    ],
    "hint": "Este concepto clave de la Gestión de la Demanda describe 'cómo se comporta el usuario a lo largo del tiempo'."
  },
  {
    "guid": "91ab781f-2429-4d2e-9f23-571820f7214c",
    "subjectId": "T20",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "En el contexto de un ayuntamiento, el servicio de tramitación de licencias es el servicio principal que aporta valor directo al ciudadano. La plataforma de firma electrónica, que es indispensable para que las licencias se puedan tramitar, se clasificaría como un:",
    "answerOptions": [
      {
        "text": "Servicio Core (Core service).",
        "isCorrect": false,
        "rationale": "El servicio core es el que entrega el valor principal y final al cliente, en este caso, la tramitación de licencias."
      },
      {
        "text": "Servicio Habilitador (Enabling service).",
        "isCorrect": true,
        "rationale": "Este tipo de servicio es necesario para que el servicio core pueda funcionar, pero no es el servicio que el cliente consume directamente para obtener el valor final."
      },
      {
        "text": "Servicio de Mejora (Enhancing service).",
        "isCorrect": false,
        "rationale": "Un servicio de mejora añade valor o atractivo al servicio core, pero no es esencial para su funcionamiento básico, como lo es la firma electrónica en este caso."
      },
      {
        "text": "Servicio Interno de Tipo I.",
        "isCorrect": false,
        "rationale": "El tipo de proveedor (Tipo I, II, III) es una clasificación diferente a la que se refiere a la relación del servicio con el valor entregado (core, enabling, enhancing)."
      }
    ],
    "hint": "Piensa si este servicio es el objetivo final del usuario o un medio necesario para alcanzar ese objetivo."
  },
  {
    "guid": "b5ef4b19-534f-4f6f-b581-0399bd3e231a",
    "subjectId": "T20",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "¿Cuál de las siguientes afirmaciones describe mejor la responsabilidad del rol de Business Relationship Manager (BRM)?",
    "answerOptions": [
      {
        "text": "Negociar, acordar y monitorizar los Acuerdos de Nivel de Servicio (SLA) con los clientes.",
        "isCorrect": false,
        "rationale": "Esta es la responsabilidad principal del Service Level Manager, un rol de la fase de Diseño del Servicio, no de Estrategia."
      },
      {
        "text": "Gestionar el presupuesto de TI y realizar la imputación de costes a las áreas de negocio.",
        "isCorrect": false,
        "rationale": "Estas tareas corresponden al Financial Manager for IT Services, otro rol dentro de la fase de Estrategia."
      },
      {
        "text": "Mantener una relación estratégica con el negocio para entender sus necesidades y asegurar que los servicios TI aportan valor.",
        "isCorrect": true,
        "rationale": "El BRM actúa como el puente estratégico entre TI y el negocio, centrándose en el valor y la satisfacción desde una perspectiva de alto nivel."
      },
      {
        "text": "Ser el responsable final de un servicio específico a lo largo de todo su ciclo de vida, desde su creación hasta su retirada.",
        "isCorrect": false,
        "rationale": "Esta definición corresponde al rol de Service Owner (Propietario del Servicio)."
      }
    ],
    "hint": "Este rol se enfoca más en la relación y la comprensión de las necesidades estratégicas que en los acuerdos operativos detallados."
  },
  {
    "guid": "cd043a55-1563-4d02-917d-9d4bb519fa8b",
    "subjectId": "T20",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "¿Cuál de los siguientes procesos NO pertenece a la fase de Estrategia del Servicio de ITIL?",
    "answerOptions": [
      {
        "text": "Gestión Financiera para Servicios TI.",
        "isCorrect": false,
        "rationale": "Este es uno de los cinco procesos fundamentales de la fase de Estrategia, encargado de la gestión de presupuestos, costes y, opcionalmente, la imputación."
      },
      {
        "text": "Gestión del Portafolio de Servicios.",
        "isCorrect": false,
        "rationale": "Este proceso es central en la Estrategia, ya que gestiona el ciclo de vida completo de todos los servicios de la organización."
      },
      {
        "text": "Gestión de la Relación con el Negocio (BRM).",
        "isCorrect": false,
        "rationale": "Este es un proceso clave de la Estrategia, enfocado en alinear los servicios de TI con las necesidades y objetivos del negocio."
      },
      {
        "text": "Gestión de la Disponibilidad.",
        "isCorrect": true,
        "rationale": "Este proceso, junto con la gestión de capacidad, continuidad y seguridad, pertenece a la fase de Diseño del Servicio, donde se definen los aspectos técnicos de la garantía."
      }
    ],
    "hint": "La Estrategia define el 'qué' y el 'porqué', mientras que otra fase se encarga del 'cómo' técnico."
  },
  {
    "guid": "6e6d510d-ff17-43dc-9395-14887dacc2a2",
    "subjectId": "T20",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "Según el material, en la administración pública, ¿qué componente de la Gestión Financiera para Servicios TI es menos común o no suele aplicarse?",
    "answerOptions": [
      {
        "text": "El presupuesto (budgeting).",
        "isCorrect": false,
        "rationale": "La elaboración de presupuestos es una actividad fundamental y obligatoria en cualquier organización, incluida la administración pública."
      },
      {
        "text": "La contabilidad de costes (costing/accounting).",
        "isCorrect": false,
        "rationale": "Conocer los costes de los servicios es esencial para la toma de decisiones y la transparencia, por lo que es una práctica habitual."
      },
      {
        "text": "La imputación de costes (charging).",
        "isCorrect": true,
        "rationale": "La práctica de 'cobrar' o facturar internamente a otros departamentos por los servicios TI no es habitual en el sector público, donde los costes suelen estar centralizados."
      },
      {
        "text": "El análisis de retorno de la inversión (ROI).",
        "isCorrect": false,
        "rationale": "Aunque puede ser más complejo de calcular en el sector público, el análisis de valor y coste-beneficio es una parte importante de la toma de decisiones."
      }
    ],
    "hint": "Piensa en cómo se financian los departamentos de TI en una entidad como un ayuntamiento."
  },
  {
    "guid": "c1160bc1-26f0-4a71-b11d-102613ed6a97",
    "subjectId": "T20",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "Una organización de TI que proporciona servicios a múltiples unidades de negocio dentro de la misma empresa (como el IMI para el Ajuntament de Barcelona) se clasifica como un proveedor de servicios de:",
    "answerOptions": [
      {
        "text": "Tipo I (Proveedor de servicios interno).",
        "isCorrect": false,
        "rationale": "Un proveedor de Tipo I normalmente está integrado dentro de una única unidad de negocio a la que sirve, no a varias de forma centralizada."
      },
      {
        "text": "Tipo II (Unidad de servicios compartidos).",
        "isCorrect": true,
        "rationale": "Este modelo describe a una unidad central que da soporte a varias otras unidades de negocio dentro de la misma organización, optimizando recursos y capacidades."
      },
      {
        "text": "Tipo III (Proveedor de servicios externo).",
        "isCorrect": false,
        "rationale": "Un proveedor de Tipo III es una organización externa contratada para prestar servicios, como una consultora o una empresa de outsourcing."
      },
      {
        "text": "Tipo Mixto (Proveedor de servicios híbrido).",
        "isCorrect": false,
        "rationale": "Aunque una organización puede usar un modelo mixto (internos y externos), el proveedor centralizado interno que sirve a varios departamentos tiene una clasificación específica en ITIL."
      }
    ],
    "hint": "Considera si el proveedor está dentro de la organización y a cuántas partes de la misma atiende."
  },
  {
    "guid": "fe5df3a3-25e0-4aa6-a56c-8115f2b147a7",
    "subjectId": "T20",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "El principal resultado (output) que la fase de Estrategia del Servicio entrega a la fase de Diseño del Servicio es:",
    "answerOptions": [
      {
        "text": "Un Catálogo de Servicios completamente funcional y operativo.",
        "isCorrect": false,
        "rationale": "El Catálogo se gestiona y detalla en la fase de Diseño. La Estrategia define qué servicios entrarán en él, pero no lo crea en su forma final."
      },
      {
        "text": "Los Acuerdos de Nivel de Servicio (SLA) firmados con los clientes.",
        "isCorrect": false,
        "rationale": "Los SLAs se definen y negocian durante la fase de Diseño, aunque se basan en los objetivos de valor establecidos en la Estrategia."
      },
      {
        "text": "Requisitos estratégicos, un portafolio actualizado y los 'business cases' de los servicios.",
        "isCorrect": true,
        "rationale": "La Estrategia proporciona la dirección: define los servicios a crear o modificar, su justificación (business case) y los requisitos de valor que el Diseño debe materializar."
      },
      {
        "text": "Planes de despliegue y comunicación para los nuevos servicios.",
        "isCorrect": false,
        "rationale": "Estos planes son un resultado característico de la fase de Transición del Servicio, que se ocupa de la puesta en producción."
      }
    ],
    "hint": "La Estrategia define el 'qué', y le pasa a la siguiente fase la información necesaria para que defina el 'cómo'."
  },

  
  {
    "guid": "36479431-9bbd-4d71-8ae4-1c0b5c269831",
    "subjectId": "T20",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Segons ITIL, quina és la definició correcta de 'valor del servei'?",
    "answerOptions": [
      {
        "text": "Només la capacitat del servei per complir les seves funcions (utilitat).",
        "isCorrect": false,
        "rationale": "Aquesta definició és incompleta, ja que omet un component crucial relacionat amb la qualitat i el bon funcionament del servei."
      },
      {
        "text": "La suma de la utilitat ('fitness for purpose') i la garantia ('fitness for use').",
        "isCorrect": true,
        "rationale": "Aquesta opció combina correctament els dos components essencials que defineixen el valor: que el servei faci el que es necessita i que ho faci de manera fiable."
      },
      {
        "text": "Principalment la garantia, que inclou disponibilitat, capacitat i seguretat.",
        "isCorrect": false,
        "rationale": "Tot i que la garantia és fonamental, un servei molt fiable però que no compleix la funció desitjada no aporta valor."
      },
      {
        "text": "El valor definit en els Acords de Nivell de Servei (SLA).",
        "isCorrect": false,
        "rationale": "Els SLA mesuren el rendiment de la garantia, però el concepte de valor es defineix a un nivell més estratègic i conceptual."
      }
    ],
    "hint": "El valor es compon de dues parts: el que fa el servei i com de bé ho fa."
  },
  {
    "guid": "3d0efafe-6eb4-4730-b134-df051eaeb332",
    "subjectId": "T20",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "En quin component del Portfoli de Serveis es trobaria una nova proposta de servei que encara està en fase d'anàlisi i disseny?",
    "answerOptions": [
      {
        "text": "En els Serveis Retirats (Retired Services).",
        "isCorrect": false,
        "rationale": "Aquesta secció conté serveis que ja no estan actius, no serveis futurs."
      },
      {
        "text": "En el Catàleg de Serveis (Service Catalogue).",
        "isCorrect": false,
        "rationale": "El Catàleg només mostra els serveis que ja estan operatius i disponibles per als usuaris."
      },
      {
        "text": "En el Pipeline de Serveis (Service Pipeline).",
        "isCorrect": true,
        "rationale": "Aquesta és la secció del portfoli dedicada a gestionar tots els serveis que estan en fase de proposta, definició o desenvolupament, abans de passar a producció."
      },
      {
        "text": "En el Business Case del servei.",
        "isCorrect": false,
        "rationale": "El Business Case justifica la creació del servei, però no és el contenidor on es gestiona dins del portfoli."
      }
    ],
    "hint": "Pensa en la part del portfoli que mira cap al futur i a les idees noves."
  },
  {
    "guid": "f5a175c2-5ad0-4d51-adf5-ea6d9397b8ec",
    "subjectId": "T20",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "El procés de Gestió de la Demanda (Demand Management) pertany a quina fase del cicle de vida d'ITIL?",
    "answerOptions": [
      {
        "text": "Disseny del Servei.",
        "isCorrect": false,
        "rationale": "És un error comú situar-lo aquí. Aquesta fase dissenya la capacitat, però la gestió estratègica de la demanda es decideix abans."
      },
      {
        "text": "Transició del Servei.",
        "isCorrect": false,
        "rationale": "Aquesta fase s'encarrega de desplegar els serveis, no de gestionar estratègicament l'ús que se'n farà."
      },
      {
        "text": "Operació del Servei.",
        "isCorrect": false,
        "rationale": "Encara que l'Operació gestiona la càrrega diària, la comprensió i influència sobre els patrons de negoci és una activitat estratègica."
      },
      {
        "text": "Estratègia del Servei.",
        "isCorrect": true,
        "rationale": "Aquest procés és clau en l'Estratègia perquè busca entendre i influir en la demanda del client per alinear-la amb la capacitat del proveïdor de serveis."
      }
    ],
    "hint": "Aquest procés analitza els patrons d'activitat del negoci per prendre decisions a llarg termini."
  },
  {
    "guid": "2419c6ef-34a6-4110-bd03-422aab0aab2f",
    "subjectId": "T20",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Un ajuntament decideix analitzar els pics de sol·licituds de tràmits durant la campanya de la renda per dimensionar correctament els seus servidors. Aquesta anàlisi correspon al concepte de:",
    "answerOptions": [
      {
        "text": "Paquets d'Utilitat de Servei (SUA).",
        "isCorrect": false,
        "rationale": "El SUA és la resposta a l'anàlisi de la demanda, no l'anàlisi en si mateixa. Representa els recursos assignats."
      },
      {
        "text": "Gestió del Catàleg de Serveis.",
        "isCorrect": false,
        "rationale": "La gestió del catàleg s'enfoca a mantenir la informació dels serveis actius, no a analitzar el seu comportament d'ús."
      },
      {
        "text": "Patrons d'Activitat del Negoci (PBA).",
        "isCorrect": true,
        "rationale": "Aquest concepte es refereix precisament a l'anàlisi de com i quan els usuaris utilitzen els serveis, identificant cicles i pics de demanda."
      },
      {
        "text": "Gestió de Nivell de Servei (SLM).",
        "isCorrect": false,
        "rationale": "L'SLM se centra a definir i monitorar els acords de nivell de servei, no en l'anàlisi dels patrons de demanda del negoci."
      }
    ],
    "hint": "Estem parlant d'identificar el comportament recurrent dels usuaris al llarg del temps."
  },
  {
    "guid": "8e4b9e3a-4f30-4401-885f-c5acf1c04e16",
    "subjectId": "T20",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Quina és la diferència fonamental entre 'Recursos' i 'Capacitats' segons ITIL?",
    "answerOptions": [
      {
        "text": "Els recursos són interns i les capacitats són externes.",
        "isCorrect": false,
        "rationale": "Tant els recursos com les capacitats són actius interns del proveïdor de serveis."
      },
      {
        "text": "Els recursos són els diners i el personal, mentre que les capacitats són el maquinari i el software.",
        "isCorrect": false,
        "rationale": "Aquesta opció barreja els conceptes; el maquinari també es considera un recurs."
      },
      {
        "text": "Els recursos són els actius tangibles (diners, personal, tecnologia) i les capacitats són les habilitats intangibles (processos, coneixement).",
        "isCorrect": true,
        "rationale": "Aquesta distinció és clau: els recursos són 'el que tens' i les capacitats són 'el que saps fer' amb aquests recursos."
      },
      {
        "text": "Els recursos són gestionats per la Gestió Financera i les capacitats per la Gestió de la Demanda.",
        "isCorrect": false,
        "rationale": "Tots dos són gestionats de manera integral per crear valor, no estan assignats exclusivament a un sol procés."
      }
    ],
    "hint": "Pensa en la diferència entre 'tenir eines' i 'saber utilitzar-les'."
  },
  {
    "guid": "8e054f9c-d68c-493b-bab9-cb94055d4b11",
    "subjectId": "T20",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Quin rol és el responsable final d'un servei de principi a fi (end-to-end), incloent el seu valor, cost i risc al llarg de tot el cicle de vida?",
    "answerOptions": [
      {
        "text": "Business Relationship Manager (BRM).",
        "isCorrect": false,
        "rationale": "El BRM s'enfoca en la relació amb el client i en entendre les seves necessitats, però no és el propietari del servei."
      },
      {
        "text": "Process Owner.",
        "isCorrect": false,
        "rationale": "Aquest rol és propietari d'un procés específic (com la Gestió d'Incidències), no d'un servei complet."
      },
      {
        "text": "Service Owner.",
        "isCorrect": true,
        "rationale": "Aquesta és la definició exacta del Service Owner, que actua com a responsable màxim d'un servei específic davant del negoci."
      },
      {
        "text": "Demand Manager.",
        "isCorrect": false,
        "rationale": "El Demand Manager s'especialitza en la gestió de la demanda d'un o més serveis, però no té la responsabilitat global sobre el servei."
      }
    ],
    "hint": "Aquest rol té una visió completa del servei, no només d'una part del seu funcionament."
  },
  {
    "guid": "9160c432-086a-47c2-bca0-84b420261560",
    "subjectId": "T20",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "En el context de l'administració pública, quina activitat de la Gestió Financera per a Serveis TI és menys comú aplicar?",
    "answerOptions": [
      {
        "text": "Pressupost (Budgeting).",
        "isCorrect": false,
        "rationale": "La planificació pressupostària és una activitat fonamental i obligatòria en qualsevol administració pública."
      },
      {
        "text": "Comptabilitat de costos (Costing/Accounting).",
        "isCorrect": false,
        "rationale": "Entendre els costos dels serveis és essencial per a una gestió eficient, per la qual cosa aquesta activitat sí que es realitza."
      },
      {
        "text": "Imputació de costos (Charging).",
        "isCorrect": true,
        "rationale": "Aquesta pràctica, que consisteix a facturar als departaments 'clients' pels serveis TI rebuts, no és habitual en el sector públic."
      },
      {
        "text": "Anàlisi cost-benefici.",
        "isCorrect": false,
        "rationale": "Aquesta anàlisi és clau per justificar inversions i forma part de la presa de decisions financeres en el sector públic."
      }
    ],
    "hint": "Pensa en l'activitat que implicaria 'facturar' entre diferents àrees del mateix ajuntament."
  },
  {
    "guid": "e8919040-894e-44f7-b4bf-09d116a75c63",
    "subjectId": "T20",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "L'adequació d'un servei al seu ús ('fitness for use') fa referència principalment a la seva...",
    "answerOptions": [
      {
        "text": "Utilitat.",
        "isCorrect": false,
        "rationale": "La utilitat es defineix com l'adequació al propòsit ('fitness for purpose'), és a dir, les funcionalitats que ofereix."
      },
      {
        "text": "Garantia.",
        "isCorrect": true,
        "rationale": "Aquest terme engloba aspectes com la disponibilitat, capacitat, continuïtat i seguretat, que asseguren que el servei es pot utilitzar de manera fiable."
      },
      {
        "text": "Estratègia.",
        "isCorrect": false,
        "rationale": "L'estratègia defineix el valor, però el concepte que mesura directament la fiabilitat en l'ús és un altre."
      },
      {
        "text": "Demanda.",
        "isCorrect": false,
        "rationale": "La demanda es refereix a l'ús que es fa del servei, no a les qualitats intrínseques que el fan apte per a aquest ús."
      }
    ],
    "hint": "Aquesta qualitat assegura que el servei funcioni bé quan el necessites."
  },
  {
    "guid": "4d4f3b5b-9dcc-4e52-b5d3-29c544510597",
    "subjectId": "T20",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Quin és l'output principal de la fase d'Estratègia del Servei que serveix com a input per a la fase de Disseny del Servei?",
    "answerOptions": [
      {
        "text": "Els Acords de Nivell de Servei (SLA) definitius.",
        "isCorrect": false,
        "rationale": "Els SLA es negocien i es defineixen formalment a la fase de Disseny, basant-se en els requisits de l'Estratègia."
      },
      {
        "text": "Un catàleg de serveis completament operatiu.",
        "isCorrect": false,
        "rationale": "El catàleg es construeix i es gestiona a la fase de Disseny; l'Estratègia gestiona el portfoli."
      },
      {
        "text": "Els requisits del servei, models de negoci i la proposta de valor.",
        "isCorrect": true,
        "rationale": "L'Estratègia genera els documents estratègics que defineixen què ha de fer el servei, per a qui i quin valor ha d'aportar, servint de base per al disseny tècnic i funcional."
      },
      {
        "text": "El pla de desplegament i transició del servei.",
        "isCorrect": false,
        "rationale": "Aquest pla és un resultat de la fase de Transició del Servei, no de l'Estratègia."
      }
    ],
    "hint": "La fase d'Estratègia respon a les preguntes 'què' i 'per què', per després passar a la fase que respon al 'com'."
  },
  {
    "guid": "8fa66074-6f08-47b9-a3ff-75b6e90fe09a",
    "subjectId": "T20",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Una plataforma de signatura electrònica que és indispensable per poder oferir el servei principal de tramitació telemàtica, es classifica com un servei de tipus:",
    "answerOptions": [
      {
        "text": "Core.",
        "isCorrect": false,
        "rationale": "Un servei 'core' és el servei principal que el client consumeix directament per obtenir valor, com el tràmit en si."
      },
      {
        "text": "Enabling.",
        "isCorrect": true,
        "rationale": "Aquesta classificació és per a serveis que són necessaris perquè un servei 'core' pugui ser entregat. La signatura fa possible la tramitació."
      },
      {
        "text": "Enhancing.",
        "isCorrect": false,
        "rationale": "Un servei 'enhancing' afegeix valor o atractiu al servei 'core' però no és essencial per al seu funcionament, com podria ser una notificació per SMS."
      },
      {
        "text": "Shared.",
        "isCorrect": false,
        "rationale": "'Shared' es refereix a un model de proveïdor (Tipus II), no a una classificació del servei segons el seu valor."
      }
    ],
    "hint": "Aquest tipus de servei 'habilita' o fa possible que el servei principal funcioni."
  },
  {
    "guid": "1376d104-83ba-4db9-bc19-b542c1d8a307",
    "subjectId": "T20",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "El procés d'assegurar una bona interlocució amb les àrees de negoci, entendre les seves necessitats estratègiques i garantir que els serveis TI aporten valor s'anomena:",
    "answerOptions": [
      {
        "text": "Gestió del Nivell de Servei (SLM).",
        "isCorrect": false,
        "rationale": "Aquesta és una confusió habitual. L'SLM se centra en la definició, negociació i seguiment dels SLA, que és més tàctic."
      },
      {
        "text": "Gestió de la Relació amb el Negoci (BRM).",
        "isCorrect": true,
        "rationale": "Aquesta és la definició precisa del BRM, que actua com a pont estratègic entre el proveïdor de TI i el client (negoci)."
      },
      {
        "text": "Gestió del Portfoli de Serveis.",
        "isCorrect": false,
        "rationale": "La gestió del portfoli decideix quins serveis oferir, però la gestió de la relació interpersonal i estratègica amb el client és una funció específica."
      },
      {
        "text": "Gestió Estratègica per a Serveis TI.",
        "isCorrect": false,
        "rationale": "Aquest procés defineix l'estratègia interna de TI, mentre que el BRM es focalitza en la relació externa amb el client."
      }
    ],
    "hint": "Pensa en el procés que se centra en el vincle i la comunicació constant entre TI i les altres àrees de l'organització."
  },
  {
    "guid": "42850aa1-24f7-4fa9-b967-e6f8ea7c58f1",
    "subjectId": "T20",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Un proveïdor de serveis TI que pertany a la mateixa organització i dona servei a diverses unitats de negoci (p. ex., l'IMI a l'Ajuntament de Barcelona) es classifica com:",
    "answerOptions": [
      {
        "text": "Tipus I – Proveïdor de serveis intern.",
        "isCorrect": false,
        "rationale": "Un proveïdor de Tipus I normalment està integrat dins d'una única unitat de negoci, no serveix a diverses de forma centralitzada."
      },
      {
        "text": "Tipus II – Unitat de servei compartit.",
        "isCorrect": true,
        "rationale": "Aquesta és la definició d'un proveïdor que centralitza serveis per a diverses unitats dins de la mateixa empresa o corporació."
      },
      {
        "text": "Tipus III – Proveïdor de serveis extern.",
        "isCorrect": false,
        "rationale": "Un proveïdor de Tipus III és una empresa externa contractada, com una consultora o un proveïdor de cloud."
      },
      {
        "text": "Proveïdor de serveis mixt.",
        "isCorrect": false,
        "rationale": "Tot i que es pot utilitzar un model mixt (sourcing), la classificació d'ITIL per a aquest cas específic és Tipus II."
      }
    ],
    "hint": "Aquest model de proveïdor es caracteritza per centralitzar i compartir recursos dins d'una mateixa organització més gran."
  },
  {
    "guid": "b4bb733f-84bd-4bcc-9d79-79c747710a54",
    "subjectId": "T20",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Dins de l'Estratègia del Servei, quin procés s'encarrega de definir la visió de TI, les polítiques i el model operatiu (p. ex., cloud, on-premise, híbrid)?",
    "answerOptions": [
      {
        "text": "Gestió del Portfoli de Serveis.",
        "isCorrect": false,
        "rationale": "La gestió del portfoli implementa part de l'estratègia decidint sobre serveis concrets, però no defineix la visió global de TI."
      },
      {
        "text": "Gestió de la Relació amb el Negoci (BRM).",
        "isCorrect": false,
        "rationale": "El BRM recull les necessitats del negoci que alimenten l'estratègia, però no és el procés que la defineix formalment."
      },
      {
        "text": "Gestió Financera per a Serveis TI.",
        "isCorrect": false,
        "rationale": "La gestió financera proporciona la perspectiva de costos i inversió, però la definició de la direcció estratègica recau en un altre procés."
      },
      {
        "text": "Gestió Estratègica per a Serveis TI.",
        "isCorrect": true,
        "rationale": "Aquest procés té precisament l'objectiu de definir la perspectiva, posició, plans i patrons de l'organització de TI respecte al negoci."
      }
    ],
    "hint": "Aquest procés és el que crea el 'pla director' de l'àrea de Tecnologies de la Informació."
  },
  {
    "guid": "ad065f8c-79b7-460d-8b53-99158b47606c",
    "subjectId": "T20",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Quina afirmació descriu correctament la relació entre el Portfoli de Serveis i el Catàleg de Serveis?",
    "answerOptions": [
      {
        "text": "Són dos documents independents que no tenen relació.",
        "isCorrect": false,
        "rationale": "Aquesta afirmació és incorrecta; hi ha una relació jeràrquica clara entre tots dos."
      },
      {
        "text": "El Catàleg de Serveis conté el Portfoli de Serveis.",
        "isCorrect": false,
        "rationale": "Aquesta és la inversió de la relació correcta. El Catàleg és més limitat en abast que el Portfoli."
      },
      {
        "text": "El Portfoli de Serveis és una part del Catàleg de Serveis.",
        "isCorrect": false,
        "rationale": "És una trampa habitual. El portfoli és el conjunt complet, mentre que el catàleg és només una vista d'aquest conjunt."
      },
      {
        "text": "El Catàleg de Serveis és una part del Portfoli de Serveis.",
        "isCorrect": true,
        "rationale": "El Portfoli engloba tots els serveis (pipeline, actius i retirats), mentre que el Catàleg només inclou els serveis actius, sent-ne, per tant, un subconjunt."
      }
    ],
    "hint": "Pensa en un com el contenidor de TOT, i l'altre com una 'botiga' que només mostra el que està disponible per comprar ara."
  },
  {
    "guid": "6e34ec75-3a0b-4d96-800a-ecdfa061718c",
    "subjectId": "T20",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "La garantia ('warranty') d'un servei TI està composta per quatre aspectes principals. Quina de les següents opcions NO n'és un?",
    "answerOptions": [
      {
        "text": "Disponibilitat.",
        "isCorrect": false,
        "rationale": "La disponibilitat (que el servei estigui operatiu quan es necessita) és un dels pilars de la garantia."
      },
      {
        "text": "Funcionalitat.",
        "isCorrect": true,
        "rationale": "La funcionalitat (el que el servei pot fer) pertany al concepte d'Utilitat ('utility'), no de Garantia."
      },
      {
        "text": "Capacitat.",
        "isCorrect": false,
        "rationale": "La capacitat (que el servei pugui suportar la càrrega de treball acordada) és un element clau de la garantia."
      },
      {
        "text": "Continuïtat del servei.",
        "isCorrect": false,
        "rationale": "La continuïtat (la capacitat de recuperar el servei després d'un desastre) és un dels quatre components clàssics de la garantia."
      }
    ],
    "hint": "Tres d'aquestes opcions es refereixen a 'com de bé' funciona el servei, mentre que una es refereix a 'què' fa."
  }
]