[
  {
    "guid": "43b3f5f4-4224-46da-98be-ac23d6bd40ad",
    "subjectId": "T21",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "Un nuevo servicio de trámites online del Ayuntamiento funciona perfectamente para registrar solicitudes, pero se colapsa en periodos de alta demanda, impidiendo el acceso a los usuarios. ¿Qué aspecto fundamental del valor del servicio, definido en el Diseño del Servicio, está fallando principalmente?",
    "answerOptions": [
      {
        "text": "Utility (Utilidad)",
        "isCorrect": false,
        "rationale": "La utilidad se refiere a que el servicio cumple su propósito funcional, lo cual hace al permitir registrar solicitudes; el problema reside en su rendimiento bajo carga."
      },
      {
        "text": "Warranty (Garantía)",
        "isCorrect": true,
        "rationale": "La garantía asegura que el servicio sea 'apto para el uso', cubriendo aspectos como la capacidad, disponibilidad y rendimiento, que son los que fallan en este escenario."
      },
      {
        "text": "Service Level Management (Gestión del Nivel de Servicio)",
        "isCorrect": false,
        "rationale": "Aunque la gestión de niveles de servicio define los objetivos de garantía, el fallo conceptual específico se encuentra en la propia garantía del servicio."
      },
      {
        "text": "Service Catalogue Management (Gestión del Catálogo de Servicios)",
        "isCorrect": false,
        "rationale": "La gestión del catálogo se ocupa de mantener la información sobre los servicios disponibles, no de asegurar su rendimiento operativo."
      }
    ],
    "hint": "Piense en la diferencia entre lo que el servicio 'hace' y 'cómo' lo hace en términos de calidad y fiabilidad."
  },
  {
    "guid": "84373e9d-b556-4b8b-b67a-f58995ea91cb",
    "subjectId": "T21",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "¿Cuál es el propósito principal del Service Design Package (SDP) en el ciclo de vida de ITIL?",
    "answerOptions": [
      {
        "text": "Servir como contrato final con el cliente, detallando únicamente los SLAs.",
        "isCorrect": false,
        "rationale": "El SDP contiene un SLA preliminar, pero su alcance es mucho más amplio, incluyendo arquitectura, requisitos y planes de operación."
      },
      {
        "text": "Documentar los resultados de la fase de Operación del Servicio para la mejora continua.",
        "isCorrect": false,
        "rationale": "El SDP se genera en la fase de Diseño y sirve para guiar las fases posteriores, no para documentar la Operación."
      },
      {
        "text": "Actuar como el principal 'input' para la fase de Transición del Servicio, detallando todos los aspectos del servicio para su construcción y despliegue.",
        "isCorrect": true,
        "rationale": "Este paquete es la salida clave del Diseño y contiene toda la información necesaria para que la fase de Transición pueda construir, probar y desplegar el servicio correctamente."
      },
      {
        "text": "Ser el documento estratégico que aprueba la creación de un nuevo servicio en la fase de Estrategia.",
        "isCorrect": false,
        "rationale": "La aprobación estratégica ocurre en la fase de Estrategia del Servicio; el SDP se crea después, en la fase de Diseño."
      }
    ],
    "hint": "Considere qué fase del ciclo de vida ITIL necesita la información detallada de un diseño para poder implementar un servicio."
  },
  {
    "guid": "fb0594e0-9a7e-4a48-b558-032cec6a23e7",
    "subjectId": "T21",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "Para asegurar la disponibilidad del portal de trámites OVT, el equipo de aplicaciones acuerda con el equipo de redes interno un tiempo de respuesta de la red específico. A su vez, el departamento de TI contrata a un proveedor externo para el hosting en la nube con una disponibilidad del 99,99%. ¿Qué documento formaliza el compromiso entre el equipo de aplicaciones y el equipo de redes?",
    "answerOptions": [
      {
        "text": "Service Level Agreement (SLA)",
        "isCorrect": false,
        "rationale": "Un SLA se establece entre el proveedor de TI y el cliente de negocio (por ejemplo, un departamento del Ayuntamiento), no entre equipos internos de TI."
      },
      {
        "text": "Underpinning Contract (UC)",
        "isCorrect": false,
        "rationale": "Un UC es un contrato con un proveedor externo, como la empresa de hosting en la nube."
      },
      {
        "text": "Operational Level Agreement (OLA)",
        "isCorrect": true,
        "rationale": "Un OLA es un acuerdo interno entre dos equipos o departamentos dentro de la organización de TI para apoyar la entrega de servicios y el cumplimiento de los SLAs."
      },
      {
        "text": "Service Design Package (SDP)",
        "isCorrect": false,
        "rationale": "El SDP contendría la necesidad de este acuerdo, pero no es el acuerdo en sí."
      }
    ],
    "hint": "Distinga entre acuerdos con el cliente, acuerdos internos de TI y contratos con terceros."
  },
  {
    "guid": "804125ee-03e2-4810-bb99-07eabae1c258",
    "subjectId": "T21",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "Según el material, ¿qué afirmación describe correctamente la relación entre la Gestión de la Disponibilidad y la Gestión de la Continuidad del Servicio TI (ITSCM)?",
    "answerOptions": [
      {
        "text": "La Gestión de la Disponibilidad se enfoca en la recuperación rápida tras un desastre, mientras que la Continuidad se enfoca en evitar fallos menores.",
        "isCorrect": false,
        "rationale": "Esta afirmación invierte los roles; la Disponibilidad gestiona el tiempo de actividad normal y la Continuidad se centra en la recuperación ante desastres."
      },
      {
        "text": "Ambos procesos son idénticos y se gestionan conjuntamente para asegurar el uptime del servicio.",
        "isCorrect": false,
        "rationale": "Aunque están relacionados, tienen objetivos distintos: uno se centra en la operación normal y el otro en eventos excepcionales de desastre."
      },
      {
        "text": "La Gestión de la Disponibilidad se centra en asegurar que el servicio funcione como se espera en condiciones normales, mientras que la Continuidad planifica la recuperación ante un desastre mayor.",
        "isCorrect": true,
        "rationale": "La Disponibilidad busca eliminar puntos únicos de fallo y mantener el servicio operativo día a día, mientras que ITSCM se activa cuando ocurre un desastre que supera las medidas de disponibilidad."
      },
      {
        "text": "La Gestión de la Continuidad es un subproceso de la Gestión de la Disponibilidad, centrado exclusivamente en los RTO y RPO.",
        "isCorrect": false,
        "rationale": "Son procesos separados y al mismo nivel dentro de la fase de Diseño del Servicio, aunque colaboran estrechamente."
      }
    ],
    "hint": "Piense en la diferencia entre un fallo de un componente (estado normal) y la caída de todo un centro de datos (desastre)."
  },
  {
    "guid": "10ec5fec-7719-4f18-bbe7-76f146eb6fba",
    "subjectId": "T21",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "Al diseñar un nuevo sistema de gestión documental para el Ayuntamiento, el equipo define la estructura de metadatos, los ciclos de vida de los documentos y el cumplimiento del ENS y RGPD. Según los 5 aspectos clave del Diseño del Servicio, ¿en qué área se está enfocando principalmente el equipo?",
    "answerOptions": [
      {
        "text": "Diseño de arquitecturas tecnológicas",
        "isCorrect": false,
        "rationale": "Este aspecto se centraría en la infraestructura subyacente (servidores, CPDs, redes), no en la estructura de la información en sí."
      },
      {
        "text": "Diseño de métricas y methodos de medida",
        "isCorrect": false,
        "rationale": "Este aspecto se enfocaría en definir KPIs y cómo medir el rendimiento del servicio, no en cómo se estructuran y gobiernan los datos."
      },
      {
        "text": "Diseño de soluciones de servicio",
        "isCorrect": false,
        "rationale": "Aunque relacionado, el diseño de la solución se centra más en la arquitectura funcional y técnica general de la aplicación, mientras que la pregunta especifica la gestión de la información."
      },
      {
        "text": "Diseño de la gestión de información",
        "isCorrect": true,
        "rationale": "Este aspecto abarca específicamente el diseño de datos, modelos de datos, repositorios, seguridad de la información y cumplimiento normativo asociado a los datos, como se describe en el escenario."
      }
    ],
    "hint": "El material de origen desglosa el diseño en cinco áreas. Identifique cuál de ellas se ocupa del gobierno y la estructura de los datos."
  },
  {
    "guid": "5c9c0e98-32fe-4e37-8a0b-23d3a2667e27",
    "subjectId": "T21",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "De acuerdo con el material de estudio, ¿cuál de las siguientes afirmaciones sobre la CMDB (Base de Datos de Gestión de la Configuración) es una trampa de examen común que se debe evitar?",
    "answerOptions": [
      {
        "text": "La CMDB se diseña lógicamente en la fase de Diseño del Servicio.",
        "isCorrect": false,
        "rationale": "Esta afirmación es correcta según el material. El modelo lógico se define en Diseño, lo que puede confundir sobre dónde se implementa."
      },
      {
        "text": "La CMDB y el Catálogo de Servicios son la misma herramienta para gestionar activos de TI.",
        "isCorrect": false,
        "rationale": "Esta es una confusión común, pero la trampa específica mencionada en el texto es sobre en qué fase se crea la CMDB."
      },
      {
        "text": "La implementación y carga inicial de la CMDB es una actividad principal de la fase de Diseño del Servicio.",
        "isCorrect": true,
        "rationale": "Esta es una trampa clásica. Aunque su arquitectura se define en Diseño, la CMDB se implementa y se puebla de datos durante la fase de Transición del Servicio."
      },
      {
        "text": "La CMDB es fundamental para la gestión de incidentes y problemas en la fase de Operación.",
        "isCorrect": false,
        "rationale": "Esta afirmación es correcta y describe uno de los usos clave de la CMDB, no una trampa relacionada con su creación."
      }
    ],
    "hint": "El material distingue claramente entre la definición del 'qué' (modelo) y la construcción del 'cómo' (implementación) para la CMDB, asignándolos a fases diferentes."
  },
  {
    "guid": "d2629ee2-a267-4b8e-b96a-a4cdaba43ad1",
    "subjectId": "T21",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "Al planificar la capacidad para un nuevo trámite de alta demanda como las inscripciones a las 'escoles bressol', la Gestión de la Capacidad analiza las proyecciones de solicitudes basadas en datos históricos y campañas de comunicación. ¿A qué subproceso de la Gestión de la Capacidad corresponde este análisis?",
    "answerOptions": [
      {
        "text": "Capacidad de componentes",
        "isCorrect": false,
        "rationale": "Este subproceso se centra en los recursos técnicos individuales como CPU, RAM o red, no en la demanda global del negocio."
      },
      {
        "text": "Capacidad del servicio",
        "isCorrect": false,
        "rationale": "Este subproceso mide cómo responde el servicio de extremo a extremo a la carga, pero el análisis de la demanda futura es el paso previo."
      },
      {
        "text": "Capacidad del negocio",
        "isCorrect": true,
        "rationale": "Este subproceso traduce los planes y necesidades del negocio en requisitos de capacidad para los servicios de TI, enfocándose en la demanda futura esperada."
      },
      {
        "text": "Capacidad de disponibilidad",
        "isCorrect": false,
        "rationale": "No existe un subproceso con este nombre; la disponibilidad y la capacidad son procesos distintos aunque relacionados."
      }
    ],
    "hint": "Considere cuál de los tres subprocesos de capacidad se alinea más estrechamente con la planificación estratégica y las necesidades futuras del negocio."
  },
  {
    "guid": "1e59b82e-9773-4883-b654-dd191607a5c9",
    "subjectId": "T21",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "¿Cuál de los siguientes elementos NO forma parte explícita del modelo de las '4 Ps' del Diseño del Servicio según ITIL?",
    "answerOptions": [
      {
        "text": "Processes (Procesos)",
        "isCorrect": false,
        "rationale": "Los procesos, como la gestión de incidentes o cambios, son uno de los cuatro pilares fundamentales del modelo."
      },
      {
        "text": "Partners (Proveedores)",
        "isCorrect": false,
        "rationale": "Los proveedores y socios externos son un componente clave que debe considerarse en cualquier diseño de servicio."
      },
      {
        "text": "Performance (Rendimiento)",
        "isCorrect": true,
        "rationale": "Aunque el rendimiento es un resultado crucial del diseño, no es una de las cuatro 'P' del modelo clásico. Se considera parte de la 'Warranty' y se diseña dentro de 'Products' y 'Processes'."
      },
      {
        "text": "People (Personas)",
        "isCorrect": false,
        "rationale": "Las personas, sus habilidades y roles son una de las cuatro 'P' esenciales para el diseño y la operación de un servicio."
      }
    ],
    "hint": "Recuerde el modelo clásico que ITIL utiliza para asegurar un enfoque holístico en el diseño. Una de las opciones es un resultado, no un pilar del modelo."
  },
  {
    "guid": "789e3b00-4737-4610-83fb-71e42f3e5f8d",
    "subjectId": "T21",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "Una pregunta de examen afirma: 'El Catálogo de Servicios es la única fuente autorizada de información sobre todos los servicios de TI, incluidos los que están en desarrollo (pipeline) y los retirados'. ¿Por qué esta afirmación es incorrecta?",
    "answerOptions": [
      {
        "text": "Porque la CMDB es la única fuente autorizada de información de servicios, no el Catálogo.",
        "isCorrect": false,
        "rationale": "La CMDB contiene información técnica sobre los componentes, mientras que el Catálogo se centra en la descripción de los servicios desde una perspectiva de negocio y de cliente."
      },
      {
        "text": "Porque el Catálogo solo incluye información de los servicios operativos y aprobados para su uso.",
        "isCorrect": true,
        "rationale": "El documento que incluye los servicios en pipeline, activos y retirados es el Portfolio de Servicios (Service Portfolio). El Catálogo es una vista para el cliente de los servicios actualmente disponibles."
      },
      {
        "text": "Porque el Catálogo también debe incluir los OLAs y UCs, no solo información de servicios.",
        "isCorrect": false,
        "rationale": "Aunque el Catálogo puede hacer referencia a los SLAs, incluir todos los detalles de OLAs y UCs no es su función principal, y la razón principal de la falsedad de la afirmación es otra."
      },
      {
        "text": "Porque es una herramienta exclusiva para el personal de TI y no una fuente de información para otros.",
        "isCorrect": false,
        "rationale": "Al contrario, una de las vistas del Catálogo (el Catálogo de Servicios de Negocio) está diseñada precisamente para ser accesible y comprensible por los clientes y usuarios."
      }
    ],
    "hint": "Piense en la diferencia entre la lista completa de todos los servicios en cualquier estado (pasado, presente, futuro) y la lista de servicios actualmente 'en venta' u operativos."
  },
  {
    "guid": "9dac108c-3952-46bb-9492-573dc33d4f77",
    "subjectId": "T21",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "En el contexto del Ayuntamiento de Barcelona, el diseño de la integración entre el portal de trámites (OVT) y servicios externos del Consorci AOC (como Via Oberta o eNotum) es responsabilidad del proceso de...",
    "answerOptions": [
      {
        "text": "Gestión del Nivel de Servicio (SLM)",
        "isCorrect": false,
        "rationale": "SLM se encargaría de negociar el nivel de servicio de esa integración, pero no de su diseño técnico y contractual."
      },
      {
        "text": "Gestión de la Continuidad del Servicio TI (ITSCM)",
        "isCorrect": false,
        "rationale": "ITSCM se preocuparía de cómo recuperar esa integración en caso de desastre, pero no de su gestión y control en condiciones normales."
      },
      {
        "text": "Gestión de Proveedores (Supplier Management)",
        "isCorrect": true,
        "rationale": "Este proceso se encarga de gestionar las relaciones, contratos (UCs) y el rendimiento de proveedores externos como el Consorci AOC, que son fundamentales para el funcionamiento de los servicios de TI."
      },
      {
        "text": "Gestión del Catálogo de Servicios",
        "isCorrect": false,
        "rationale": "El Catálogo listaría el servicio OVT y sus dependencias, pero el proceso de gestionar la relación con el proveedor AOC es específico de la Gestión de Proveedores."
      }
    ],
    "hint": "Identifique qué proceso de la fase de Diseño se enfoca específicamente en la relación y los contratos con entidades externas que proveen tecnología o servicios."
  },

  {
    "guid": "efed9c87-7283-4b88-b4c8-7f83df404206",
    "subjectId": "T21",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Un nou tràmit de la Seu Electrònica funciona correctament, permetent als ciutadans completar el procés com estava previst. No obstant això, el sistema és extremadament lent i sovint no està disponible en hores punta. Quin component fonamental del valor del servei està fallant principalment?",
    "answerOptions": [
      {
        "text": "La Utilitat (Utility)",
        "isCorrect": false,
        "rationale": "La utilitat es refereix al fet que el servei compleixi la seva funció ('fit for purpose'), la qual cosa en aquest cas sí que fa, ja que el tràmit es pot completar."
      },
      {
        "text": "La Garantia (Warranty)",
        "isCorrect": true,
        "rationale": "La garantia es refereix a la qualitat del servei ('fit for use'), incloent la disponibilitat, capacitat i rendiment, que són els aspectes que fallen en aquest escenari."
      },
      {
        "text": "El Catàleg de Serveis",
        "isCorrect": false,
        "rationale": "El Catàleg de Serveis és una llista de serveis disponibles, però no defineix la qualitat de l'execució d'un servei en particular."
      },
      {
        "text": "La Gestió de Proveïdors",
        "isCorrect": false,
        "rationale": "Tot i que un proveïdor podria ser la causa del problema, el concepte ITIL que descriu la qualitat del servei en termes de disponibilitat i rendiment és la garantia."
      }
    ],
    "hint": "Pensa en la diferència entre 'el què fa' un servei i 'com ho fa' en termes de qualitat."
  },
  {
    "guid": "bef90000-805a-4bde-9251-b2e56a2f928a",
    "subjectId": "T21",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Quin és el document de sortida (output) més important de la fase de Disseny del Servei, que actua com a entrada (input) per a la fase de Transició del Servei?",
    "answerOptions": [
      {
        "text": "L'Acord de Nivell de Servei (SLA)",
        "isCorrect": false,
        "rationale": "L'SLA és una part crucial, però és només un dels molts components que es defineixen en el document final."
      },
      {
        "text": "El Paquet de Disseny del Servei (SDP)",
        "isCorrect": true,
        "rationale": "L'SDP és el document final i complet que conté tots els requisits, arquitectures i plans necessaris per construir, provar i desplegar el servei."
      },
      {
        "text": "El Catàleg de Serveis actualitzat",
        "isCorrect": false,
        "rationale": "La gestió del Catàleg de Serveis és un procés dins del Disseny, però el document que es lliura a Transició és molt més detallat."
      },
      {
        "text": "El Pla de Continuïtat del Servei TI (ITSCM)",
        "isCorrect": false,
        "rationale": "El pla de continuïtat és un element important, però forma part d'un paquet de disseny més ampli."
      }
    ],
    "hint": "Aquest document agrupa tota la informació del disseny per a la seva posterior implementació."
  },
  {
    "guid": "0da61634-8281-49e1-a581-c8d8eded9496",
    "subjectId": "T21",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Per garantir la disponibilitat del servei de Padró, l'equip de sistemes de l'Ajuntament acorda amb l'equip de xarxes un temps màxim de resolució per a les incidències de comunicacions. Aquest acord intern es formalitza mitjançant un:",
    "answerOptions": [
      {
        "text": "SLA (Service Level Agreement)",
        "isCorrect": false,
        "rationale": "Un SLA es negocia entre TI i el client o negoci, no entre dos equips interns de TI."
      },
      {
        "text": "UC (Underpinning Contract)",
        "isCorrect": false,
        "rationale": "Un UC és un contracte amb un proveïdor extern que dona suport a un SLA."
      },
      {
        "text": "SDP (Service Design Package)",
        "isCorrect": false,
        "rationale": "L'SDP és el disseny complet del servei, no un acord operatiu específic entre equips."
      },
      {
        "text": "OLA (Operational Level Agreement)",
        "isCorrect": true,
        "rationale": "Un OLA és un acord intern entre dos equips de l'organització de TI per garantir el compliment dels SLA."
      }
    ],
    "hint": "Considera la naturalesa de les parts implicades en l'acord: són internes o externes a l'organització de TI?"
  },
  {
    "guid": "d336f4b8-3695-4f2b-a83b-0955c3b7efbf",
    "subjectId": "T21",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Dins dels 7 processos del Disseny del Servei, quin és el responsable de garantir que hi haurà suficients recursos de CPU, memòria i xarxa per suportar un pic de demanda durant la campanya d'inscripcions a les escoles bressol?",
    "answerOptions": [
      {
        "text": "Gestió de la Disponibilitat",
        "isCorrect": false,
        "rationale": "La disponibilitat se centra en garantir que el servei estigui operatiu i accessible, però no específicament en el dimensionament dels recursos."
      },
      {
        "text": "Gestió del Nivell de Servei (SLM)",
        "isCorrect": false,
        "rationale": "SLM negocia i monitoritza els acords de servei, però no gestiona directament els recursos tècnics subjacents."
      },
      {
        "text": "Gestió de la Capacitat",
        "isCorrect": true,
        "rationale": "Aquest procés s'encarrega d'assegurar que la capacitat de la infraestructura de TI pugui satisfer les demandes de negoci actuals i futures de manera rendible."
      },
      {
        "text": "Gestió de la Continuïtat de Serveis TI (ITSCM)",
        "isCorrect": false,
        "rationale": "ITSCM es focalitza en la recuperació del servei davant d'un desastre, no en la gestió del rendiment sota càrrega normal o de pics."
      }
    ],
    "hint": "Aquest procés es divideix en tres subprocessos: negoci, servei i components."
  },
  {
    "guid": "64528adb-63b3-43a4-852c-9ec9d4d706dd",
    "subjectId": "T21",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "El model clàssic dels '4 Ps' del Disseny del Servei estableix que qualsevol disseny ha de considerar quatre àmbits. Quin d'aquests àmbits fa referència a la tecnologia, les eines i els sistemes utilitzats, com ara Kubernetes o la plataforma OVT?",
    "answerOptions": [
      {
        "text": "People (Persones)",
        "isCorrect": false,
        "rationale": "Aquest àmbit es refereix a les habilitats, rols i estructura organitzativa de les persones implicades."
      },
      {
        "text": "Processes (Processos)",
        "isCorrect": false,
        "rationale": "Aquest àmbit fa referència als fluxos de treball, procediments i controls de gestió."
      },
      {
        "text": "Partners (Proveïdors)",
        "isCorrect": false,
        "rationale": "Aquest àmbit inclou a tercers, venedors i proveïdors que contribueixen a la prestació del servei."
      },
      {
        "text": "Products (Productes)",
        "isCorrect": true,
        "rationale": "Aquest àmbit engloba la tecnologia, les eines, les aplicacions i la infraestructura que suporten el servei."
      }
    ],
    "hint": "Pensa en quin dels quatre elements representa els components tècnics i de programari."
  },
  {
    "guid": "d1ac05ff-2779-473d-9f50-2661db11c5ce",
    "subjectId": "T21",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Segons les bones pràctiques d'ITIL, en quina fase del cicle de vida s'implementa i es carrega inicialment la CMDB (Base de Dades de Gestió de la Configuració)?",
    "answerOptions": [
      {
        "text": "Estratègia del Servei",
        "isCorrect": false,
        "rationale": "L'Estratègia defineix quins serveis oferir, però no s'ocupa de la implementació de les eines de gestió."
      },
      {
        "text": "Disseny del Servei",
        "isCorrect": false,
        "rationale": "En el Disseny es defineix l'arquitectura i el model lògic de la CMDB, però no la seva implementació i càrrega."
      },
      {
        "text": "Transició del Servei",
        "isCorrect": true,
        "rationale": "La Transició és la fase responsable de construir, provar i desplegar el servei i els seus components, incloent la implementació i poblament de la CMDB."
      },
      {
        "text": "Operació del Servei",
        "isCorrect": false,
        "rationale": "L'Operació utilitza i manté la CMDB en el dia a dia, però no és responsable de la seva creació inicial."
      }
    ],
    "hint": "Una trampa habitual és pensar que es crea en la fase on es defineix el seu model. La clau és on es 'construeix'."
  },
  {
    "guid": "f4b10de9-79cd-4217-a6aa-2b7e099a0533",
    "subjectId": "T21",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Quin dels 5 aspectes clau del Disseny del Servei s'encarrega de definir l'arquitectura de xarxes, CPDs, virtualització i seguretat perimetral?",
    "answerOptions": [
      {
        "text": "Disseny de solucions de servei",
        "isCorrect": false,
        "rationale": "Aquest aspecte se centra més en l'arquitectura funcional i tècnica de l'aplicació o servei en si, no en la infraestructura subjacent."
      },
      {
        "text": "Disseny d'arquitectures tecnològiques",
        "isCorrect": true,
        "rationale": "Aquest aspecte cobreix explícitament el disseny de la infraestructura tecnològica global que suportarà els serveis."
      },
      {
        "text": "Disseny de processos",
        "isCorrect": false,
        "rationale": "Aquest aspecte se centra en definir els fluxos de treball de gestió, com la gestió d'incidents o canvis."
      },
      {
        "text": "Disseny de mètriques i mètodes de mesura",
        "isCorrect": false,
        "rationale": "Aquest aspecte defineix com es mesurarà el servei, no com es construirà la seva base tecnològica."
      }
    ],
    "hint": "Busca l'opció que es refereix a la base tecnològica i la infraestructura general."
  },
  {
    "guid": "bb0f290c-73d9-418e-b74d-c66087e5d9cd",
    "subjectId": "T21",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "La diferència principal entre la Gestió de la Disponibilitat i la Gestió de la Continuïtat (ITSCM) és que:",
    "answerOptions": [
      {
        "text": "La Disponibilitat gestiona l'uptime i la Continuïtat gestiona el downtime.",
        "isCorrect": false,
        "rationale": "Aquesta és una simplificació excessiva; ambdós conceptes estan relacionats amb l'accessibilitat del servei, però en contextos diferents."
      },
      {
        "text": "La Disponibilitat se centra en evitar fallades en condicions normals i la Continuïtat en recuperar-se de desastres.",
        "isCorrect": true,
        "rationale": "La Disponibilitat busca eliminar punts únics de fallada per al funcionament diari, mentre que la Continuïtat prepara plans per a esdeveniments catastròfics que interrompen el servei completament."
      },
      {
        "text": "La Disponibilitat és un procés de Disseny i la Continuïtat és un procés d'Operació.",
        "isCorrect": false,
        "rationale": "Tots dos són processos que es defineixen i planifiquen principalment en la fase de Disseny del Servei."
      },
      {
        "text": "La Disponibilitat mesura el MTTR i la Continuïtat mesura el RTO.",
        "isCorrect": false,
        "rationale": "Si bé les mètriques són correctes per a cada procés (MTTR per disponibilitat, RTO per continuïtat), no defineixen la diferència fonamental entre els seus objectius."
      }
    ],
    "hint": "Pensa en l'escala de la interrupció que cada procés intenta gestionar."
  },
  {
    "guid": "0bbbccc6-e72c-4d03-a190-ba5541bab13b",
    "subjectId": "T21",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Quina afirmació descriu correctament la relació entre SLA, OLA i UC?",
    "answerOptions": [
      {
        "text": "Els OLA i UC són contractes opcionals que no afecten l'SLA.",
        "isCorrect": false,
        "rationale": "Són fonamentals, ja que sense el suport intern (OLA) i extern (UC), seria impossible complir els compromisos de l'SLA."
      },
      {
        "text": "Un SLA és un acord entre proveïdors, mentre que un UC és amb el client.",
        "isCorrect": false,
        "rationale": "És exactament al revés: l'SLA és amb el client i l'UC és amb el proveïdor."
      },
      {
        "text": "L'SLA defineix els compromisos amb el negoci, recolzats pels acords interns (OLA) i els contractes amb proveïdors (UC).",
        "isCorrect": true,
        "rationale": "Aquesta és la jerarquia correcta; l'SLA és el compromís final amb el client, i depèn del compliment dels acords interns i externs que el suporten."
      },
      {
        "text": "Un OLA és simplement un esborrany d'un SLA abans de ser presentat al client.",
        "isCorrect": false,
        "rationale": "Un OLA té un propòsit diferent; formalitza acords entre equips interns de TI, no és una versió preliminar d'un SLA."
      }
    ],
    "hint": "Pensa en una cadena de dependències on el compromís final amb el client depèn d'altres compromisos interns i externs."
  },
  {
    "guid": "5f82f35a-10a3-4a0a-8eb6-ff30a3fa16a4",
    "subjectId": "T21",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "El principi de Disseny Holístic implica que:",
    "answerOptions": [
      {
        "text": "Cal dissenyar primer la tecnologia i després adaptar els processos i les persones.",
        "isCorrect": false,
        "rationale": "Això seria un enfocament centrat en la tecnologia, contrari al principi holístic que busca l'equilibri entre tots els components."
      },
      {
        "text": "El disseny del servei ha de considerar simultàniament les persones, els processos, la tecnologia i els proveïdors.",
        "isCorrect": true,
        "rationale": "Aquest principi sosté que un servei només pot tenir èxit si tots els seus components (representats pels 4 Ps) es dissenyen de manera integrada."
      },
      {
        "text": "Cada procés d'ITIL s'ha de dissenyar de forma independent per maximitzar la seva eficiència.",
        "isCorrect": false,
        "rationale": "L'holisme promou la integració i la visió de conjunt, no la independència o l'optimització aïllada dels processos."
      },
      {
        "text": "El disseny ha de prioritzar sempre els requisits funcionals per sobre dels no funcionals.",
        "isCorrect": false,
        "rationale": "Un disseny holístic dona la mateixa importància als requisits funcionals (Utility) i als no funcionals (Warranty)."
      }
    ],
    "hint": "Aquest principi es basa en la idea que el tot és més que la suma de les seves parts."
  },
  {
    "guid": "e8c83cee-178b-4785-b267-d07d3ad740b3",
    "subjectId": "T21",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Quin procés del Disseny del Servei és l'encarregat de mantenir una font única i autoritzada d'informació sobre tots els serveis operatius disponibles per als clients?",
    "answerOptions": [
      {
        "text": "Gestió del Nivell de Servei (SLM)",
        "isCorrect": false,
        "rationale": "SLM utilitza la informació d'aquesta font per negociar els SLAs, però no és el responsable de mantenir la font en si."
      },
      {
        "text": "Gestió de la Configuració i Actius del Servei (en Transició)",
        "isCorrect": false,
        "rationale": "Aquest procés gestiona la CMDB, que conté informació tècnica dels components, no una vista de serveis per al client."
      },
      {
        "text": "Gestió del Catàleg de Serveis",
        "isCorrect": true,
        "rationale": "La funció principal d'aquest procés és crear i mantenir el Catàleg de Serveis com l'única font fiable d'informació sobre els serveis actius."
      },
      {
        "text": "Gestió del Portfoli de Serveis (en Estratègia)",
        "isCorrect": false,
        "rationale": "El Portfoli és més ampli i inclou serveis en desenvolupament i retirats; la pregunta es refereix específicament als serveis operatius."
      }
    ],
    "hint": "Aquest document és sovint la 'botiga' o el 'menú' de serveis que TI ofereix al negoci."
  },
  {
    "guid": "1b29b24c-f74f-4559-9838-1a8d7497069b",
    "subjectId": "T21",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "La gestió de la seguretat de la informació (ISM) dins del Disseny del Servei es basa en l'estàndard ISO/IEC 27001 i se centra en diversos pilars. Quina de les següents opcions NO és un dels pilars principals de la seguretat de la informació esmentats?",
    "answerOptions": [
      {
        "text": "Confidencialitat",
        "isCorrect": false,
        "rationale": "La confidencialitat (garantir que la informació només sigui accessible per a personal autoritzat) és un pilar fonamental de la seguretat."
      },
      {
        "text": "Rendiment",
        "isCorrect": true,
        "rationale": "El rendiment és un requisit no funcional important, gestionat per la Capacitat, però no és un dels pilars clàssics de la seguretat de la informació (CIA)."
      },
      {
        "text": "Integritat",
        "isCorrect": false,
        "rationale": "La integritat (assegurar que la informació sigui precisa i completa) és un pilar fonamental de la seguretat."
      },
      {
        "text": "Disponibilitat",
        "isCorrect": false,
        "rationale": "La disponibilitat (assegurar que la informació i els serveis estiguin disponibles quan es necessiten) és el tercer pilar fonamental de la seguretat (la 'A' de CIA)."
      }
    ],
    "hint": "Pensa en el triangle clàssic de la seguretat: C-I-A."
  },
  {
    "guid": "c1066d99-329d-4875-a9c0-bb6522be71bd",
    "subjectId": "T21",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "En el context de l'Ajuntament de Barcelona, el disseny d'un nou tràmit OVT que requereix connexions amb Padró, GPA, Registre i Arxiu Electrònic és un exemple de:",
    "answerOptions": [
      {
        "text": "Disseny d'un punt únic de fallada (SPOF).",
        "isCorrect": false,
        "rationale": "De fet, un bon disseny buscaria evitar SPOFs en aquestes integracions mitjançant la redundància i l'alta disponibilitat."
      },
      {
        "text": "Aplicació del principi de disseny holístic.",
        "isCorrect": true,
        "rationale": "Aquest escenari demostra la necessitat de considerar múltiples sistemes, processos i dependències (tècniques i organitzatives) de manera conjunta."
      },
      {
        "text": "Gestió de la Capacitat dels components exclusivament.",
        "isCorrect": false,
        "rationale": "Tot i que la capacitat és important, el disseny de les integracions i els fluxos de treball entre sistemes és un aspecte molt més ampli."
      },
      {
        "text": "Creació d'un Underpinning Contract (UC).",
        "isCorrect": false,
        "rationale": "Aquestes són principalment integracions internes entre sistemes de l'Ajuntament, no contractes amb proveïdors externs, tot i que podrien dependre d'algun UC (com el de l'AOC)."
      }
    ],
    "hint": "Aquest exemple mostra com un servei depèn de la coordinació i el disseny conjunt de múltiples parts del sistema."
  },
  {
    "guid": "c02022ef-0217-4dda-98e3-15998034a28c",
    "subjectId": "T21",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Un requisit que especifica que 'el portal OVT ha de poder gestionar 500 sessions concurrents amb un temps de resposta inferior a 2 segons' es classifica com un:",
    "answerOptions": [
      {
        "text": "Requisit funcional",
        "isCorrect": false,
        "rationale": "Un requisit funcional descriuria 'què fa' el servei (ex: 'permetre la presentació de sol·licituds'), no 'com de bé' ho fa."
      },
      {
        "text": "Requisit no funcional",
        "isCorrect": true,
        "rationale": "Aquest tipus de requisit defineix les qualitats del servei, com el rendiment, la capacitat i la disponibilitat, en lloc de les seves funcions específiques."
      },
      {
        "text": "Objectiu de Nivell de Servei (SLO)",
        "isCorrect": false,
        "rationale": "Això podria ser un SLO, però la seva classificació general dins del disseny és com a requisit no funcional. Els SLOs són mètriques específiques dins d'un SLA."
      },
      {
        "text": "Requisit del Pla de Continuïtat",
        "isCorrect": false,
        "rationale": "Els requisits de continuïtat se centren en la recuperació després d'un desastre (RTO/RPO), no en el rendiment en condicions normals d'operació."
      }
    ],
    "hint": "Distingeix entre el que el servei 'fa' i les condicions o qualitats que ha de complir mentre ho 'fa'."
  },
  {
    "guid": "6fd8c801-1e21-4260-a709-3011bcc84ef5",
    "subjectId": "T21",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Quina de les següents afirmacions sobre el Catàleg de Serveis és FALSA?",
    "answerOptions": [
      {
        "text": "És l'única font autoritzada d'informació sobre serveis operatius.",
        "isCorrect": false,
        "rationale": "Aquesta afirmació és vertadera; un dels seus objectius principals és ser la font única i fiable."
      },
      {
        "text": "Conté informació detallada sobre la configuració tècnica de cada servidor i base de dades.",
        "isCorrect": true,
        "rationale": "Aquesta afirmació és falsa; aquesta informació tècnica detallada pertany a la CMDB, no al Catàleg de Serveis."
      },
      {
        "text": "És accessible per als clients i usuaris autoritzats per consultar els serveis disponibles.",
        "isCorrect": false,
        "rationale": "Aquesta afirmació és vertadera; el catàleg té una vista de negoci orientada al client."
      },
      {
        "text": "Exclou els serveis que han estat retirats o que estan en fase de planificació.",
        "isCorrect": false,
        "rationale": "Aquesta afirmació és vertadera; el catàleg només mostra els serveis 'vius' i aprovats, a diferència del Portfoli de Serveis."
      }
    ],
    "hint": "Recorda la diferència clau entre el Catàleg de Serveis (orientat al client) i la CMDB (orientada a la gestió tècnica)."
  },
  {
    "guid": "9aec4ae1-c544-4fbe-b2c3-cef4948f0358",
    "subjectId": "T21",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "En el context de la Gestió de la Continuïtat de Serveis TI (ITSCM), què defineix el concepte de RPO (Recovery Point Objective)?",
    "answerOptions": [
      {
        "text": "El temps màxim que el servei pot estar interromput després d'un desastre.",
        "isCorrect": false,
        "rationale": "Aquesta definició correspon a l'RTO (Recovery Time Objective)."
      },
      {
        "text": "La quantitat màxima de pèrdua de dades acceptable, mesurada en temps.",
        "isCorrect": true,
        "rationale": "L'RPO estableix fins a quin punt en el temps cal recuperar les dades, determinant així la pèrdua màxima de transaccions."
      },
      {
        "text": "La freqüència amb què s'han de realitzar les proves del pla de recuperació.",
        "isCorrect": false,
        "rationale": "La freqüència de les proves és part del pla de continuïtat, però no és la definició de l'RPO."
      },
      {
        "text": "El punt físic on es troba el centre de recuperació de desastres (DRS).",
        "isCorrect": false,
        "rationale": "La ubicació del DRS és una decisió estratègica, però no és el que defineix l'RPO."
      }
    ],
    "hint": "Aquest concepte no es refereix al temps de recuperació, sinó a la 'frescor' de les dades un cop recuperades."
  },
  {
    "guid": "11322057-f2df-432a-9acd-68ff77039d0d",
    "subjectId": "T21",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Quin és un error freqüent que la fase de Disseny del Servei intenta corregir?",
    "answerOptions": [
      {
        "text": "La resolució lenta d'incidents per part del primer nivell de suport.",
        "isCorrect": false,
        "rationale": "Això és un problema operatiu que es gestiona en la fase d'Operació del Servei, encara que un bon disseny pot facilitar la seva resolució."
      },
      {
        "text": "La implementació de canvis no autoritzats en producció.",
        "isCorrect": false,
        "rationale": "Això es controla mitjançant el procés de Gestió de Canvis, que pertany a la fase de Transició del Servei."
      },
      {
        "text": "Serveis que són difícils d'operar i monitoritzar perquè no es va pensar en aquests aspectes.",
        "isCorrect": true,
        "rationale": "Un objectiu clau del Disseny del Servei és garantir que els serveis puguin ser suportats operativament, dissenyant els procediments i eines de monitoratge des del principi."
      },
      {
        "text": "La falta d'alineament entre els objectius de negoci i l'estratègia de TI.",
        "isCorrect": false,
        "rationale": "Aquest és un problema que aborda principalment la fase d'Estratègia del Servei, que proporciona els requisits al Disseny."
      }
    ],
    "hint": "Pensa en problemes que sorgeixen més tard en el cicle de vida perquè no es van planificar correctament al principi."
  },
  {
    "guid": "29c6e483-19b1-4b05-b4b1-5e5620f87a90",
    "subjectId": "T21",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "El concepte de 'Security by Design' (Seguretat des del disseny) implica que la seguretat de la informació ha de ser:",
    "answerOptions": [
      {
        "text": "Una fase de proves que es realitza just abans del desplegament en producció.",
        "isCorrect": false,
        "rationale": "Això seria 'Security by Testing', que és una pràctica reactiva i menys eficaç."
      },
      {
        "text": "Responsabilitat exclusiva de l'equip de Seguretat Informàtica, que audita el servei un cop creat.",
        "isCorrect": false,
        "rationale": "La seguretat des del disseny promou una responsabilitat compartida i proactiva."
      },
      {
        "text": "Un component integral considerat des de l'inici del disseny del servei, no un afegit posterior.",
        "isCorrect": true,
        "rationale": "Aquest principi advoca per incorporar els controls i requisits de seguretat en cada pas del disseny per evitar vulnerabilitats."
      },
      {
        "text": "Un conjunt de polítiques de seguretat que només s'apliquen a serveis que gestionen dades personals.",
        "isCorrect": false,
        "rationale": "La seguretat s'ha de considerar en tots els serveis, encara que el nivell de controls pugui variar segons la criticitat de la informació."
      }
    ],
    "hint": "Aquesta filosofia tracta la seguretat com un ingredient fonamental, no com un condiment que s'afegeix al final."
  },
  {
    "guid": "70f6880e-b17e-48dc-9936-e4f6ae87f9da",
    "subjectId": "T21",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Dins de la Gestió de la Capacitat, el subprocés que s'ocupa de preveure la demanda futura de serveis basant-se en els plans de negoci (com el llançament d'un nou tràmit massiu) s'anomena:",
    "answerOptions": [
      {
        "text": "Capacitat dels components",
        "isCorrect": false,
        "rationale": "Aquest subprocés se centra en el rendiment i la utilització dels recursos tècnics individuals (CPU, RAM, xarxa)."
      },
      {
        "text": "Capacitat del servei",
        "isCorrect": false,
        "rationale": "Aquest subprocés se centra en el rendiment del servei de TI de principi a fi, tal com el percep l'usuari."
      },
      {
        "text": "Capacitat del negoci",
        "isCorrect": true,
        "rationale": "Aquest subprocés tradueix els plans i objectius de negoci en requisits concrets de capacitat i demanda per als serveis de TI."
      },
      {
        "text": "Capacitat reactiva",
        "isCorrect": false,
        "rationale": "La gestió de la capacitat ha de ser proactiva; esperar a reaccionar a la demanda és una mala pràctica que el Disseny del Servei intenta evitar."
      }
    ],
    "hint": "Quin dels tres subprocessos de capacitat està més directament lligat a l'estratègia i les necessitats del client/negoci?"
  },
  {
    "guid": "b8954e06-89eb-4eea-bab5-ae0844afaf0f",
    "subjectId": "T21",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Quin rol dins del Disseny del Servei és el principal responsable de negociar els Acords de Nivell de Servei (SLA) amb el negoci i assegurar-se que es compleixen?",
    "answerOptions": [
      {
        "text": "Capacity Manager",
        "isCorrect": false,
        "rationale": "El Capacity Manager s'assegura que hi ha recursos suficients, la qual cosa és clau per complir els SLA, però no és el responsable de negociar-los."
      },
      {
        "text": "IT Service Continuity Manager",
        "isCorrect": false,
        "rationale": "Aquest rol se centra en els plans de recuperació davant desastres, que poden formar part d'un SLA, però no en la gestió global de l'acord."
      },
      {
        "text": "Service Level Manager",
        "isCorrect": true,
        "rationale": "Aquest rol actua com a pont entre TI i el negoci, sent el principal responsable de la negociació, acord, monitoratge i revisió dels SLAs."
      },
      {
        "text": "Supplier Manager",
        "isCorrect": false,
        "rationale": "El Supplier Manager gestiona els contractes amb proveïdors externs (UCs) que donen suport als SLAs, però no negocia directament l'SLA amb el client."
      }
    ],
    "hint": "El nom d'aquest rol està directament relacionat amb el document que gestiona."
  },
  {
    "guid": "04620e59-d4d8-4617-befb-da586fb6c3be",
    "subjectId": "T21",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Un dels principis fonamentals del Disseny del Servei és el 'Pensament basat en processos'. Això significa que:",
    "answerOptions": [
      {
        "text": "La tecnologia és secundària i només s'ha de considerar si els processos existents no són suficients.",
        "isCorrect": false,
        "rationale": "Aquest principi no menysté la tecnologia, sinó que l'integra com a part d'un procés ben definit."
      },
      {
        "text": "Qualsevol servei ha d'estar suportat per fluxos de treball clars, amb rols i responsabilitats definides.",
        "isCorrect": true,
        "rationale": "Això assegura que el servei es pugui gestionar de manera consistent, repetible i eficient al llarg del seu cicle de vida."
      },
      {
        "text": "S'ha de donar prioritat a l'automatització de tots els processos possibles des del primer moment.",
        "isCorrect": false,
        "rationale": "L'automatització és un objectiu desitjable, però primer cal definir i entendre el procés; no tots els processos són candidats a l'automatització immediata."
      },
      {
        "text": "Els processos de negoci són els únics que s'han de considerar durant el disseny d'un servei TI.",
        "isCorrect": false,
        "rationale": "També s'han de dissenyar els processos de gestió de TI (incidents, canvis, etc.) que suportaran el servei."
      }
    ],
    "hint": "Aquest principi busca evitar la improvisació en la gestió i operació del servei."
  },
  {
    "guid": "e4ef17c9-c967-4583-9b03-cbae5f2c8fc3",
    "subjectId": "T21",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "En el context de PMBOK i ITIL, quina és la relació correcta entre la gestió de projectes i el Disseny del Servei?",
    "answerOptions": [
      {
        "text": "ITIL defineix com construir el servei en termes de temps i pressupost, mentre que PMBOK defineix què ha de fer el servei.",
        "isCorrect": false,
        "rationale": "Aquesta descripció inverteix els rols de cada marc de treball."
      },
      {
        "text": "El Disseny del Servei d'ITIL proporciona els requisits i l'arquitectura, mentre que PMBOK gestiona el projecte per construir-lo.",
        "isCorrect": true,
        "rationale": "ITIL defineix 'què és un bon servei' (el contingut), i PMBOK defineix 'com gestionar el treball' per crear-lo (el continent)."
      },
      {
        "text": "PMBOK i ITIL són marcs de treball incompatibles i no s'han d'utilitzar conjuntament.",
        "isCorrect": false,
        "rationale": "Són complementaris; ITIL se centra en el cicle de vida del servei i PMBOK en el cicle de vida del projecte."
      },
      {
        "text": "La fase de Disseny del Servei substitueix completament la necessitat d'un director de projecte (Project Manager).",
        "isCorrect": false,
        "rationale": "Els rols són diferents i necessaris; el dissenyador del servei se centra en el 'què' i el PM en el 'com, quan i amb quin cost'."
      }
    ],
    "hint": "Pensa en qui defineix les característiques del producte final i qui gestiona el treball per lliurar-lo."
  },
  {
    "guid": "42419d56-2320-4e46-a852-c7f5fb6c4015",
    "subjectId": "T21",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "La identificació d'un únic servidor de signatura sense replicació com un component que, si falla, pot interrompre tot el procés de tràmits, és un exemple d'anàlisi de:",
    "answerOptions": [
      {
        "text": "Capacitat del servei.",
        "isCorrect": false,
        "rationale": "L'anàlisi de capacitat se centraria en si el servidor pot gestionar la càrrega, no en l'impacte de la seva fallada."
      },
      {
        "text": "Punts únics de fallada (SPOF).",
        "isCorrect": true,
        "rationale": "Un SPOF és exactament això: un component la fallada del qual provoca la interrupció de tot el sistema. La seva identificació és clau en la Gestió de la Disponibilitat."
      },
      {
        "text": "Compliment de l'SLA.",
        "isCorrect": false,
        "rationale": "L'existència d'un SPOF segurament afectarà el compliment de l'SLA, però l'activitat d'identificar-lo és part de l'anàlisi de disponibilitat."
      },
      {
        "text": "Requisits funcionals.",
        "isCorrect": false,
        "rationale": "Això es relaciona amb la fiabilitat i la resiliència del servei, que són requisits no funcionals."
      }
    ],
    "hint": "Aquesta activitat és fonamental dins de la Gestió de la Disponibilitat per millorar la resiliència del servei."
  },
  {
    "guid": "debe4333-58a5-48db-bff0-7d5882c2bae3",
    "subjectId": "T21",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Quin dels següents elements NO s'inclouria típicament en un Service Design Package (SDP)?",
    "answerOptions": [
      {
        "text": "L'arquitectura tècnica i funcional del servei.",
        "isCorrect": false,
        "rationale": "Aquesta és una de les parts més importants de l'SDP, ja que descriu com es construirà el servei."
      },
      {
        "text": "Un SLA preliminar acordat amb el negoci.",
        "isCorrect": false,
        "rationale": "L'SDP ha d'incloure els objectius de nivell de servei que el disseny pretén complir."
      },
      {
        "text": "El registre històric de tots els incidents ocorreguts en serveis similars.",
        "isCorrect": true,
        "rationale": "L'històric d'incidents és informació de la fase d'Operació i pot ser un input per al disseny, però no forma part del paquet de lliurament final (output)."
      },
      {
        "text": "Els requisits per a la transició, incloent plans de proves i desplegament.",
        "isCorrect": false,
        "rationale": "Aquesta informació és essencial per a la fase de Transició, que és la receptora de l'SDP."
      }
    ],
    "hint": "Pensa quina informació es genera DURANT el disseny per ser utilitzada DESPRÉS, i quina és informació històrica."
  },
  {
    "guid": "c7d5fbe1-bcf8-4db0-9b39-d2537b61ebd7",
    "subjectId": "T21",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "L'afirmació 'sense utilitat (utility) no hi ha valor' i 'sense garantia (warranty) tampoc' implica que:",
    "answerOptions": [
      {
        "text": "La garantia és més important que la utilitat per a la percepció del client.",
        "isCorrect": false,
        "rationale": "Ambdós conceptes són igualment essencials; un servei inútil o un servei que falla constantment no aporten valor."
      },
      {
        "text": "El valor d'un servei de TI es crea per la combinació de funcionalitat i qualitat.",
        "isCorrect": true,
        "rationale": "El valor només existeix quan el servei fa el que el client necessita (utilitat) i ho fa de manera fiable i amb la qualitat esperada (garantia)."
      },
      {
        "text": "La utilitat és responsabilitat del negoci i la garantia és responsabilitat exclusiva de TI.",
        "isCorrect": false,
        "rationale": "TI és responsable de lliurar ambdós aspectes, tot i que els requisits d'utilitat provenen directament del negoci."
      },
      {
        "text": "Un servei pot aportar valor si té una excel·lent garantia, encara que la seva utilitat sigui baixa.",
        "isCorrect": false,
        "rationale": "Un servei extremadament fiable que no fa el que el client necessita, no té cap valor per a aquest client."
      }
    ],
    "hint": "El valor per al client només es materialitza quan ambdues condicions es compleixen simultàniament."
  },
  {
    "guid": "d3db5092-6965-404d-91c5-63fb534f0a4f",
    "subjectId": "T21",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Quina eina o model s'utilitza habitualment en el Disseny del Servei per definir rols i responsabilitats en un procés?",
    "answerOptions": [
      {
        "text": "UML (Unified Modeling Language)",
        "isCorrect": false,
        "rationale": "UML s'utilitza principalment per al modelatge de sistemes de programari (classes, seqüències, etc.), no per a rols organitzatius."
      },
      {
        "text": "BPMN (Business Process Model and Notation)",
        "isCorrect": false,
        "rationale": "BPMN s'utilitza per modelar els fluxos de treball i les activitats d'un procés, però no detalla específicament qui és responsable de cada pas."
      },
      {
        "text": "Matrius RACI",
        "isCorrect": true,
        "rationale": "Una matriu RACI (Responsible, Accountable, Consulted, Informed) és una eina estàndard per clarificar i assignar rols i responsabilitats en processos i projectes."
      },
      {
        "text": "Heatmaps de disponibilitat",
        "isCorrect": false,
        "rationale": "Els heatmaps s'utilitzen per visualitzar dades, com ara els períodes de major o menor disponibilitat, no per definir responsabilitats."
      }
    ],
    "hint": "Aquesta eina assigna a les persones o rols quatre nivells de participació en una tasca."
  },
  {
    "guid": "854d28ee-ed01-4394-8cbc-8d1cd5e3e115",
    "subjectId": "T21",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "L'objectiu principal de la fase de Disseny del Servei és:",
    "answerOptions": [
      {
        "text": "Construir i desplegar serveis de TI nous o modificats.",
        "isCorrect": false,
        "rationale": "La construcció i el desplegament són activitats pròpies de la fase de Transició del Servei."
      },
      {
        "text": "Operar i monitoritzar els serveis de TI en el dia a dia.",
        "isCorrect": false,
        "rationale": "Aquest és l'objectiu de la fase d'Operació del Servei."
      },
      {
        "text": "Definir i planificar serveis de TI que compleixin els requisits de negoci i puguin ser operats eficientment.",
        "isCorrect": true,
        "rationale": "El Disseny actua com un pla mestre, creant el 'blueprint' del servei abans de la seva construcció per garantir que aporti valor i sigui sostenible."
      },
      {
        "text": "Identificar oportunitats de millora contínua en els serveis existents.",
        "isCorrect": false,
        "rationale": "Aquest és l'objectiu principal de la fase de Millora Contínua del Servei (CSI)."
      }
    ],
    "hint": "Aquesta fase no 'fa', sinó que 'planeja com fer'."
  },
  {
    "guid": "6eb58090-e4cb-44c1-98d4-69efe4fa2105",
    "subjectId": "T21",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Confondre el Catàleg de Serveis amb el Portfoli de Serveis és un error comú. La diferència clau és que:",
    "answerOptions": [
      {
        "text": "El Portfoli només inclou serveis en fase d'estratègia i el Catàleg només serveis operatius.",
        "isCorrect": false,
        "rationale": "El Portfoli és més complet, inclou serveis en totes les fases del seu cicle de vida."
      },
      {
        "text": "El Portfoli és una vista interna per a la gestió de TI, mentre que el Catàleg té una vista orientada al client.",
        "isCorrect": true,
        "rationale": "El Portfoli ajuda a TI a gestionar tot el cicle de vida dels serveis (pipeline, catàleg, retirats). El Catàleg presenta al client els serveis que pot sol·licitar."
      },
      {
        "text": "El Catàleg és un document físic i el Portfoli és una base de dades.",
        "isCorrect": false,
        "rationale": "Ambdós poden existir en diferents formats; la diferència rau en el seu contingut i audiència, no en el seu format físic."
      },
      {
        "text": "El Catàleg conté informació financera i el Portfoli informació tècnica.",
        "isCorrect": false,
        "rationale": "Ambdós contenen diferents tipus d'informació. El Portfoli és l'eina estratègica completa i el Catàleg és el subconjunt de serveis actius."
      }
    ],
    "hint": "Pensa en quin dels dos té una visió completa de passat, present i futur, i quin només del present."
  },

    {
      "guid": "b32dd8a3-6ac0-4bc5-b9f1-3f060e7f7a01",
      "subjectId": "T21",
      "difficulty": 4,
      "origin": "OPOS24_gpt",
      "type": "test",
      "question": "Quin dels següents elements NO forma part del contingut obligatori d’un Service Design Package (SDP), tot i que sovint es confon com a requisit del disseny?",
      "answerOptions": [
        {
          "text": "El pla de transició detallat amb calendari de desplegaments i finestres de canvi aprovades.",
          "isCorrect": true,
          "rationale": "El pla de transició detallat és responsabilitat de la fase de Transició del Servei, no del Disseny. El Disseny defineix requisits de transició, però no el calendari ni els canvis específics."
        },
        {
          "text": "Els requisits de disponibilitat i rendiment del servei.",
          "isCorrect": false,
          "rationale": "Aquests són contingut essencial del SDP i es defineixen sempre en la fase de Disseny."
        },
        {
          "text": "L’arquitectura funcional i tècnica prevista del servei.",
          "isCorrect": false,
          "rationale": "L’arquitectura és un element nuclear del Disseny i sempre va inclosa al SDP."
        },
        {
          "text": "Les dependències amb proveïdors externs i els seus UC.",
          "isCorrect": false,
          "rationale": "Els Underpinning Contracts formen part de la visió completa del servei i són component del SDP."
        }
      ],
      "hint": "Disseny defineix requisits, no execució ni calendaris."
    },
    {
      "guid": "f0a6ab47-c47a-4359-8481-c5412c799002",
      "subjectId": "T21",
      "difficulty": 4,
      "origin": "OPOS24_gpt",
      "type": "test",
      "question": "Quina afirmació descriu de forma més precisa la diferència entre disponibilitat i continuïtat segons ITIL?",
      "answerOptions": [
        {
          "text": "La disponibilitat s’orienta al funcionament habitual; la continuïtat s’orienta a situacions de desastre i interrupcions greus.",
          "isCorrect": true,
          "rationale": "ITIL distingeix clarament: disponibilitat = funcionament normal; continuïtat = recuperació en desastres."
        },
        {
          "text": "La continuïtat és un subconjunt de la disponibilitat, centrat en temps de resposta i rendiment.",
          "isCorrect": false,
          "rationale": "Això és fals: rendiment i temps resposta són temes de capacitat."
        },
        {
          "text": "La disponibilitat només és responsabilitat dels proveïdors externs.",
          "isCorrect": false,
          "rationale": "És una responsabilitat compartida entre TI, proveïdors i l’arquitectura definida."
        },
        {
          "text": "La continuïtat centra exclusivament en l’evitació de punts únics de fallada.",
          "isCorrect": false,
          "rationale": "Eliminar SPOFs és disponibilitat, no continuïtat."
        }
      ]
    },
    {
      "guid": "d47c5942-6547-4449-80d2-7237eb193003",
      "subjectId": "T21",
      "difficulty": 4,
      "origin": "OPOS24_gpt",
      "type": "test",
      "question": "Quina de les següents opcions és un error conceptual habitual respecte a la Gestió del Catàleg de Serveis?",
      "answerOptions": [
        {
          "text": "Pensar que el Catàleg inclou serveis retirats o en fase de projecte.",
          "isCorrect": true,
          "rationale": "El Catàleg només inclou serveis operatius i aprovats. Serveis futurs o retirats estan al Portfoli, no al Catàleg."
        },
        {
          "text": "Mantenir informació sobre canals d’accés i costos.",
          "isCorrect": false,
          "rationale": "Això és correcte i forma part del catàleg."
        },
        {
          "text": "Incloure la matriu de suport del servei.",
          "isCorrect": false,
          "rationale": "També és correcte i forma part del Catàleg."
        },
        {
          "text": "Incloure enllaços o referències als SLA vigents.",
          "isCorrect": false,
          "rationale": "És correcte; el catàleg ha d’incorporar aquesta informació."
        }
      ]
    },

    {
      "guid": "7ff20d59-ae47-47bc-9f13-bc3fb31ce004",
      "subjectId": "T21",
      "difficulty": 4,
      "origin": "OPOS24_gpt",
      "type": "test",
      "question": "Quina afirmació descriu millor la relació entre el Service Portfolio i el Catàleg de Serveis?",
      "answerOptions": [
        {
          "text": "El Catàleg és la part operativa i visible del Portfoli.",
          "isCorrect": true,
          "rationale": "Correcte: el Catàleg és la part pública i operativa del Portfoli."
        },
        {
          "text": "El Portfoli és un subconjunt del Catàleg.",
          "isCorrect": false,
          "rationale": "És al revés: el Portfoli inclou tot."
        },
        {
          "text": "El Catàleg només inclou serveis retirats.",
          "isCorrect": false,
          "rationale": "Fals: serveis retirats són part del Portfoli però no del Catàleg."
        },
        {
          "text": "El Portfoli només conté serveis que encara no han estat aprovats.",
          "isCorrect": false,
          "rationale": "Fals: conté futurs, actius i retirats."
        }
      ]
    },

    {
      "guid": "bbba643f-91b0-4bd4-9e19-8449b0d2e005",
      "subjectId": "T21",
      "difficulty": 4,
      "origin": "OPOS24_gpt",
      "type": "test",
      "question": "Quin dels següents casos és un exemple correcte de Warranty segons la definició ITIL?",
      "answerOptions": [
        {
          "text": "Garantir que el servei de signatura electrònica d’un ajuntament estarà disponible un 99,9% del temps.",
          "isCorrect": true,
          "rationale": "Warranty són garanties de qualitat: disponibilitat, seguretat, capacitat."
        },
        {
          "text": "Permetre que el servei admeti adjuntar PDFs i imatges.",
          "isCorrect": false,
          "rationale": "Això és Utility, funcionalitat."
        },
        {
          "text": "Incloure una API d’enviament de dades a tercers per interoperabilitat.",
          "isCorrect": false,
          "rationale": "També és Utility."
        },
        {
          "text": "Incorporar al servei la validació automàtica de camps obligatoris.",
          "isCorrect": false,
          "rationale": "És funcionalitat, per tant Utility."
        }
      ]
    },

    {
      "guid": "9bdb229a-222e-4f2a-a454-098625330006",
      "subjectId": "T21",
      "difficulty": 4,
      "origin": "OPOS24_gpt",
      "type": "test",
      "question": "En quin cas un OLA pot afectar negativament el compliment d’un SLA?",
      "answerOptions": [
        {
          "text": "Quan l’OLA ofereix un temps de resolució intern més lent que el compromís establert al SLA.",
          "isCorrect": true,
          "rationale": "Si l’OLA no suporta l’SLA, l’SLA es trenca."
        },
        {
          "text": "Quan l’OLA defineix rols interns clarament.",
          "isCorrect": false,
          "rationale": "Això millora la capacitat de complir SLA."
        },
        {
          "text": "Quan l’OLA especifica els contactes de nivell 2 de suport.",
          "isCorrect": false,
          "rationale": "No afecta negativament."
        },
        {
          "text": "Quan l’OLA contempla escenaris d’escalat intern.",
          "isCorrect": false,
          "rationale": "Això facilita el compliment de l’SLA."
        }
      ]
    },

    {
      "guid": "c585cf33-a3be-412c-97e6-abbc80cfe007",
      "subjectId": "T21",
      "difficulty": 4,
      "origin": "OPOS24_gpt",
      "type": "test",
      "question": "Quina afirmació sobre SPOFs (Single Points of Failure) és incorrecta segons ITIL?",
      "answerOptions": [
        {
          "text": "Els SPOFs són principalment una preocupació de la Gestió de la Disponibilitat.",
          "isCorrect": false,
          "rationale": "És correcte: Eliminació de SPOFs és clau de disponibilitat."
        },
        {
          "text": "Els SPOFs poden existir tant en infraestructura com en processos.",
          "isCorrect": false,
          "rationale": "Correcte: processos sense substituts també creen SPOFs."
        },
        {
          "text": "La seva eliminació forma part de les pràctiques de disseny de serveis fiables.",
          "isCorrect": false,
          "rationale": "És correcte: eliminar SPOFs forma part del bon disseny."
        },
        {
          "text": "Els SPOFs es consideren un problema exclusiu de la Gestió de la Continuïtat.",
          "isCorrect": true,
          "rationale": "Incorrecte: són principalment un tema de Disponibilitat, no de Continuïtat."
        }
      ]
    },

    {
      "guid": "41a73c36-4f5c-4e39-824d-50d6119c8008",
      "subjectId": "T21",
      "difficulty": 4,
      "origin": "OPOS24_gpt",
      "type": "test",
      "question": "Quin element d’entre els següents NO és responsabilitat pròpia de la Gestió de la Capacitat?",
      "answerOptions": [
        {
          "text": "Definir els llindars de saturació de CPU, memòria i I/O d’un servei.",
          "isCorrect": false,
          "rationale": "Això és responsabilitat clara de Capacity Management."
        },
        {
          "text": "Avaluar la demanda futura basada en creixement previst del negoci.",
          "isCorrect": false,
          "rationale": "Això també és part de Capacity (Business Capacity)."
        },
        {
          "text": "Assegurar que la capacitat disponible compleix l’SLA.",
          "isCorrect": false,
          "rationale": "Funció directa de Capacity Management."
        },
        {
          "text": "Definir els requisits de recuperació RTO i RPO.",
          "isCorrect": true,
          "rationale": "RTO i RPO són responsabilitat de Continuïtat, no Capacitat."
        }
      ]
    },

    {
      "guid": "c27fa751-fc71-476e-be62-44dd0bd61009",
      "subjectId": "T21",
      "difficulty": 4,
      "origin": "OPOS24_gpt",
      "type": "test",
      "question": "Quina afirmació descriu millor la funció primària de la Gestió de la Seguretat de la Informació en el context d’ITIL?",
      "answerOptions": [
        {
          "text": "Assegurar la confidencialitat, integritat, disponibilitat i autenticitat del servei d’acord amb els requisits definits en el Disseny.",
          "isCorrect": true,
          "rationale": "Aquesta és la definició exacta del procés segons ITIL."
        },
        {
          "text": "Aprovar totes les peticions de canvi de seguretat.",
          "isCorrect": false,
          "rationale": "Això és responsabilitat de CAB, no del procés de seguretat."
        },
        {
          "text": "Determinar els costos de cada component de seguretat.",
          "isCorrect": false,
          "rationale": "Això no forma part del procés principal."
        },
        {
          "text": "Definir els fluxos de resolució d’incidències de seguretat.",
          "isCorrect": false,
          "rationale": "Forma part d’Operació o del SOC."
        }
      ]
    },

    {
      "guid": "1d5682cb-465a-49aa-aa55-a66af5f2010a",
      "subjectId": "T21",
      "difficulty": 4,
      "origin": "OPOS24_gpt",
      "type": "test",
      "question": "Quina de les següents afirmacions sobre SLA és falsa?",
      "answerOptions": [
        {
          "text": "Un SLA ha d’estar suportat per OLA i UC coherents.",
          "isCorrect": false,
          "rationale": "Això és veritat: és la base de la cadena de valor."
        },
        {
          "text": "Els SLA estableixen compromisos entre TI i negoci.",
          "isCorrect": false,
          "rationale": "Correcte."
        },
        {
          "text": "Els SLA són documentació interna i no es comparteixen amb negoci.",
          "isCorrect": true,
          "rationale": "Fals: els SLA són precisament TI ⇄ Negoci."
        },
        {
          "text": "Els SLA defineixen nivells mesurables i verificables.",
          "isCorrect": false,
          "rationale": "Correcte."
        }
      ]
    },
    {
  "guid": "4c23d57a-0fd2-4f5f-bc8f-e3f602de2011",
  "subjectId": "T21",
  "difficulty": 4,
  "origin": "OPOS24_gpt",
  "type": "test",
  "question": "Quina és la diferència més precisa entre un SLA i un OLA en el context del Disseny del Servei?",
  "answerOptions": [
    {
      "text": "L’SLA defineix compromisos TI-negoci; l’OLA defineix compromisos TI-TI per suportar l’SLA.",
      "isCorrect": true,
      "rationale": "Aquesta és la definició clau. L’OLA suporta l’SLA des de dins de TI."
    },
    {
      "text": "L’OLA és sempre més estricte que l’SLA.",
      "isCorrect": false,
      "rationale": "Tot i que sovint ho és, no és obligatori ni sempre cert."
    },
    {
      "text": "Els SLA només s'usen en serveis interns.",
      "isCorrect": false,
      "rationale": "Els SLA són principalment TI-negoci, no interns."
    },
    {
      "text": "Un OLA és un contracte legal entre TI i un proveïdor extern.",
      "isCorrect": false,
      "rationale": "Això és un Underpinning Contract (UC)."
    }
  ]
}
,
{
  "guid": "ea8a90cf-4b0d-4a65-9553-483e765b3012",
  "subjectId": "T21",
  "difficulty": 4,
  "origin": "OPOS24_gpt",
  "type": "test",
  "question": "Quin dels següents és un error habitual sobre la Gestió de la Capacitat, segons ITIL?",
  "answerOptions": [
    {
      "text": "Pensar que la capacitat només afecta als recursos tècnics i no al negoci.",
      "isCorrect": true,
      "rationale": "Error comú: la capacitat inclou Business Capacity, Service Capacity i Component Capacity."
    },
    {
      "text": "Incloure anàlisi de tendències de consum.",
      "isCorrect": false,
      "rationale": "Això és correcte i habitual en capacitat."
    },
    {
      "text": "Planificar capacitat futura segons creixement previst.",
      "isCorrect": false,
      "rationale": "Forma part del procés."
    },
    {
      "text": "Mesurar llindars de CPU i memòria.",
      "isCorrect": false,
      "rationale": "Això és una activitat central del procés."
    }
  ]
}
,
{
  "guid": "77bda76e-9fa8-4e36-a91f-d1041b8f2013",
  "subjectId": "T21",
  "difficulty": 4,
  "origin": "OPOS24_gpt",
  "type": "test",
  "question": "Segons ITIL, quina és la funció principal del procés de Gestió de la Continuïtat de Serveis TI?",
  "answerOptions": [
    {
      "text": "Garantir que el servei pot recuperar-se en temps acceptables en cas de desastre.",
      "isCorrect": true,
      "rationale": "És la definició exacta: RTO, RPO, DRP."
    },
    {
      "text": "Assegurar que el servei funciona sense interrupcions en condicions normals.",
      "isCorrect": false,
      "rationale": "Això és disponibilitat, no continuïtat."
    },
    {
      "text": "Controlar incidències i problemes relacionats amb interrupcions.",
      "isCorrect": false,
      "rationale": "És responsabilitat d’Operació."
    },
    {
      "text": "Evitar tota possibilitat de fallada.",
      "isCorrect": false,
      "rationale": "Cap procés pot garantir això."
    }
  ]
}
,
{
  "guid": "5cf478c4-cff8-4be6-9bb5-7d5ae62e2014",
  "subjectId": "T21",
  "difficulty": 4,
  "origin": "OPOS24_gpt",
  "type": "test",
  "question": "Quin error conceptual és més freqüent respecte la Gestió de la Seguretat de la Informació en el Disseny del Servei?",
  "answerOptions": [
    {
      "text": "Pensar que només aplica quan hi ha dades personals.",
      "isCorrect": true,
      "rationale": "Error comú: aplica sempre, independentment del tipus de dades."
    },
    {
      "text": "Incorporar controls d’integritat i confidencialitat.",
      "isCorrect": false,
      "rationale": "És correcte."
    },
    {
      "text": "Establir polítiques d’accés i autenticació.",
      "isCorrect": false,
      "rationale": "Forma part del procés."
    },
    {
      "text": "Definir criteris bàsics d’auditoria.",
      "isCorrect": false,
      "rationale": "És part del procés també."
    }
  ]
}
,
{
  "guid": "c57ea565-58dc-4cbe-b36d-1ecb177c2015",
  "subjectId": "T21",
  "difficulty": 4,
  "origin": "OPOS24_gpt",
  "type": "test",
  "question": "Quin element NO forma part dels 5 aspectes del Disseny del Servei d’ITIL?",
  "answerOptions": [
    {
      "text": "El disseny del detall de les proves unitàries del codi.",
      "isCorrect": true,
      "rationale": "Això es defineix en Transició, no en Disseny."
    },
    {
      "text": "El disseny de mètriques i mètodes de mesura.",
      "isCorrect": false,
      "rationale": "Forma part dels 5 aspectes."
    },
    {
      "text": "El disseny de processos TI.",
      "isCorrect": false,
      "rationale": "És un dels aspectes centrals."
    },
    {
      "text": "El disseny d’arquitectura tecnològica.",
      "isCorrect": false,
      "rationale": "També és part dels 5 aspectes."
    }
  ]
}
,
{
  "guid": "299eed3f-4bb7-44b5-b3bb-eaa08c0c2016",
  "subjectId": "T21",
  "difficulty": 4,
  "origin": "OPOS24_gpt",
  "type": "test",
  "question": "Quin cas representa una aplicació incorrecta del concepte Warranty?",
  "answerOptions": [
    {
      "text": "Afegir un nou formulari per permetre adjuntar vídeos.",
      "isCorrect": true,
      "rationale": "És funcionalitat (Utility), no garantia del servei."
    },
    {
      "text": "Incrementar el percentatge de disponibilitat garantit.",
      "isCorrect": false,
      "rationale": "Això és Warranty."
    },
    {
      "text": "Aplicar replicació activa-activa.",
      "isCorrect": false,
      "rationale": "També és Warranty (disponibilitat i capacitat)."
    },
    {
      "text": "Millorar la seguretat d’accés amb MFA.",
      "isCorrect": false,
      "rationale": "Seguretat també és Warranty."
    }
  ]
}
,
{
  "guid": "2c91f402-12ad-4adf-b8fa-7715f0d92017",
  "subjectId": "T21",
  "difficulty": 4,
  "origin": "OPOS24_gpt",
  "type": "test",
  "question": "Quina afirmació descriu de manera incorrecta el rol del Catàleg de Serveis?",
  "answerOptions": [
    {
      "text": "Inclou serveis publicats i operatius amb informació clara.",
      "isCorrect": false,
      "rationale": "Això és correcte."
    },
    {
      "text": "És l’única font autoritzada d’informació dels serveis disponibles.",
      "isCorrect": false,
      "rationale": "Cert."
    },
    {
      "text": "Inclou informació sobre nivells de servei i canals d’accés.",
      "isCorrect": false,
      "rationale": "També és correcte."
    },
    {
      "text": "Inclou serveis retirats per mantenir traçabilitat històrica.",
      "isCorrect": true,
      "rationale": "Això és fals: serveis retirats només són al Portfoli, no al Catàleg."
    }
  ]
}
,
{
  "guid": "c49a6a3b-0895-40c5-a938-9cc1623b2018",
  "subjectId": "T21",
  "difficulty": 4,
  "origin": "OPOS24_gpt",
  "type": "test",
  "question": "Quin element NO és una responsabilitat del procés de Gestió de Proveïdors?",
      "answerOptions": [
        {
          "text": "Negociar i mantenir els Underpinning Contracts que suporten SLA.",
          "isCorrect": false,
          "rationale": "Això és correcte i central per Supplier Management."
        },
        {
          "text": "Monitoritzar el compliment de compromisos dels proveïdors.",
          "isCorrect": false,
          "rationale": "Forma part de Supplier Management."
        },
        {
          "text": "Avaluar riscos de dependència amb tercers.",
          "isCorrect": false,
          "rationale": "És una de les seves funcions."
        },
        {
          "text": "Definir el pla de proves d’integració entre aplicacions TI.",
          "isCorrect": true,
          "rationale": "És una activitat de Transició, no de Supplier Management."
        }
      ]
}
,
{
  "guid": "fa1b96f1-798a-4f90-b096-f2477fd12019",
  "subjectId": "T21",
  "difficulty": 4,
  "origin": "OPOS24_gpt",
  "type": "test",
  "question": "Quina afirmació sobre el Service Design Package és FALSA?",
  "answerOptions": [
    {
      "text": "Inclou requisits de seguretat, capacitat i disponibilitat.",
      "isCorrect": false,
      "rationale": "Això és cert."
    },
    {
      "text": "Serveix com a base per activitats de Transició com proves i desplegaments.",
      "isCorrect": false,
      "rationale": "Això és correcte."
    },
    {
      "text": "Inclou el disseny complet de processos TI necessaris.",
      "isCorrect": false,
      "rationale": "Cert també."
    },
    {
      "text": "Inclou el pla detallat de gestió de canvis operatius.",
      "isCorrect": true,
      "rationale": "Fals: canvis operatius es gestionen a Transició i Operació."
    }
  ]
}
,
{
  "guid": "cc53b5d3-7a5b-4ced-ac60-f31cf6f12020",
  "subjectId": "T21",
  "difficulty": 4,
  "origin": "OPOS24_gpt",
  "type": "test",
  "question": "Quina afirmació respecte Utility i Warranty és incorrecta?",
  "answerOptions": [
    {
      "text": "Utility proporciona la funcionalitat que necessita el negoci.",
      "isCorrect": false,
      "rationale": "Correcte."
    },
    {
      "text": "Warranty garanteix qualitat en termes de seguretat, disponibilitat i capacitat.",
      "isCorrect": false,
      "rationale": "Correcte segons ITIL."
    },
    {
      "text": "Un servei pot tenir valor encara que falli la warranty si la utility funciona.",
      "isCorrect": true,
      "rationale": "Fals: sense utilitat o sense garantia no hi ha valor segons ITIL."
    },
    {
      "text": "Són necessaris tots dos per aportar valor al servei.",
      "isCorrect": false,
      "rationale": "Correcte."
    }
  ]
},
  {
    "guid": "bf3dcdd9-54e4-4f5a-9f8f-0f11cf011001",
    "subjectId": "T21",
    "difficulty": 1,
    "origin": "OPOS24_gpt",
    "type": "truefalse",
    "question": "El Catàleg de Serveis només conté serveis que estan actualment operatius i aprovats.",
    "answerOptions": [
      {
        "text": "Cert",
        "isCorrect": true,
        "rationale": "El Catàleg només inclou serveis vius i disponibles. Els serveis futurs o retirats formen part del Portfoli."
      },
      {
        "text": "Fals",
        "isCorrect": false,
        "rationale": "Serveis retirats o en evolució no formen part del Catàleg."
      }
    ]
  },
  {
    "guid": "2a349e2c-fc0f-4afc-86df-432f31011002",
    "subjectId": "T21",
    "difficulty": 2,
    "origin": "OPOS24_gpt",
    "type": "truefalse",
    "question": "Un OLA és un acord intern entre equips TI que ajuda a donar suport als SLA amb negoci.",
    "answerOptions": [
      {
        "text": "Cert",
        "isCorrect": true,
        "rationale": "Els Operational Level Agreements suporten de manera interna els compromisos del SLA."
      },
      {
        "text": "Fals",
        "isCorrect": false,
        "rationale": "Els OLA no són contractes externs ni substitueixen els SLA."
      }
    ]
  },
  {
    "guid": "8c0aa431-9352-4187-9e26-e68131011003",
    "subjectId": "T21",
    "difficulty": 3,
    "origin": "OPOS24_gpt",
    "type": "truefalse",
    "question": "El Service Design Package (SDP) és un document creat en Transició i consumit per Operació.",
    "answerOptions": [
      {
        "text": "Cert",
        "isCorrect": false,
        "rationale": "El SDP es crea en Disseny i és un input directe per a Transició."
      },
      {
        "text": "Fals",
        "isCorrect": true,
        "rationale": "És un error habitual: el SDP es produeix en Disseny del Servei."
      }
    ]
  },
  {
    "guid": "c837160e-4330-468d-8b95-f2cd31011004",
    "subjectId": "T21",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "truefalse",
    "question": "Utility correspon a la capacitat del servei d’oferir valor a través de garanties com disponibilitat o seguretat.",
    "answerOptions": [
      {
        "text": "Cert",
        "isCorrect": false,
        "rationale": "Utility = utilitat funcional. Garanties és Warranty."
      },
      {
        "text": "Fals",
        "isCorrect": true,
        "rationale": "Warranty = garanties. Utility = funcionalitat."
      }
    ]
  },
  {
    "guid": "8bfa4b21-a24c-4596-9a0d-73bb31011005",
    "subjectId": "T21",
    "difficulty": 3,
    "origin": "OPOS24_gpt",
    "type": "truefalse",
    "question": "Elimina un punt únic de fallada (SPOF) és principalment una activitat relacionada amb la Gestió de Disponibilitat.",
    "answerOptions": [
      {
        "text": "Cert",
        "isCorrect": true,
        "rationale": "Eliminar SPOFs és un objectiu clau de la disponibilitat."
      },
      {
        "text": "Fals",
        "isCorrect": false,
        "rationale": "No és responsabilitat de Continuïtat, malgrat la confusió habitual."
      }
    ]
  },
  {
    "guid": "4cd92a23-3e43-4d0c-88f5-bbd331011006",
    "subjectId": "T21",
    "difficulty": 1,
    "origin": "OPOS24_gpt",
    "type": "truefalse",
    "question": "La Gestió de la Seguretat de la Informació defineix controls d’auditoria per garantir la traçabilitat.",
    "answerOptions": [
      {
        "text": "Cert",
        "isCorrect": true,
        "rationale": "Traçabilitat és una part essencial dels controls de seguretat."
      },
      {
        "text": "Fals",
        "isCorrect": false,
        "rationale": "Aquesta és una responsabilitat directa del procés."
      }
    ]
  },
  {
    "guid": "b342f73a-2fc0-4b43-8d0f-90a131011007",
    "subjectId": "T21",
    "difficulty": 2,
    "origin": "OPOS24_gpt",
    "type": "truefalse",
    "question": "Els Underpinning Contracts (UC) són acords entre TI i proveïdors externs que suporten compromisos de SLA.",
    "answerOptions": [
      {
        "text": "Cert",
        "isCorrect": true,
        "rationale": "És la definició exacta segons ITIL."
      },
      {
        "text": "Fals",
        "isCorrect": false,
        "rationale": "Els UC no són acords interns, sinó contractes amb tercers."
      }
    ]
  },
  {
    "guid": "bafc604c-5f71-4f7a-8b3b-4c9131011008",
    "subjectId": "T21",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "truefalse",
    "question": "Un servei pot aportar valor encara que la seva Warranty no estigui garantida, mentre la Utility funcioni.",
    "answerOptions": [
      {
        "text": "Cert",
        "isCorrect": false,
        "rationale": "Sense Warranty no hi ha valor, encara que la funcionalitat sigui correcta."
      },
      {
        "text": "Fals",
        "isCorrect": true,
        "rationale": "ITIL estableix clarament que el valor requereix Utility + Warranty."
      }
    ]
  },
  {
    "guid": "3f702f92-40ce-4580-a27d-0ed031011009",
    "subjectId": "T21",
    "difficulty": 1,
    "origin": "OPOS24_gpt",
    "type": "truefalse",
    "question": "El Disseny del Servei inclou sempre el disseny de processos TI relacionats amb el servei.",
    "answerOptions": [
      {
        "text": "Cert",
        "isCorrect": true,
        "rationale": "El disseny de processos és un dels 5 aspectes clau."
      },
      {
        "text": "Fals",
        "isCorrect": false,
        "rationale": "Sense processos no hi ha servei sostenible."
      }
    ]
  },
  {
    "guid": "6cd8c73c-e5d3-41fe-ad51-bf9331011010",
    "subjectId": "T21",
    "difficulty": 3,
    "origin": "OPOS24_gpt",
    "type": "truefalse",
    "question": "El Catàleg de Serveis i la CMDB tenen com a objectiu gestionar la informació del servei, però el Catàleg conté més detall tècnic que la CMDB.",
    "answerOptions": [
      {
        "text": "Cert",
        "isCorrect": false,
        "rationale": "La CMDB és la font tècnica. El Catàleg és funcional, no tècnic."
      },
      {
        "text": "Fals",
        "isCorrect": true,
        "rationale": "És una trampa molt típica: la CMDB conté el detall tècnic, no el catàleg."
      }
    ]
  },
  {
    "guid": "0ef2433e-2e81-4dbd-946a-3ce331011011",
    "subjectId": "T21",
    "difficulty": 2,
    "origin": "OPOS24_gpt",
    "type": "truefalse",
    "question": "La Gestió de la Continuïtat defineix i manté els plans RTO i RPO del servei.",
    "answerOptions": [
      {
        "text": "Cert",
        "isCorrect": true,
        "rationale": "RTO i RPO formen part central del procés ITSCM."
      },
      {
        "text": "Fals",
        "isCorrect": false,
        "rationale": "No són responsabilitat de Disponibilitat ni de Capacitat."
      }
    ]
  },
  {
    "guid": "59a9b39d-fa3a-4bc2-8d70-71f331011012",
    "subjectId": "T21",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "truefalse",
    "question": "Les mètriques del servei s’han de definir exclusivament a la fase d'Operació.",
    "answerOptions": [
      {
        "text": "Cert",
        "isCorrect": false,
        "rationale": "Les mètriques es defineixen en Disseny, no només en Operació."
      },
      {
        "text": "Fals",
        "isCorrect": true,
        "rationale": "Operació només les executa; Disseny les defineix."
      }
    ]
  },
  {
    "guid": "16649d92-547a-4fb1-b17b-888331011013",
    "subjectId": "T21",
    "difficulty": 1,
    "origin": "OPOS24_gpt",
    "type": "truefalse",
    "question": "El Disseny del Servei determina la infraestructura necessària per als nous serveis TI.",
    "answerOptions": [
      {
        "text": "Cert",
        "isCorrect": true,
        "rationale": "L'arquitectura tecnològica és un dels 5 aspectes del disseny."
      },
      {
        "text": "Fals",
        "isCorrect": false,
        "rationale": "El Disseny defineix la infraestructura abans de Transició."
      }
    ]
  },
  {
    "guid": "af2cf8f5-4891-4b1f-862d-a57f31011014",
    "subjectId": "T21",
    "difficulty": 3,
    "origin": "OPOS24_gpt",
    "type": "truefalse",
    "question": "Els SLA només poden incloure compromisos de disponibilitat.",
    "answerOptions": [
      {
        "text": "Cert",
        "isCorrect": false,
        "rationale": "Els SLA inclouen rendiment, suport, temps resposta, seguretat…"
      },
      {
        "text": "Fals",
        "isCorrect": true,
        "rationale": "ITIL defineix SLA molt més amplis."
      }
    ]
  },
  {
    "guid": "ebf35d90-5b3f-41d2-b366-a71331011015",
    "subjectId": "T21",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "truefalse",
    "question": "La Gestió de Proveïdors és l’encarregada d’elaborar el pla de proves d'integració.",
    "answerOptions": [
      {
        "text": "Cert",
        "isCorrect": false,
        "rationale": "El pla de proves és responsabilitat de Transició."
      },
      {
        "text": "Fals",
        "isCorrect": true,
        "rationale": "Supplier Management controla contractes i rendiment, no proves."
      }
    ]
  },
  {
    "guid": "cf4932dc-a4e2-4151-b0ba-24f331011016",
    "subjectId": "T21",
    "difficulty": 2,
    "origin": "OPOS24_gpt",
    "type": "truefalse",
    "question": "El Disseny del Servei incorpora la planificació de capacitat futura basada en creixement previst.",
    "answerOptions": [
      {
        "text": "Cert",
        "isCorrect": true,
        "rationale": "Forma part de Business Capacity Management."
      },
      {
        "text": "Fals",
        "isCorrect": false,
        "rationale": "No és només una activitat de Transició."
      }
    ]
  },
  {
    "guid": "9d307092-9b48-4a6d-87bd-c2de31011017",
    "subjectId": "T21",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "truefalse",
    "question": "Els processos TI no formen part del Disseny del Servei, ja que aquests pertanyen només a Operació.",
    "answerOptions": [
      {
        "text": "Cert",
        "isCorrect": false,
        "rationale": "Error molt freqüent: els processos es dissenyen aquí."
      },
      {
        "text": "Fals",
        "isCorrect": true,
        "rationale": "Un servei no pot operar-se si els processos no han estat dissenyats abans."
      }
    ]
  },
  {
    "guid": "1c4cef4c-3107-4cb4-b135-6a3331011018",
    "subjectId": "T21",
    "difficulty": 1,
    "origin": "OPOS24_gpt",
    "type": "truefalse",
    "question": "La Gestió de la Disponibilitat també contempla anàlisi de punts únics de fallada i redundància.",
    "answerOptions": [
      {
        "text": "Cert",
        "isCorrect": true,
        "rationale": "Això és essencial per millorar disponibilitat."
      },
      {
        "text": "Fals",
        "isCorrect": false,
        "rationale": "No és responsabilitat exclusiva de Continuïtat."
      }
    ]
  },
  {
    "guid": "bad36b4c-d024-47c1-a373-5ad931011019",
    "subjectId": "T21",
    "difficulty": 3,
    "origin": "OPOS24_gpt",
    "type": "truefalse",
    "question": "El Disseny del Servei pot incloure requisits per al model de monitoratge del servei.",
    "answerOptions": [
      {
        "text": "Cert",
        "isCorrect": true,
        "rationale": "Les mètriques i monitoratge formen part del Disseny."
      },
      {
        "text": "Fals",
        "isCorrect": false,
        "rationale": "No és una activitat exclusiva d’Operació."
      }
    ]
  },
  {
    "guid": "e1cfe52a-a9df-4710-9720-8bd431011020",
    "subjectId": "T21",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "truefalse",
    "question": "Un SLA mai pot ser més exigent que un OLA.",
    "answerOptions": [
      {
        "text": "Cert",
        "isCorrect": false,
        "rationale": "Un SLA pot definir objectius externs que obliguin a modificar múltiples OLA."
      },
      {
        "text": "Fals",
        "isCorrect": true,
        "rationale": "És una trampa: l’SLA pot ser més estricte i requerir revisió d’OLA i UC."
      }
    ]
  },
  {
    "guid": "d83a578c-6426-4bdc-9ed1-e109f001fg01",
    "subjectId": "T21",
    "difficulty": 1,
    "origin": "OPOS24_gpt",
    "type": "fillgap",
    "question": "El document que recull TOT el disseny d’un servei TI i que després consumeix la Transició és el _____________.",
    "answerOptions": [
      {
        "text": "Service Design Package",
        "isCorrect": true,
        "rationale": "El SDP és l’output formal del Disseny del Servei."
      },
      {
        "text": "Service Knowledge Base",
        "isCorrect": false,
        "rationale": "La SKMS és un repositori d’informació, no un paquet de disseny."
      }
    ],
    "hint": "És l’output principal del Disseny."
  },
  {
    "guid": "35f83b31-358e-48cd-ae12-cba8f001fg02",
    "subjectId": "T21",
    "difficulty": 2,
    "origin": "OPOS24_gpt",
    "type": "fillgap",
    "question": "Els SLA són acords entre TI i negoci. En canvi, els __________ són acords interns dins de TI i els ____________ són acords amb proveïdors.",
    "answerOptions": [
      {
        "text": "OLA / Underpinning Contracts",
        "isCorrect": true,
        "rationale": "OLA = TI↔TI; UC = TI↔proveïdor."
      },
      {
        "text": "UC / OLA",
        "isCorrect": false,
        "rationale": "Ordre invertit."
      }
    ],
    "hint": "Recorda: OLA és intern, UC és extern."
  },
  {
    "guid": "bcfb55de-77a0-4a7d-9a99-f22e5001fg03",
    "subjectId": "T21",
    "difficulty": 3,
    "origin": "OPOS24_gpt",
    "type": "fillgap",
    "question": "Un servei només aporta valor quan la seva ____________ i la seva ____________ estan garantides.",
    "answerOptions": [
      {
        "text": "Utility / Warranty",
        "isCorrect": true,
        "rationale": "Utility = funcionalitat; Warranty = garanties."
      },
      {
        "text": "Disponibilitat / Accessibilitat",
        "isCorrect": false,
        "rationale": "Són només parts de la Warranty."
      }
    ],
    "hint": "La combinació clau d’ITIL."
  },
  {
    "guid": "af180de1-f3cc-44e5-a3b8-9aa9f001fg04",
    "subjectId": "T21",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "fillgap",
    "question": "Eliminar punts únics de fallada (SPOF) és una activitat crítica de la Gestió de la _____________.",
    "answerOptions": [
      {
        "text": "Disponibilitat",
        "isCorrect": true,
        "rationale": "Disponibilitat treballa per eliminar SPOFs."
      },
      {
        "text": "Continuïtat",
        "isCorrect": false,
        "rationale": "Error molt típic: continuïtat = desastres, no SPOFs."
      }
    ],
    "hint": "Funciona en condicions normals, no en desastres."
  },
  {
    "guid": "09045744-4d76-494a-8810-5071a001fg05",
    "subjectId": "T21",
    "difficulty": 1,
    "origin": "OPOS24_gpt",
    "type": "fillgap",
    "question": "Els requisits no funcionals com disponibilitat, capacitat i seguretat formen part de la __________ del servei.",
    "answerOptions": [
      {
        "text": "Warranty",
        "isCorrect": true,
        "rationale": "La Warranty defineix la qualitat del servei."
      },
      {
        "text": "Utility",
        "isCorrect": false,
        "rationale": "Utility és només funcionalitat."
      }
    ],
    "hint": "El contrari de la funcionalitat."
  },
  {
    "guid": "c0f04977-bb78-4efb-b63e-6069b001fg06",
    "subjectId": "T21",
    "difficulty": 2,
    "origin": "OPOS24_gpt",
    "type": "fillgap",
    "question": "La Gestió de la Capacitat inclou tres sub-processos: Capacitat de negoci, Capacitat de servei i ____________.",
    "answerOptions": [
      {
        "text": "Capacitat de components",
        "isCorrect": true,
        "rationale": "És la tercera capa segons ITIL."
      },
      {
        "text": "Capacitat d’operació",
        "isCorrect": false,
        "rationale": "No existeix aquest sub-procés."
      }
    ],
    "hint": "Pensa en CPU, RAM, disc…"
  },
  {
    "guid": "a54f073d-b214-4626-bee1-031de001fg07",
    "subjectId": "T21",
    "difficulty": 3,
    "origin": "OPOS24_gpt",
    "type": "fillgap",
    "question": "El Catàleg de Serveis forma part del Service ____________, però només inclou serveis ____________ i operatius.",
    "answerOptions": [
      {
        "text": "Portfolio / aprovats",
        "isCorrect": true,
        "rationale": "Catàleg = subconjunt públic i actiu del Portfolio."
      },
      {
        "text": "Knowledge System / actius i retirats",
        "isCorrect": false,
        "rationale": "Retirats no van al Catàleg."
      }
    ],
    "hint": "Catàleg = només serveis vius."
  },
  {
    "guid": "6918d97c-96e8-4697-b581-0ad68001fg08",
    "subjectId": "T21",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "fillgap",
    "question": "RTO i RPO són mesures essencials de la Gestió de la _____________ del servei TI.",
    "answerOptions": [
      {
        "text": "Continuïtat",
        "isCorrect": true,
        "rationale": "RTO/RPO = pilar central de Continuïtat."
      },
      {
        "text": "Disponibilitat",
        "isCorrect": false,
        "rationale": "Disponibilitat no gestiona recuperació en desastres."
      }
    ],
    "hint": "Quan hi ha desastre."
  },
  {
    "guid": "8fc02fdd-01c9-4d4b-8a29-e107f001fg09",
    "subjectId": "T21",
    "difficulty": 2,
    "origin": "OPOS24_gpt",
    "type": "fillgap",
    "question": "En el Disseny del Servei, el disseny de processos, arquitectures, solucions i mètriques conformen els anomenats ____________ del disseny.",
    "answerOptions": [
      {
        "text": "Cinc aspectes",
        "isCorrect": true,
        "rationale": "És el marc oficial d’ITIL."
      },
      {
        "text": "Quatre pilars",
        "isCorrect": false,
        "rationale": "Els 4P són altra cosa."
      }
    ],
    "hint": "Són 5, no 4."
  },
  {
    "guid": "201c2ccf-448c-4c3a-9d97-c07af001fg10",
    "subjectId": "T21",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "fillgap",
    "question": "Els quatre Ps del Disseny del Servei són: People, Processes, Products i ____________.",
    "answerOptions": [
      {
        "text": "Partners",
        "isCorrect": true,
        "rationale": "És l’últim P d’ITIL."
      },
      {
        "text": "Performance",
        "isCorrect": false,
        "rationale": "Performance no és un dels Ps."
      }
    ],
    "hint": "Proveïdors, tercers..."
  },

  {
    "guid": "c873c8b8-f37f-4d24-bc20-3f8f0001fg11",
    "subjectId": "T21",
    "difficulty": 3,
    "origin": "OPOS24_gpt",
    "type": "fillgap",
    "question": "La seguretat en el Disseny del Servei es basa en el model CIAA: Confidencialitat, Integritat, _____________ i Autenticitat.",
    "answerOptions": [
      {
        "text": "Disponibilitat",
        "isCorrect": true,
        "rationale": "CIAA és el model complet."
      },
      {
        "text": "Agilitat",
        "isCorrect": false,
        "rationale": "No té cap relació amb seguretat."
      }
    ],
    "hint": "És part de la Warranty."
  },
  {
    "guid": "7cd2b267-4a55-44ad-b1ca-a20c0001fg12",
    "subjectId": "T21",
    "difficulty": 2,
    "origin": "OPOS24_gpt",
    "type": "fillgap",
    "question": "Quan un nivell de servei intern és necessari per suportar un SLA, es documenta en un ____________.",
    "answerOptions": [
      {
        "text": "OLA",
        "isCorrect": true,
        "rationale": "Operational Level Agreement."
      },
      {
        "text": "UC",
        "isCorrect": false,
        "rationale": "UC és TI↔proveïdor extern."
      }
    ],
    "hint": "És intern."
  },
  {
    "guid": "546200bd-3a19-49ad-bf7b-2cbb0001fg13",
    "subjectId": "T21",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "fillgap",
    "question": "La Gestió de Proveïdors garanteix que els contractes externs suporten els SLA mitjançant els ____________.",
    "answerOptions": [
      {
        "text": "Underpinning Contracts",
        "isCorrect": true,
        "rationale": "Els UC suporten els SLA."
      },
      {
        "text": "Service Level Packages",
        "isCorrect": false,
        "rationale": "SLP no existeix en aquest context."
      }
    ],
    "hint": "És el document contractual formal."
  },
  {
    "guid": "02284470-b4c2-4ad3-8729-bf270001fg14",
    "subjectId": "T21",
    "difficulty": 1,
    "origin": "OPOS24_gpt",
    "type": "fillgap",
    "question": "L’anàlisi de punts únics de fallada és una activitat bàsica en la Gestió de la ____________.",
    "answerOptions": [
      {
        "text": "Disponibilitat",
        "isCorrect": true,
        "rationale": "Elimina SPOFs."
      },
      {
        "text": "Continuïtat",
        "isCorrect": false,
        "rationale": "Continuïtat treballa desastres, no SPOFs."
      }
    ],
    "hint": "Funciona en mode normal."
  },
  {
    "guid": "7da1e67c-311e-4aae-b83f-e1160001fg15",
    "subjectId": "T21",
    "difficulty": 3,
    "origin": "OPOS24_gpt",
    "type": "fillgap",
    "question": "El disseny de dades, la definició de repositoris i la integritat informacional formen part del disseny de ____________.",
    "answerOptions": [
      {
        "text": "Sistemes i informació",
        "isCorrect": true,
        "rationale": "Un dels 5 aspectes del Disseny."
      },
      {
        "text": "Productes",
        "isCorrect": false,
        "rationale": "Productes = hardware/software."
      }
    ],
    "hint": "És un dels 5 aspectes del disseny."
  },
  {
    "guid": "59dbcb75-520d-4d93-8d45-f3620001fg16",
    "subjectId": "T21",
    "difficulty": 2,
    "origin": "OPOS24_gpt",
    "type": "fillgap",
    "question": "Els requisits de seguretat com autenticació, traçabilitat i xifratge formen part del disseny de ____________.",
    "answerOptions": [
      {
        "text": "Seguretat de la Informació",
        "isCorrect": true,
        "rationale": "És l’àmbit de seguretat d’ITIL."
      },
      {
        "text": "Capacitat",
        "isCorrect": false,
        "rationale": "Capacitat gestiona recursos, no seguretat."
      }
    ],
    "hint": "ISO 27001…"
  },
  {
    "guid": "2bcdbe80-d3b7-4c4d-83e9-dae40001fg17",
    "subjectId": "T21",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "fillgap",
    "question": "La definició de KPIs, llindars i mètodes de mesura forma part del disseny de ____________.",
    "answerOptions": [
      {
        "text": "Mètriques i mesures",
        "isCorrect": true,
        "rationale": "Últim dels 5 aspectes del disseny."
      },
      {
        "text": "Continuïtat",
        "isCorrect": false,
        "rationale": "Continuïtat no defineix mètriques."
      }
    ],
    "hint": "Mesura = qualitat."
  },
  {
    "guid": "87332af6-7803-487f-8d28-bdb00001fg18",
    "subjectId": "T21",
    "difficulty": 3,
    "origin": "OPOS24_gpt",
    "type": "fillgap",
    "question": "El Service Design Package inclou arquitectura, requisits i ____________ relacionats amb proves, desplegament i operació.",
    "answerOptions": [
      {
        "text": "Requisits de transició",
        "isCorrect": true,
        "rationale": "El SDP defineix què necessita Transició."
      },
      {
        "text": "Resultats d’Operació",
        "isCorrect": false,
        "rationale": "Els resultats provenen d’Operació."
      }
    ],
    "hint": "És tot el que necessita Transició."
  },
  {
    "guid": "abf782da-6e10-48f5-a03c-59f80001fg19",
    "subjectId": "T21",
    "difficulty": 1,
    "origin": "OPOS24_gpt",
    "type": "fillgap",
    "question": "El disseny d’arquitectures tecnològiques inclou decisions sobre xarxes, CPD, servidors i ____________.",
    "answerOptions": [
      {
        "text": "Plataformes de desplegament",
        "isCorrect": true,
        "rationale": "Infraestructura tecnològica."
      },
      {
        "text": "SLA",
        "isCorrect": false,
        "rationale": "Els SLA no són infraestructura."
      }
    ],
    "hint": "Allò on es desplega el servei."
  },
  {
    "guid": "bb55bd6d-41be-4229-a5c4-48a60001fg20",
    "subjectId": "T21",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "fillgap",
    "question": "En el Disseny del Servei, els processos s’han de definir abans que Operació els implementi. Això significa que el disseny és sempre ____________ a l’execució.",
    "answerOptions": [
      {
        "text": "Previ",
        "isCorrect": true,
        "rationale": "El Disseny precedeix Operació."
      },
      {
        "text": "Posterior",
        "isCorrect": false,
        "rationale": "Aquesta és la confusió típica."
      }
    ],
    "hint": "Vénen abans d’Operació."
  }
]
