[
    {
        "guid": "e55ba34b-952f-4bc3-b2db-70e26ef28cc5",
        "subjectId": "T26",
        "origin": "notebooklm",
        "type": "test",
        "difficulty": 3,
        "question": "¿Qué rol dentro de un SAU es el principal responsable de definir la estrategia del servicio, supervisar los KPIs y asegurar la calidad global?",
        "answerOptions": [
            {
                "text": "Coordinador/a de SAU",
                "isCorrect": false,
                "rationale": "Este rol se centra en la gestión del flujo de trabajo diario y la asignación de tareas, no en la estrategia global."
            },
            {
                "text": "Responsable del SAU",
                "isCorrect": true,
                "rationale": "Este rol se enfoca en la visión estratégica, la mejora continua y la calidad del servicio en su conjunto, supervisando el rendimiento general."
            },
            {
                "text": "Operador/a de SAU",
                "isCorrect": false,
                "rationale": "El operador es el primer punto de contacto y se encarga de la resolución de incidencias básicas y el registro de tickets."
            },
            {
                "text": "Tècnic especialitzat",
                "isCorrect": false,
                "rationale": "El técnico especialista resuelve problemas técnicos complejos que han sido escalados, pero no define la estrategia del servicio."
            }
        ],
        "hint": "Piensa en quién tiene la visión más global y a largo plazo del servicio, más allá de la gestión operativa diaria."
    },
    {
        "guid": "bdef5231-0206-42e3-8022-13ec166caf72",
        "subjectId": "T26",
        "origin": "notebooklm",
        "type": "test",
        "difficulty": 3,
        "question": "En la estructura de soporte de un SAU, ¿qué nivel se caracteriza por la resolución de incidencias por parte del propio usuario, sin intervención directa del personal técnico?",
        "answerOptions": [
            {
                "text": "Nivell 1",
                "isCorrect": false,
                "rationale": "El Nivel 1 es el primer punto de contacto humano, donde los operadores registran y resuelven incidencias comunes."
            },
            {
                "text": "Nivell 2",
                "isCorrect": false,
                "rationale": "El Nivel 2 implica a técnicos con conocimientos especializados para problemas que el primer nivel no puede resolver."
            },
            {
                "text": "Nivell 0",
                "isCorrect": true,
                "rationale": "Este nivel corresponde a las herramientas de autoservicio como portales de FAQ, chatbots o bases de conocimiento que el usuario utiliza por su cuenta."
            },
            {
                "text": "Nivell 3",
                "isCorrect": false,
                "rationale": "El Nivel 3 está reservado para expertos, desarrolladores o proveedores externos que abordan problemas de alta complejidad."
            }
        ],
        "hint": "Considera el nivel que promueve la autonomía del usuario a través de portales y bases de conocimiento."
    },
    {
        "guid": "dfbbddd3-0fb6-4f05-b280-b6f866a9d254",
        "subjectId": "T26",
        "origin": "notebooklm",
        "type": "test",
        "difficulty": 3,
        "question": "¿Cuál es la diferencia fundamental entre la \"Gestió d'incidències\" y la \"Gestió de peticions de servei\" en un SAU?",
        "answerOptions": [
            {
                "text": "La gestión de incidencias busca restaurar un servicio interrumpido, mientras que la gestión de peticiones atiende solicitudes rutinarias predefinidas.",
                "isCorrect": true,
                "rationale": "Una incidencia es una interrupción no planificada del servicio (algo se ha roto), mientras que una petición es una solicitud estándar de algo nuevo o un cambio (alta de usuario, instalación de software)."
            },
            {
                "text": "La gestión de incidencias siempre es reactiva, mientras que la de peticiones es proactiva.",
                "isCorrect": false,
                "rationale": "Ambas gestiones son principalmente reactivas, ya que responden a un contacto del usuario. El soporte proactivo es una función distinta que busca anticiparse a los problemas."
            },
            {
                "text": "La gestión de peticiones siempre requiere escalado a Nivel 2, mientras que la de incidencias se resuelve en Nivel 1.",
                "isCorrect": false,
                "rationale": "No hay una regla fija sobre el escalado; tanto incidencias sencillas como peticiones estándar pueden resolverse en Nivel 1, y ambas pueden requerir escalado si son complejas."
            },
            {
                "text": "La gestión de incidencias se mide con el KPI de FCR y la de peticiones con el cumplimiento de SLA.",
                "isCorrect": false,
                "rationale": "Ambos procesos se miden con SLAs. El FCR (First Call Resolution) puede aplicarse a ambos si se resuelven en el primer contacto."
            }
        ],
        "hint": "Piensa en si algo ha dejado de funcionar o si se está pidiendo algo nuevo o un cambio estándar."
    },
    {
        "guid": "e4b624bb-c9a2-4c35-b887-08f7c6b4e30d",
        "subjectId": "T26",
        "origin": "notebooklm",
        "type": "test",
        "difficulty": 3,
        "question": "¿Qué indicador clave de rendimiento (KPI) mide el porcentaje de incidencias que se solucionan en el primer contacto con el SAU, sin necesidad de ser escaladas?",
        "answerOptions": [
            {
                "text": "Temps mitjà de resolució (MTTR)",
                "isCorrect": false,
                "rationale": "El MTTR mide el tiempo total desde que se abre una incidencia hasta que se cierra, independientemente de cuántos contactos o escalados haya habido."
            },
            {
                "text": "First Call Resolution (FCR)",
                "isCorrect": true,
                "rationale": "El FCR se centra específicamente en la eficiencia del primer nivel de soporte para resolver casos sin transferirlos ni requerir un segundo contacto."
            },
            {
                "text": "Compliment d’SLA",
                "isCorrect": false,
                "rationale": "El cumplimiento de SLA mide si los tiempos de respuesta y resolución se ajustan a lo acordado, no si se resolvió en la primera interacción."
            },
            {
                "text": "Satisfacció de l’usuari (CSAT)",
                "isCorrect": false,
                "rationale": "El CSAT mide la percepción del usuario sobre la calidad del servicio recibido, pero no la eficiencia operativa interna del proceso de resolución."
            }
        ],
        "hint": "El nombre de este indicador en inglés describe exactamente su propósito: resolución en la primera llamada."
    },
    {
        "guid": "637d8a96-fd3f-432b-9dfd-d89fde44d0c2",
        "subjectId": "T26",
        "origin": "notebooklm",
        "type": "test",
        "difficulty": 3,
        "question": "Dentro de las herramientas de un SAU, ¿cuál es el propósito principal de sistemas como Nagios, Zabbix o Prometheus?",
        "answerOptions": [
            {
                "text": "Gestionar el ciclo de vida de los tickets de incidencias y peticiones.",
                "isCorrect": false,
                "rationale": "La gestión de tickets se realiza con plataformas específicas de ticketing como ServiceNow, JIRA o GLPI, no con herramientas de monitorización."
            },
            {
                "text": "Crear y mantener una base de conocimiento con soluciones a problemas comunes.",
                "isCorrect": false,
                "rationale": "Las bases de conocimiento se gestionan con herramientas tipo Wiki, Confluence o módulos integrados en las plataformas de ticketing."
            },
            {
                "text": "Monitorizar sistemas y redes para detectar fallos de forma proactiva y generar alertas.",
                "isCorrect": true,
                "rationale": "Estas son herramientas de monitorización diseñadas para supervisar el estado de la infraestructura y alertar automáticamente, a menudo antes de que los usuarios noten el problema."
            },
            {
                "text": "Medir y visualizar el cumplimiento de los SLA a través de cuadros de mando.",
                "isCorrect": false,
                "rationale": "Aunque los datos de monitorización pueden alimentar cuadros de mando (con herramientas como Grafana), su función principal es la supervisión y alerta, no la gestión y reporte de SLAs."
            }
        ],
        "hint": "Estas herramientas actúan como los \"ojos y oídos\" del equipo de TI sobre la infraestructura tecnológica."
    },
    {
        "guid": "bc2365da-91af-45f3-97b7-be440ffb2438",
        "subjectId": "T26",
        "origin": "notebooklm",
        "type": "test",
        "difficulty": 3,
        "question": "Una organización con sedes en diferentes países decide implementar un SAU que estandariza los procesos y herramientas a nivel global, pero mantiene equipos locales para dar soporte de proximidad. ¿Qué modelo organizativo de SAU está aplicando?",
        "answerOptions": [
            {
                "text": "Centralitzat",
                "isCorrect": false,
                "rationale": "Un modelo puramente centralizado tendría un único equipo global que atiende a todas las regiones, sin equipos de soporte de proximidad locales."
            },
            {
                "text": "Descentralitzat",
                "isCorrect": false,
                "rationale": "Un modelo descentralizado implicaría que cada sede tuviera su propio SAU independiente, con sus propios procesos y herramientas, generando duplicidad."
            },
            {
                "text": "Basat en nivells",
                "isCorrect": false,
                "rationale": "La estructura basada en niveles (0, 1, 2, 3) describe el flujo de escalado de una incidencia, no el modelo de organización geográfica o departamental del SAU."
            },
            {
                "text": "Híbrid o federat",
                "isCorrect": true,
                "rationale": "El modelo híbrido o federado combina un control central (procesos, herramientas) con una ejecución descentralizada (equipos locales) para obtener lo mejor de ambos mundos."
            }
        ],
        "hint": "Este modelo busca combinar las ventajas de la estandarización con la cercanía al usuario."
    },
    {
        "guid": "a493f0e5-26c1-46dd-ac2e-8de0a405b466",
        "subjectId": "T26",
        "origin": "notebooklm",
        "type": "test",
        "difficulty": 3,
        "question": "Cuando el SAU identifica que múltiples usuarios reportan el mismo problema de lentitud en una aplicación y decide escalarlo para que se investigue la causa raíz, ¿con qué otro proceso de ITIL está colaborando principalmente?",
        "answerOptions": [
            {
                "text": "Gestió de Problemes",
                "isCorrect": true,
                "rationale": "La Gestión de Problemas se encarga de analizar la causa raíz de incidencias recurrentes para encontrar una solución permanente y evitar que vuelvan a ocurrir."
            },
            {
                "text": "Gestió de Canvis",
                "isCorrect": false,
                "rationale": "La Gestión de Canvis se activaría posteriormente para controlar la implementación de la solución que encuentre la Gestión de Problemas, pero no investiga la causa."
            },
            {
                "text": "Gestió de la Configuració (CMDB)",
                "isCorrect": false,
                "rationale": "La CMDB sería una fuente de información para entender qué activos están involucrados, pero no es el proceso que investiga la causa raíz del fallo."
            },
            {
                "text": "Gestió de la Disponibilitat",
                "isCorrect": false,
                "rationale": "La Gestión de la Disponibilidad se preocupa de que los servicios cumplan los niveles acordados, pero la investigación de la causa de fallos recurrentes es específica de la Gestión de Problemas."
            }
        ],
        "hint": "El objetivo ya no es solo restaurar el servicio para cada usuario (incidencia), sino encontrar el \"porqué\" del fallo recurrente para eliminarlo."
    },
    {
        "guid": "86ceaa93-2bf2-49dc-ac9e-dbe857641211",
        "subjectId": "T26",
        "origin": "notebooklm",
        "type": "test",
        "difficulty": 3,
        "question": "Un usuario reporta un error complejo en el módulo financiero de SAP. El técnico de Nivel 1 lo documenta y lo escala a un equipo interno con conocimientos funcionales profundos en dicho módulo. ¿A qué nivel de soporte se ha escalado la incidencia?",
        "answerOptions": [
            {
                "text": "Nivell 1",
                "isCorrect": false,
                "rationale": "El Nivel 1 es el primer filtro y, en este caso, es quien realiza el escalado porque el problema supera sus conocimientos."
            },
            {
                "text": "Nivell 2",
                "isCorrect": true,
                "rationale": "El Nivel 2 está compuesto por técnicos o equipos funcionales con conocimientos especializados en sistemas o aplicaciones de negocio concretas, como SAP."
            },
            {
                "text": "Nivell 3",
                "isCorrect": false,
                "rationale": "El Nivel 3 se reservaría para un escalado posterior si el equipo interno no puede resolverlo, implicando a desarrolladores o al soporte del propio fabricante (SAP)."
            },
            {
                "text": "Nivell 0",
                "isCorrect": false,
                "rationale": "El Nivel 0 es para autoservicio, lo cual no aplica a un error complejo que requiere diagnóstico técnico por parte de personal especializado."
            }
        ],
        "hint": "Se trata de un problema que requiere conocimiento avanzado, pero que aún es manejado por personal experto interno de la organización."
    },
    {
        "guid": "28d8bf28-a27e-4817-9e5a-a9fadd800d3d",
        "subjectId": "T26",
        "origin": "notebooklm",
        "type": "test",
        "difficulty": 3,
        "question": "¿A qué tendencia actual en los SAU se refiere el concepto de \"Omnicanalitat\"?",
        "answerOptions": [
            {
                "text": "Utilizar la inteligencia artificial para predecir y resolver problemas antes de que el usuario los reporte.",
                "isCorrect": false,
                "rationale": "Esto describe la proactividad, otra tendencia importante pero distinta, basada en la predicción y automatización."
            },
            {
                "text": "Integrar todos los canales de comunicación (teléfono, correo, chat, portal) para ofrecer una experiencia de usuario unificada.",
                "isCorrect": true,
                "rationale": "La omnicanalidad busca que el usuario pueda iniciar una consulta por un canal y continuarla por otro sin perder el contexto, unificando la experiencia."
            },
            {
                "text": "Fomentar el uso de portales de autoservicio y chatbots para reducir la carga del Nivel 1.",
                "isCorrect": false,
                "rationale": "Esto se refiere a la tendencia del autoservicio y la automatización, que son componentes de una estrategia omnicanal, pero no el concepto en sí."
            },
            {
                "text": "Documentar todas las soluciones en una base de conocimiento colaborativa.",
                "isCorrect": false,
                "rationale": "Esto corresponde a la Gestión del Conocimiento, una función clave del SAU, pero no define la omnicanalidad."
            }
        ],
        "hint": "La palabra clave es \"omni\", que significa \"todo\". La tendencia se enfoca en la experiencia del usuario a través de todos los medios de contacto."
    },
    {
        "guid": "d998f25a-741d-4198-bf6a-2a3a7af886ee",
        "subjectId": "T26",
        "origin": "notebooklm",
        "type": "test",
        "difficulty": 3,
        "question": "Si el coste total de un SAU es de 120.000 € anuales y gestiona 2.000 tickets al mes, ¿cuál es el \"Cost per ticket\"?",
        "answerOptions": [
            {
                "text": "60 €/ticket",
                "isCorrect": false,
                "rationale": "Este resultado se obtiene al dividir el coste anual por el número de tickets mensuales, sin anualizar el volumen de tickets."
            },
            {
                "text": "10 €/ticket",
                "isCorrect": false,
                "rationale": "Este cálculo podría surgir de una división incorrecta de los valores, sin tener en cuenta el total de tickets anuales."
            },
            {
                "text": "5 €/ticket",
                "isCorrect": true,
                "rationale": "El cálculo correcto es dividir el coste anual entre el total de tickets anuales (2.000 tickets/mes * 12 meses = 24.000 tickets), resultando en 120.000 € / 24.000 tickets."
            },
            {
                "text": "No es posible calcularlo con estos datos.",
                "isCorrect": false,
                "rationale": "Los datos proporcionados (coste total y volumen de tickets) son precisamente los necesarios para calcular este indicador de eficiencia económica."
            }
        ],
        "hint": "Primero, calcula el número total de tickets que se gestionan en un año para poder relacionarlo con el coste anual."
    },
    {
        "guid": "ba5d3d0f-8752-4c68-8c1a-6db0dd46f1b2",
        "subjectId": "T25",
        "origin": "notebooklm",
        "type": "test",
        "difficulty": 2,
        "question": "Según el material, ¿cuál es el objetivo principal del Servei d’Atenció a l’Usuari (SAU)?",
        "answerOptions": [
            {
                "text": "Desarrollar nuevo software y aplicaciones para la organización.",
                "isCorrect": false,
                "rationale": "El desarrollo de software corresponde a equipos de desarrollo (Nivel 3 o equipos específicos), no es la función principal del punto de contacto con el usuario."
            },
            {
                "text": "Gestionar exclusivamente la infraestructura de hardware y servidores de la empresa.",
                "isCorrect": false,
                "rationale": "Aunque el SAU interactúa con la infraestructura, su función principal es el soporte al usuario, no la gestión de la infraestructura en sí, que corresponde a otros equipos de operaciones."
            },
            {
                "text": "Dar soporte, resolver incidencias y peticiones, y garantizar la continuidad y calidad de los servicios TIC.",
                "isCorrect": true,
                "rationale": "Esta opción resume la misión del SAU como punto único de contacto (SPOC) para asegurar que los usuarios puedan utilizar los servicios TIC de manera efectiva."
            },
            {
                "text": "Definir los Acuerdos de Nivel de Servicio (SLA) con los proveedores externos.",
                "isCorrect": false,
                "rationale": "El SAU opera bajo los SLAs definidos y ayuda a medirlos, pero la definición estratégica de estos acuerdos suele recaer en la gestión de servicios o en niveles directivos."
            }
        ],
        "hint": "Considera el rol del SAU como el principal punto de contacto entre los usuarios y el departamento de TI."
    },
    {
        "guid": "97fb1988-5ce5-4eac-a857-d64c91b3934d",
        "subjectId": "T25",
        "origin": "notebooklm",
        "type": "test",
        "difficulty": 2,
        "question": "Un usuario reporta que no puede acceder a una aplicación financiera crítica. El operador de Nivel 1 no logra solucionarlo tras verificar las credenciales y la conexión básica. ¿Cuál es el siguiente paso lógico en la gestión de esta incidencia?",
        "answerOptions": [
            {
                "text": "Cerrar el ticket y pedir al usuario que lo intente más tarde.",
                "isCorrect": false,
                "rationale": "Cerrar un ticket sin resolverlo incumple el objetivo fundamental del SAU y afectaría negativamente la satisfacción del usuario y la continuidad del negocio."
            },
            {
                "text": "Escalar la incidencia al Nivel 2, al equipo de soporte funcional de la aplicación.",
                "isCorrect": true,
                "rationale": "Cuando el primer nivel agota sus conocimientos, el procedimiento correcto es escalar a un nivel con conocimientos más especializados sobre el sistema o aplicación afectada."
            },
            {
                "text": "Contactar directamente con el proveedor del software (Nivel 3).",
                "isCorrect": false,
                "rationale": "El escalado debe seguir una estructura. Saltar directamente al Nivel 3 es ineficiente, ya que el Nivel 2 tiene la experiencia para resolver problemas técnicos y funcionales intermedios."
            },
            {
                "text": "Documentar el caso en la base de conocimiento como un problema sin solución.",
                "isCorrect": false,
                "rationale": "La gestión del conocimiento se usa para documentar soluciones, no para registrar fallos sin haber agotado todas las vías de resolución internas."
            }
        ],
        "hint": "Piensa en la estructura jerárquica de soporte diseñada para optimizar la resolución de problemas."
    },
    {
        "guid": "923fceaa-02f2-489d-8ebd-d73bfe1332bc",
        "subjectId": "T25",
        "origin": "notebooklm",
        "type": "test",
        "difficulty": 2,
        "question": "¿Qué rol dentro del SAU es responsable de la visión estratégica, la calidad del servicio y la propuesta de mejoras como la implementación de un chatbot?",
        "answerOptions": [
            {
                "text": "Operador/a de SAU",
                "isCorrect": false,
                "rationale": "El operador es el primer punto de contacto y se enfoca en la resolución de tickets del día a día, no en la estrategia global del servicio."
            },
            {
                "text": "Coordinador/a de SAU",
                "isCorrect": false,
                "rationale": "El coordinador gestiona el flujo de trabajo diario y las asignaciones, asegurando el cumplimiento de los SLA, pero la definición de la estrategia es una responsabilidad de nivel superior."
            },
            {
                "text": "Responsable del SAU",
                "isCorrect": true,
                "rationale": "Este rol se encarga de la supervisión general, la mejora continua y las decisiones estratégicas que afectan al servicio, como la adopción de nuevas tecnologías."
            },
            {
                "text": "Tècnic especialista (Nivell 2/3)",
                "isCorrect": false,
                "rationale": "El técnico especialista se enfoca en resolver incidencias complejas que requieren un conocimiento profundo, no en la gestión estratégica del departamento."
            }
        ],
        "hint": "Identifica el rol que se ocupa de la gestión a largo plazo y la mejora continua del servicio, más allá de la operativa diaria."
    },
    {
        "guid": "53b1dedc-b984-4f56-bb8c-4ce95f28bc42",
        "subjectId": "T25",
        "origin": "notebooklm",
        "type": "test",
        "difficulty": 2,
        "question": "Dentro de las funciones del SAU, ¿cuál es la principal diferencia entre la 'Gestión de incidencias' y la 'Gestión de peticiones de servicio'?",
        "answerOptions": [
            {
                "text": "La gestión de incidencias es proactiva y la gestión de peticiones es reactiva.",
                "isCorrect": false,
                "rationale": "Ambas gestiones son fundamentalmente reactivas, ya que responden a un contacto del usuario. El soporte proactivo es una función distinta que busca anticipar problemas."
            },
            {
                "text": "Las incidencias se refieren a interrupciones del servicio, mientras que las peticiones son solicitudes rutinarias que no implican una falla.",
                "isCorrect": true,
                "rationale": "Esta es la distinción clave según ITIL. Una incidencia busca restaurar un servicio que ha fallado, y una petición busca proveer algo nuevo o estándar."
            },
            {
                "text": "Las incidencias siempre se escalan al Nivel 2, mientras que las peticiones se resuelven en Nivel 1.",
                "isCorrect": false,
                "rationale": "No todas las incidencias se escalan, muchas se resuelven en Nivel 1. De igual forma, algunas peticiones complejas pueden requerir intervención del Nivel 2."
            },
            {
                "text": "La gestión de peticiones utiliza herramientas de ticketing y la de incidencias no.",
                "isCorrect": false,
                "rationale": "Ambos procesos se registran, gestionan y monitorizan utilizando las mismas plataformas de ticketing para asegurar la trazabilidad y el cumplimiento de SLAs."
            }
        ],
        "hint": "¿Se está reportando algo que está roto o se está pidiendo algo nuevo?"
    },
    {
        "guid": "8b93c878-8b43-4f6c-baa8-2022ffbe6a7f",
        "subjectId": "T25",
        "origin": "notebooklm",
        "type": "test",
        "difficulty": 2,
        "question": "¿Cuál de las siguientes herramientas se utiliza principalmente para la detección proactiva de fallos en sistemas y redes, generando alertas antes de que los usuarios las reporten?",
        "answerOptions": [
            {
                "text": "JIRA Service Desk",
                "isCorrect": false,
                "rationale": "JIRA Service Desk es una plataforma de ticketing para gestionar incidencias y peticiones una vez que han sido reportadas, no para monitorizar sistemas en tiempo real."
            },
            {
                "text": "Confluence",
                "isCorrect": false,
                "rationale": "Confluence es una herramienta de gestión del conocimiento (una wiki colaborativa), utilizada para documentar soluciones, no para la monitorización de infraestructura."
            },
            {
                "text": "Power BI",
                "isCorrect": false,
                "rationale": "Power BI es una herramienta de visualización de datos y cuadros de mando que se usa para analizar KPIs, no para la monitorización activa de sistemas."
            },
            {
                "text": "Zabbix",
                "isCorrect": true,
                "rationale": "Zabbix, al igual que Nagios y Prometheus, es un sistema de monitorización diseñado para supervisar la salud de la infraestructura TI y generar alertas automáticas."
            }
        ],
        "hint": "Busca la herramienta cuya función principal es vigilar el estado de los servicios y la infraestructura de TI."
    },
    {
        "guid": "1bc3c68b-e5d0-4859-bcf8-38499f19b6b8",
        "subjectId": "T25",
        "origin": "notebooklm",
        "type": "test",
        "difficulty": 2,
        "question": "El indicador 'First Call Resolution' (FCR) mide la eficiencia del SAU. ¿Qué representa exactamente un FCR del 80%?",
        "answerOptions": [
            {
                "text": "Que el 80% de las incidencias se resuelven dentro del tiempo pactado en el SLA.",
                "isCorrect": false,
                "rationale": "Esto describe el cumplimiento de SLA, que es un indicador de calidad relacionado con el tiempo, pero no la eficiencia en el primer contacto."
            },
            {
                "text": "Que el tiempo medio para resolver una incidencia es un 80% más rápido que el mes anterior.",
                "isCorrect": false,
                "rationale": "Esto se relaciona con el Mean Time To Resolution (MTTR) y la mejora de procesos, pero no define el FCR."
            },
            {
                "text": "Que el 80% de las incidencias recibidas se solucionan en la primera interacción con el usuario, sin necesidad de escalar.",
                "isCorrect": true,
                "rationale": "Esta es la definición precisa de FCR, un indicador clave que mide la capacidad del Nivel 1 para resolver problemas de forma autónoma y eficiente."
            },
            {
                "text": "Que el 80% de los usuarios califican el servicio con la máxima puntuación en las encuestas de satisfacción.",
                "isCorrect": false,
                "rationale": "Esto corresponde al indicador de Satisfacción del Usuario (CSAT), que mide la percepción del usuario sobre la calidad del servicio recibido."
            }
        ],
        "hint": "El nombre del indicador contiene la clave: 'First Call' se refiere al primer contacto."
    },
    {
        "guid": "c2d4d863-c9af-48b3-b27b-9f82cea9d991",
        "subjectId": "T25",
        "origin": "notebooklm",
        "type": "test",
        "difficulty": 2,
        "question": "Una organización tiene múltiples sedes distribuidas geográficamente y cada una tiene necesidades muy específicas. Sin embargo, la dirección quiere mantener una política de TI unificada y controlar los costes. ¿Qué modelo organizativo de SAU sería el más adecuado?",
        "answerOptions": [
            {
                "text": "Un modelo completamente centralizado.",
                "isCorrect": false,
                "rationale": "Un modelo centralizado ofrece un control unificado, pero podría tener dificultades para atender las necesidades específicas y la proximidad que requieren las sedes distribuidas."
            },
            {
                "text": "Un modelo completamente descentralizado.",
                "isCorrect": false,
                "rationale": "Este modelo ofrece proximidad al usuario pero genera duplicidad de esfuerzos, falta de uniformidad en los procesos y mayores costes, lo cual contradice los objetivos de la dirección."
            },
            {
                "text": "Un modelo híbrido o federado.",
                "isCorrect": true,
                "rationale": "Este modelo combina las ventajas de ambos: centraliza procesos y herramientas para mantener la uniformidad y el control de costes, mientras que descentraliza el soporte de proximidad para atender las necesidades locales."
            },
            {
                "text": "Un modelo basado únicamente en autoservicio (Nivel 0).",
                "isCorrect": false,
                "rationale": "El autoservicio es un complemento importante, pero no puede reemplazar por completo la necesidad de soporte técnico especializado para resolver problemas más complejos en un entorno distribuido."
            }
        ],
        "hint": "Busca el modelo que combine lo mejor de dos mundos: control central y atención local."
    },
    {
        "guid": "18da104b-13b9-49da-9e36-00b7c12eb49e",
        "subjectId": "T25",
        "origin": "notebooklm",
        "type": "test",
        "difficulty": 2,
        "question": "Un usuario utiliza el portal de autoservicio para restablecer su contraseña olvidada sin hablar con ningún técnico. ¿A qué nivel de soporte corresponde esta acción?",
        "answerOptions": [
            {
                "text": "Nivel 0",
                "isCorrect": true,
                "rationale": "Este nivel se define como el soporte donde el usuario resuelve sus propias incidencias utilizando herramientas como portales, FAQs o chatbots, sin intervención directa del personal técnico."
            },
            {
                "text": "Nivel 1",
                "isCorrect": false,
                "rationale": "El Nivel 1 es el primer punto de contacto humano. Si el usuario hubiera llamado o enviado un correo para el restablecimiento, sería Nivel 1."
            },
            {
                "text": "Nivel 2",
                "isCorrect": false,
                "rationale": "El Nivel 2 implica conocimientos técnicos especializados y se utiliza para incidencias que el Nivel 1 no puede resolver, como problemas complejos de configuración o diagnóstico."
            },
            {
                "text": "Nivel 3",
                "isCorrect": false,
                "rationale": "El Nivel 3 corresponde a expertos o proveedores externos y se reserva para los problemas más complejos, como errores en el código de una aplicación o fallos de hardware especializado."
            }
        ],
        "hint": "Considera qué nivel de soporte no requiere la intervención directa de personal de TI."
    },
    {
        "guid": "2a3d2d30-5a12-4daf-b69b-fd60943a216e",
        "subjectId": "T25",
        "origin": "notebooklm",
        "type": "test",
        "difficulty": 2,
        "question": "El SAU detecta un aumento del 50% en las incidencias relacionadas con la lentitud de la aplicación de contabilidad durante la última semana del mes. El coordinador del SAU decide abrir un ticket para investigar la causa raíz de este comportamiento recurrente. ¿Con qué otro proceso de ITIL se está integrando el SAU en este caso?",
        "answerOptions": [
            {
                "text": "Gestión de Cambios",
                "isCorrect": false,
                "rationale": "La Gestión de Cambios se ocupa de gestionar las modificaciones en la infraestructura de TI de forma controlada, no de investigar la causa de incidencias existentes."
            },
            {
                "text": "Gestión de la Configuración (CMDB)",
                "isCorrect": false,
                "rationale": "La CMDB es un repositorio de los elementos de configuración y sus relaciones. Aunque puede ser consultada durante la investigación, el proceso de investigar la causa raíz es otro."
            },
            {
                "text": "Gestión de Problemas",
                "isCorrect": true,
                "rationale": "La Gestión de Problemas tiene como objetivo identificar, analizar y eliminar la causa raíz de las incidencias recurrentes para prevenir que vuelvan a ocurrir."
            },
            {
                "text": "Gestión de la Disponibilidad",
                "isCorrect": false,
                "rationale": "La Gestión de la Disponibilidad se enfoca en asegurar que los servicios cumplan con los niveles de disponibilidad acordados, pero la investigación de la causa de fallos recurrentes es tarea de la Gestión de Problemas."
            }
        ],
        "hint": "Piensa en el proceso de ITIL que se activa para encontrar la causa fundamental detrás de un conjunto de incidencias similares."
    },
    {
        "guid": "536ed0f4-4e6f-49c1-878f-0105b6a149f9",
        "subjectId": "T25",
        "origin": "notebooklm",
        "type": "test",
        "difficulty": 2,
        "question": "¿Qué tendencia actual en los SAU busca integrar canales como teléfono, correo, portal y chat en una experiencia de usuario unificada y coherente?",
        "answerOptions": [
            {
                "text": "Automatización con RPA",
                "isCorrect": false,
                "rationale": "RPA se enfoca en automatizar tareas repetitivas, lo cual puede aplicarse a varios canales, pero no se refiere al concepto de integrar la experiencia del usuario a través de ellos."
            },
            {
                "text": "Omnicanalidad",
                "isCorrect": true,
                "rationale": "Este término describe precisamente la estrategia de unificar los diferentes canales de comunicación para ofrecer una experiencia fluida y consistente al usuario, independientemente del canal que elija."
            },
            {
                "text": "Soporte proactivo",
                "isCorrect": false,
                "rationale": "El soporte proactivo consiste en anticipar y resolver problemas antes de que el usuario los reporte, lo cual es una tendencia, pero no describe la integración de canales de comunicación."
            },
            {
                "text": "Gestión del conocimiento colaborativa",
                "isCorrect": false,
                "rationale": "Esta tendencia se refiere a la creación y mantenimiento compartido de la base de conocimiento, pero no a la integración de los puntos de contacto con el usuario."
            }
        ],
        "hint": "Esta tendencia se centra en que el usuario pueda empezar una conversación en un canal y continuarla en otro sin perder el contexto."
    },
    {
        "guid": "ff65dcf2-af6a-4845-b4c1-2e1a27257c99",
        "subjectId": "T25",
        "origin": "notebooklm",
        "type": "test",
        "difficulty": 2,
        "question": "¿Cuál es la fórmula para calcular el 'Cost per ticket', un KPI utilizado para el control presupuestario del SAU?",
        "answerOptions": [
            {
                "text": "$\frac{\text{cost total del SAU}}{\text{número de tickets}}$",
                "isCorrect": true,
                "rationale": "Esta fórmula divide el coste total del servicio (salarios, herramientas, etc.) entre el número total de tickets gestionados para obtener el coste promedio de cada uno."
            },
            {
                "text": "$\frac{\text{número de tickets}}{\text{cost total del SAU}}$",
                "isCorrect": false,
                "rationale": "Esta fórmula es la inversa de la correcta y calcularía cuántos tickets se gestionan por unidad monetaria, no el coste de un solo ticket."
            },
            {
                "text": "$\text{cost total del SAU} \times \text{número de tickets}$",
                "isCorrect": false,
                "rationale": "Multiplicar estas dos cifras no produciría un indicador útil; daría un valor cuadrático del coste que no tiene una interpretación práctica en la gestión."
            },
            {
                "text": "$\frac{\text{cost total del SAU}}{\text{número de usuarios}}$",
                "isCorrect": false,
                "rationale": "Esta fórmula calcularía el coste del SAU por usuario, que es un indicador válido, pero no el 'Cost per ticket' que mide el coste por cada interacción gestionada."
            }
        ],
        "hint": "Piensa en cómo distribuirías el coste total del servicio entre cada una de las unidades de trabajo que gestiona."
    },
    {
        "guid": "c93fcf8d-4ee6-4f59-bced-cd338e51bf92",
        "subjectId": "T25",
        "origin": "notebooklm",
        "type": "test",
        "difficulty": 2,
        "question": "Un técnico especialista del Nivel 2 resuelve una incidencia compleja en la base de datos Oracle. Para evitar que el Nivel 1 escale incidencias similares en el futuro, el técnico crea una guía paso a paso con la solución y la publica en la intranet. ¿Qué función principal del SAU está desempeñando?",
        "answerOptions": [
            {
                "text": "Gestión de peticiones de servicio",
                "isCorrect": false,
                "rationale": "La gestión de peticiones se ocupa de atender solicitudes estándar de los usuarios, no de documentar soluciones a problemas técnicos complejos."
            },
            {
                "text": "Monitorización y informes",
                "isCorrect": false,
                "rationale": "Esta función se centra en medir KPIs y controlar la actividad del servicio, no en la creación de contenido para resolver problemas."
            },
            {
                "text": "Gestión del conocimiento",
                "isCorrect": true,
                "rationale": "Esta función consiste en documentar y compartir soluciones para reducir los tiempos de resolución futuros y potenciar el autoservicio y la eficiencia del Nivel 1."
            },
            {
                "text": "Comunicación con el usuario",
                "isCorrect": false,
                "rationale": "Aunque la guía es para el uso de otros técnicos (y potencialmente usuarios), la acción principal es la de documentar y preservar el conocimiento, no la de comunicar el estado de una incidencia activa."
            }
        ],
        "hint": "Considera la función que se enfoca en capitalizar las soluciones encontradas para reutilizarlas en el futuro."
    },
    {
        "guid": "84973897-e054-465e-bc92-f927d90d265d",
        "subjectId": "T25",
        "origin": "notebooklm",
        "type": "test",
        "difficulty": 2,
        "question": "Según el marco ITIL, el SAU o Service Desk es una función clave dentro de una de las etapas del ciclo de vida del servicio. ¿En qué etapa se encuentra?",
        "answerOptions": [
            {
                "text": "Estrategia del Servicio (Service Strategy)",
                "isCorrect": false,
                "rationale": "La Estrategia del Servicio se enfoca en la definición de los servicios a ofrecer y la política de gestión, una etapa anterior a la interacción diaria con el usuario."
            },
            {
                "text": "Diseño del Servicio (Service Design)",
                "isCorrect": false,
                "rationale": "El Diseño del Servicio se encarga de diseñar los nuevos servicios o mejorar los existentes, incluyendo la definición de los SLAs que el SAU luego ayudará a cumplir."
            },
            {
                "text": "Transición del Servicio (Service Transition)",
                "isCorrect": false,
                "rationale": "La Transición del Servicio gestiona el paso de los servicios del diseño a la operación, incluyendo la gestión de cambios y despliegues."
            },
            {
                "text": "Operación del Servicio (Service Operation)",
                "isCorrect": true,
                "rationale": "Esta es la etapa donde los servicios están activos y son utilizados por los usuarios. El SAU es la función central de esta fase, gestionando el día a día de incidencias y peticiones."
            }
        ],
        "hint": "El SAU se encarga del funcionamiento diario de los servicios una vez que están implementados y en uso."
    },
    {
        "guid": "875fc699-67f7-4986-ab79-fb9ee5b1c43f",
        "subjectId": "T25",
        "origin": "notebooklm",
        "type": "test",
        "difficulty": 2,
        "question": "Un operador del SAU se enfrenta a una llamada de un usuario muy frustrado porque un problema crítico no se ha resuelto. Además de los conocimientos técnicos, ¿qué habilidad es fundamental para este operador en esta situación?",
        "answerOptions": [
            {
                "text": "Capacidad de desarrollo de software",
                "isCorrect": false,
                "rationale": "El desarrollo de software es una habilidad de Nivel 3 y no es necesaria para la gestión de la comunicación en el primer nivel de soporte."
            },
            {
                "text": "Conocimiento profundo de la arquitectura de red",
                "isCorrect": false,
                "rationale": "Aunque el conocimiento técnico es importante, en una situación de alta tensión con un usuario, otra habilidad no técnica cobra mayor relevancia para gestionar la interacción."
            },
            {
                "text": "Capacidad comunicativa y empatía",
                "isCorrect": true,
                "rationale": "Saber escuchar, mostrar comprensión y comunicarse de manera clara y tranquila son habilidades clave para gestionar la frustración del usuario y mantener una relación positiva."
            },
            {
                "text": "Visió estratègica y de negocio",
                "isCorrect": false,
                "rationale": "La visión estratégica es una habilidad más propia del Responsable del SAU, mientras que el operador se enfoca en la resolución de la interacción inmediata."
            }
        ],
        "hint": "Piensa en las habilidades 'blandas' necesarias para tratar directamente con personas, especialmente cuando están molestas."
    },
    {
        "guid": "feac68a1-fa26-4d9f-bcd6-bdb754108c5a",
        "subjectId": "T25",
        "origin": "notebooklm",
        "type": "test",
        "difficulty": 2,
        "question": "El indicador 'Backlog de incidencias' es crucial para la gestión del SAU. ¿Qué mide exactamente este KPI?",
        "answerOptions": [
            {
                "text": "El tiempo que tarda una incidencia en ser escalada de un nivel a otro.",
                "isCorrect": false,
                "rationale": "Esto se mide con el 'Tiempo medio de escalado', que evalúa la agilidad entre niveles, pero no el volumen de trabajo pendiente."
            },
            {
                "text": "El número de tickets abiertos que están pendientes de resolución en un momento dado.",
                "isCorrect": true,
                "rationale": "El backlog representa la carga de trabajo acumulada. Un backlog alto puede indicar falta de recursos o un problema subyacente que genera muchas incidencias."
            },
            {
                "text": "El porcentaje de incidencias que se reabren después de haber sido cerradas.",
                "isCorrect": false,
                "rationale": "Este sería un indicador de calidad de la resolución, que mide si la solución fue efectiva, pero no es la definición de backlog."
            },
            {
                "text": "El coste total de todas las incidencias que se han gestionado en un mes.",
                "isCorrect": false,
                "rationale": "Esto se relaciona con el 'Cost per ticket' y el presupuesto general, no con la cantidad de trabajo que queda por hacer."
            }
        ],
        "hint": "Imagina una pila de trabajo. ¿Qué término describe la cantidad de tareas en esa pila que aún no se han completado?"
    },
    {
        "guid": "dc4fe572-2c99-44ff-8983-1220926500d2",
        "subjectId": "T25",
        "origin": "notebooklm",
        "type": "test",
        "difficulty": 2,
        "question": "Un error grave en el sistema SAP TRM requiere una intervención que el equipo interno de Nivel 2 no puede realizar. El caso se escala al soporte oficial de SAP. ¿A qué nivel de soporte corresponde esta acción?",
        "answerOptions": [
            {
                "text": "Nivel 0",
                "isCorrect": false,
                "rationale": "El Nivel 0 es el autoservicio del usuario, lo opuesto a un escalado a un proveedor experto."
            },
            {
                "text": "Nivel 1",
                "isCorrect": false,
                "rationale": "El Nivel 1 es el primer contacto y se encarga de incidencias comunes; este caso ya ha superado ese nivel y el Nivel 2."
            },
            {
                "text": "Nivel 2",
                "isCorrect": false,
                "rationale": "El Nivel 2 es el equipo técnico especializado interno que, en este escenario, ya ha sido superado por la complejidad del problema."
            },
            {
                "text": "Nivel 3",
                "isCorrect": true,
                "rationale": "Este nivel se define como el soporte de expertos, desarrolladores o, como en este caso, proveedores y fabricantes externos que se encargan de los problemas más complejos."
            }
        ],
        "hint": "Considera cuál es el último recurso cuando los equipos internos no tienen el conocimiento o las herramientas para solucionar un problema."
    },
    {
        "guid": "7ad590ff-4415-4793-a5f6-a3cf264b2e87",
        "subjectId": "T25",
        "origin": "notebooklm",
        "type": "test",
        "difficulty": 2,
        "question": "El coordinador del SAU revisa los tickets del día y observa que cinco incidencias diferentes están relacionadas con la imposibilidad de imprimir en un departamento específico. ¿Cuál es la acción más adecuada para el coordinador?",
        "answerOptions": [
            {
                "text": "Asignar cada ticket a un operador diferente para que se resuelvan en paralelo.",
                "isCorrect": false,
                "rationale": "Esto sería ineficiente, ya que varios operadores investigarían el mismo problema subyacente sin coordinación, duplicando esfuerzos."
            },
            {
                "text": "Contactar al responsable del departamento para que los usuarios dejen de abrir tickets.",
                "isCorrect": false,
                "rationale": "Esto no soluciona el problema técnico y podría generar una mala percepción del servicio de TI. El objetivo es resolver la causa, no detener los reportes."
            },
            {
                "text": "Detectar que son incidencias recurrentes, relacionarlas y escalar la investigación como un único problema.",
                "isCorrect": true,
                "rationale": "Esta es la función clave del coordinador: identificar patrones, gestionar la situación de manera centralizada y escalar a Gestión de Problemas si es necesario para encontrar la causa raíz."
            },
            {
                "text": "Cerrar cuatro de los tickets como duplicados y dejar solo uno abierto.",
                "isCorrect": false,
                "rationale": "Aunque los tickets están relacionados, cerrarlos sin comunicarlo a los usuarios afectados y sin resolver su problema individual generaría insatisfacción."
            }
        ],
        "hint": "Piensa en el rol que va más allá de la simple asignación de tickets y busca patrones para una gestión más eficiente."
    },
    {
        "guid": "ab325fae-c7db-48e1-b4a4-7fc1785e75e6",
        "subjectId": "T25",
        "origin": "notebooklm",
        "type": "test",
        "difficulty": 2,
        "question": "¿Qué KPI se utiliza para medir el tiempo promedio desde que se abre una incidencia hasta que el SAU realiza la primera acción o contacto con el usuario?",
        "answerOptions": [
            {
                "text": "Mean Time To Resolution (MTTR)",
                "isCorrect": false,
                "rationale": "MTTR mide el tiempo total hasta la resolución final, no solo hasta la primera respuesta."
            },
            {
                "text": "First Call Resolution (FCR)",
                "isCorrect": false,
                "rationale": "FCR es un porcentaje que mide si la incidencia se resolvió en el primer contacto, no el tiempo que se tardó en iniciar ese contacto."
            },
            {
                "text": "Customer Satisfaction (CSAT)",
                "isCorrect": false,
                "rationale": "CSAT es una métrica de percepción de la calidad por parte del usuario, no una medida de tiempo operativo."
            },
            {
                "text": "Mean Time To Respond (MTTRs)",
                "isCorrect": true,
                "rationale": "Este indicador mide específicamente la rapidez con la que el servicio de atención reacciona a una nueva solicitud, siendo una métrica clave para la calidad percibida."
            }
        ],
        "hint": "La clave está en la palabra 'respuesta', no 'resolución'."
    },
    {
        "guid": "a4b7997e-fa57-438d-9f72-29ca8b6a84d2",
        "subjectId": "T25",
        "origin": "notebooklm",
        "type": "test",
        "difficulty": 2,
        "question": "En el contexto de un SAU, ¿cuál de estas tareas es un ejemplo claro de 'soporte proactivo'?",
        "answerOptions": [
            {
                "text": "Registrar una incidencia reportada por un usuario por teléfono.",
                "isCorrect": false,
                "rationale": "Esto es un soporte reactivo, ya que se actúa en respuesta a un reporte del usuario."
            },
            {
                "text": "Analizar los datos de monitorización y reiniciar un servicio que muestra signos de fallo antes de que se caiga.",
                "isCorrect": true,
                "rationale": "La proactividad implica anticiparse a los problemas. Actuar basándose en alertas de monitorización antes de que el usuario se vea afectado es un ejemplo perfecto."
            },
            {
                "text": "Enviar una encuesta de satisfacción al usuario después de cerrar un ticket.",
                "isCorrect": false,
                "rationale": "Esto es parte de la comunicación y la medición de la calidad, pero ocurre después de que el evento (la incidencia) ha sido gestionado."
            },
            {
                "text": "Instalar un nuevo ordenador para un empleado que acaba de incorporarse.",
                "isCorrect": false,
                "rationale": "Esto es una petición de servicio estándar, una tarea planificada y reactiva a una solicitud del departamento de RRHH o del propio empleado."
            }
        ],
        "hint": "El soporte proactivo busca solucionar problemas antes de que el usuario se dé cuenta de que existen."
    },
    {
        "guid": "2e6740d2-6faa-4f13-ba5c-cb478684e1a9",
        "subjectId": "T25",
        "origin": "notebooklm",
        "type": "test",
        "difficulty": 2,
        "question": "Una de las herramientas clave para un SAU es una plataforma de ticketing como ServiceNow o GLPI. ¿Cuál es su función principal?",
        "answerOptions": [
            {
                "text": "Supervisar el rendimiento de los servidores y generar alertas automáticas.",
                "isCorrect": false,
                "rationale": "Esta es la función de las herramientas de monitorización como Nagios o Zabbix, no de las plataformas de ticketing."
            },
            {
                "text": "Permitir la comunicación por chat en tiempo real entre el usuario y el operador.",
                "isCorrect": false,
                "rationale": "Aunque muchas plataformas de ticketing integran un chat, su función central y fundamental es otra."
            },
            {
                "text": "Registrar, clasificar, asignar y seguir el ciclo de vida completo de cada incidencia y petición.",
                "isCorrect": true,
                "rationale": "Esta es la función nuclear de una herramienta de ticketing: servir como sistema de registro centralizado para toda la actividad del SAU y garantizar la trazabilidad."
            },
            {
                "text": "Almacenar y organizar artículos de una base de conocimiento para consulta del personal y los usuarios.",
                "isCorrect": false,
                "rationale": "Las bases de conocimiento (como Confluence o un módulo específico) cumplen esta función. Las herramientas de ticketing se centran en la gestión de casos individuales."
            }
        ],
        "hint": "Piensa en el 'corazón' del SAU, el sistema que permite que ninguna solicitud se pierda y que todo quede registrado."
    },
    {
        "guid": "ca5a9c8b-add1-4eaf-a641-06d9144c2b44",
        "subjectId": "T25",
        "origin": "notebooklm",
        "type": "test",
        "difficulty": 2,
        "question": "El documento que actúa como 'única fuente de información consistente de servicios acordados, disponible para quien tenga autorización' en el marco de ITIL es el:",
        "answerOptions": [
            {
                "text": "Acuerdo de Nivel de Servicio (SLA)",
                "isCorrect": false,
                "rationale": "Un SLA define los objetivos de nivel de servicio para un servicio específico, pero no es el listado completo de todos los servicios ofrecidos."
            },
            {
                "text": "Catálogo de Servicios",
                "isCorrect": true,
                "rationale": "Esta es la definición precisa del Catálogo de Servicios, que centraliza toda la información sobre los servicios de TI que se ofrecen a los usuarios o clientes."
            },
            {
                "text": "Base de Datos de Gestión de la Configuración (CMDB)",
                "isCorrect": false,
                "rationale": "La CMDB contiene información sobre los activos de TI (elementos de configuración) y sus relaciones, no sobre los servicios desde la perspectiva del negocio o del usuario."
            },
            {
                "text": "Plan de Continuidad del Negocio",
                "isCorrect": false,
                "rationale": "Este documento detalla cómo se recuperarán los servicios tras un desastre, pero no describe el portafolio de servicios en operación normal."
            }
        ],
        "hint": "Esta pregunta se basa en una de las preguntas de exámenes anteriores. Se refiere al 'menú' de servicios que TI ofrece al negocio."
    },
    {
        "guid": "06a2b535-6f6a-4d91-ba73-c2b39dcd4ca8",
        "subjectId": "T25",
        "origin": "notebooklm",
        "type": "test",
        "difficulty": 2,
        "question": "Según ITIL, el Catálogo de Servicios tiene dos vistas. ¿Cuáles son y qué propósito tiene esta división?",
        "answerOptions": [
            {
                "text": "Vista Interna y Externa; para separar los servicios para empleados de los servicios para clientes.",
                "isCorrect": false,
                "rationale": "Aunque conceptualmente similar, los términos estándar de ITIL para estas vistas son más específicos y se basan en la perspectiva técnica frente a la de negocio."
            },
            {
                "text": "Vista de Negocio y Vista Técnica; para separar la visión orientada al usuario de los detalles de la infraestructura que lo soporta.",
                "isCorrect": true,
                "rationale": "Esta división permite que los usuarios de negocio vean los servicios en sus propios términos, mientras que el personal de TI puede ver los componentes técnicos subyacentes."
            },
            {
                "text": "Vista de Desarrollo y Vista de Producción; para diferenciar servicios en prueba de los que ya están operativos.",
                "isCorrect": false,
                "rationale": "Esta separación es importante en el ciclo de vida del software, pero no corresponde a las dos vistas estándar del Catálogo de Servicios de ITIL."
            },
            {
                "text": "Vista de Costes y Vista de Valor; para mostrar el precio de los servicios frente al beneficio que aportan al negocio.",
                "isCorrect": false,
                "rationale": "El coste y el valor son atributos importantes de un servicio, pero no definen las dos vistas principales del catálogo según ITIL."
            }
        ],
        "hint": "Una vista es para el 'cliente' que consume el servicio y la otra es para el 'cocinero' que lo prepara."
    },
    {
        "guid": "8ac50626-8c49-49e7-a8d9-36ac3a59b1ec",
        "subjectId": "T25",
        "origin": "notebooklm",
        "type": "test",
        "difficulty": 2,
        "question": "¿Qué describe mejor el concepto de 'Nivel 0' o autoservicio en un SAU moderno?",
        "answerOptions": [
            {
                "text": "Un servicio de atención telefónica disponible 24/7 con operadores de primer nivel.",
                "isCorrect": false,
                "rationale": "La atención por parte de operadores, aunque sea 24/7, corresponde al Nivel 1 (el primer contacto humano)."
            },
            {
                "text": "Un sistema donde el propio usuario puede resolver incidencias comunes utilizando herramientas como portales con FAQ, guías o chatbots.",
                "isCorrect": true,
                "rationale": "El Nivel 0 se caracteriza por la autonomía del usuario, que utiliza recursos proporcionados por TI para solucionar problemas sin intervención directa del personal de soporte."
            },
            {
                "text": "Un equipo de técnicos que se desplaza físicamente para resolver problemas de hardware.",
                "isCorrect": false,
                "rationale": "El soporte presencial o 'de campo' es una forma de soporte de Nivel 1 o 2, pero no se considera autoservicio."
            },
            {
                "text": "El primer operador que recibe una llamada y registra el ticket en el sistema.",
                "isCorrect": false,
                "rationale": "Esta es la definición del rol de Nivel 1, que actúa como el primer filtro humano del SAU."
            }
        ],
        "hint": "Piensa en el nivel de soporte que empodera al usuario para que sea su propio técnico para tareas sencillas."
    },
    {
        "guid": "574890c3-bae8-4ab6-bd02-c610ed07e414",
        "subjectId": "T25",
        "origin": "notebooklm",
        "type": "test",
        "difficulty": 2,
        "question": "La fórmula $FCR = \frac{\text{incidències resoltes al primer contacte}}{\text{total incidències}} \times 100$ se utiliza para calcular un KPI clave. ¿Cuál es el principal beneficio de tener un FCR alto?",
        "answerOptions": [
            {
                "text": "Reduce el coste por ticket y aumenta la satisfacción del usuario.",
                "isCorrect": true,
                "rationale": "Resolver en el primer contacto es más rápido y barato (menos horas de técnico), y los usuarios aprecian una solución inmediata, lo que impacta positivamente en ambos indicadores."
            },
            {
                "text": "Asegura que todos los problemas complejos sean revisados por expertos de Nivel 3.",
                "isCorrect": false,
                "rationale": "Un FCR alto significa que menos problemas llegan a los niveles superiores, liberando a los expertos para que se centren en los casos que realmente requieren su atención, pero no 'asegura' que todos lleguen."
            },
            {
                "text": "Incrementa el número total de tickets que el SAU puede gestionar mensualmente.",
                "isCorrect": false,
                "rationale": "Un FCR alto puede liberar tiempo y permitir gestionar más tickets, pero su principal beneficio es la eficiencia y la calidad percibida, no solo el volumen."
            },
            {
                "text": "Mejora la calidad de la base de conocimiento de forma automática.",
                "isCorrect": false,
                "rationale": "Un FCR alto puede ser el resultado de una buena base de conocimiento, pero no la mejora automáticamente. La documentación de nuevas soluciones es un proceso activo."
            }
        ],
        "hint": "Considera el impacto en los recursos (tiempo y dinero) y en la percepción del usuario cuando un problema se soluciona de inmediato."
    },
    {
        "guid": "450a4efd-b1ac-4150-90c2-4ade0251dd02",
        "subjectId": "T25",
        "origin": "notebooklm",
        "type": "test",
        "difficulty": 2,
        "question": "En el contexto de la mejora de servicios y procesos, el material relaciona el SAU con ITIL. ¿Por qué es el SAU (Service Desk) tan importante en este marco de trabajo?",
        "answerOptions": [
            {
                "text": "Porque es el único proceso definido en la fase de Operación del Servicio.",
                "isCorrect": false,
                "rationale": "La Operación del Servicio incluye otros procesos importantes como la Gestión de Incidencias, Peticiones, Problemas y Eventos. El Service Desk es una función, no el único proceso."
            },
            {
                "text": "Porque es el punto único de contacto (SPOC) que centraliza la comunicación con el usuario en todas las fases del ciclo de vida.",
                "isCorrect": true,
                "rationale": "Actúa como la cara visible de TI, canalizando toda la interacción con los usuarios, lo que lo convierte en una pieza fundamental para la percepción y el funcionamiento de todos los servicios."
            },
            {
                "text": "Porque es responsable de desarrollar todas las herramientas de monitorización.",
                "isCorrect": false,
                "rationale": "El SAU utiliza herramientas de monitorización y puede generar requisitos para ellas, pero su desarrollo e implementación suelen ser responsabilidad de otros equipos técnicos."
            },
            {
                "text": "Porque define y negocia los costes de todos los servicios del catálogo.",
                "isCorrect": false,
                "rationale": "La gestión financiera de TI, incluida la imputación de costes, es un proceso separado que involucra a roles de gestión, no es una función primaria del Service Desk."
            }
        ],
        "hint": "Piensa en el rol del SAU como la 'puerta de entrada' a todo el departamento de TI para los usuarios finales."
    },
    {
        "guid": "77a04358-4b1d-4ff6-9f9b-12d36435ea58",
        "subjectId": "T25",
        "origin": "notebooklm",
        "type": "test",
        "difficulty": 2,
        "question": "Al utilizar herramientas como Power BI o Grafana conectadas a la plataforma de ticketing, el Responsable del SAU puede...",
        "answerOptions": [
            {
                "text": "Resolver incidencias de Nivel 2 directamente desde el cuadro de mando.",
                "isCorrect": false,
                "rationale": "Estas herramientas son para visualización y análisis de datos. La resolución de incidencias se realiza en la plataforma de ticketing o con herramientas técnicas específicas."
            },
            {
                "text": "Desarrollar scripts de automatización para resolver tareas repetitivas.",
                "isCorrect": false,
                "rationale": "El desarrollo de automatizaciones se realiza con herramientas de RPA (UiPath) o funcionalidades de la propia plataforma de ticketing, no con herramientas de business intelligence."
            },
            {
                "text": "Supervisar visualmente los KPIs, el cumplimiento de SLAs y las tendencias del servicio en tiempo real.",
                "isCorrect": true,
                "rationale": "La principal función de estas herramientas es crear cuadros de mando (dashboards) que permiten una visión clara y gráfica del rendimiento del servicio, facilitando la toma de decisiones."
            },
            {
                "text": "Gestionar la base de conocimiento y publicar nuevos artículos de FAQ.",
                "isCorrect": false,
                "rationale": "La gestión del conocimiento se realiza en sistemas tipo wiki (Confluence) o en los módulos específicos de la plataforma de ticketing."
            }
        ],
        "hint": "¿Para qué se usan las herramientas que crean gráficos y paneles de control?"
    },
    {
        "guid": "7b0e6af7-167d-4cb9-9447-8ad72119ee50",
        "subjectId": "T25",
        "origin": "notebooklm",
        "type": "test",
        "difficulty": 2,
        "question": "Si el número de incidencias recurrentes sobre un mismo sistema es consistentemente alto mes tras mes, ¿qué indica esto sobre el SAU y los procesos de TI?",
        "answerOptions": [
            {
                "text": "Que el Nivel 1 está haciendo un excelente trabajo de resolución rápida.",
                "isCorrect": false,
                "rationale": "Aunque el Nivel 1 puede estar resolviendo los síntomas rápidamente (un FCR alto), la recurrencia del problema indica que la causa subyacente no se está abordando."
            },
            {
                "text": "Que es necesario contratar a más operadores de SAU para atender el volumen.",
                "isCorrect": false,
                "rationale": "Aumentar el personal es una solución reactiva. Una gestión madura buscaría reducir el número de incidencias en lugar de simplemente añadir más gente para gestionarlas."
            },
            {
                "text": "Que existe un problema subyacente que debe ser escalado a la Gestión de Problemas para encontrar la causa raíz.",
                "isCorrect": true,
                "rationale": "Un alto número de incidencias recurrentes es la señal principal para iniciar un proceso de Gestión de Problemas, cuyo objetivo es encontrar y eliminar la causa de forma definitiva."
            },
            {
                "text": "Que los SLAs definidos para ese servicio son demasiado estrictos y deben relajarse.",
                "isCorrect": false,
                "rationale": "Relajar los SLAs no solucionaría el problema técnico de fondo que está causando las incidencias, simplemente ocultaría el impacto en las métricas."
            }
        ],
        "hint": "Resolver el mismo fallo una y otra vez es ineficiente. ¿Qué proceso busca eliminar el fallo de raíz?"
    },
    {
        "guid": "df20e42f-ef20-4f32-a3f0-21c129b182f4",
        "subjectId": "T25",
        "origin": "notebooklm",
        "type": "test",
        "difficulty": 2,
        "question": "Una tendencia actual es el uso de RPA (Robotic Process Automation) e IA en el SAU. ¿Cuál de las siguientes tareas es un candidato ideal para ser automatizado con estas tecnologías?",
        "answerOptions": [
            {
                "text": "La negociación de un nuevo SLA con un área de negocio.",
                "isCorrect": false,
                "rationale": "La negociación requiere habilidades humanas de comunicación, comprensión del contexto de negocio y toma de decisiones estratégicas, tareas no adecuadas para la automatización."
            },
            {
                "text": "El diagnóstico de un error complejo y nunca antes visto en una aplicación.",
                "isCorrect": false,
                "rationale": "El diagnóstico de problemas nuevos y complejos requiere análisis y razonamiento crítico por parte de técnicos especializados, algo que la IA actual aún no puede replicar de forma fiable."
            },
            {
                "text": "El desbloqueo de una cuenta de usuario o el restablecimiento de una contraseña tras una validación de identidad.",
                "isCorrect": true,
                "rationale": "Estas son tareas repetitivas, basadas en reglas y de alto volumen, lo que las convierte en candidatas perfectas para ser automatizadas mediante bots o scripts, liberando tiempo de los operadores."
            },
            {
                "text": "La comunicación empática con un usuario muy enfadado por una caída del servicio.",
                "isCorrect": false,
                "rationale": "La gestión de las emociones y la empatía son habilidades intrínsecamente humanas que la IA no puede replicar eficazmente en el contexto de la atención al cliente."
            }
        ],
        "hint": "La automatización funciona mejor con tareas que son altamente repetitivas, predecibles y basadas en reglas claras."
    }
]