[
  {
    "guid": "a238f046-6fbd-4174-ac61-73852dee1a29",
    "subjectId": "T27",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "Segons la Directiva (UE) 2019/1937, quina de les següents organitzacions està obligada a establir un canal de denúncies intern (whistleblowing)?",
    "answerOptions": [
      {
        "text": "Una empresa tecnològica amb 65 treballadors.",
        "isCorrect": true,
        "rationale": "La directiva estableix l'obligatorietat per a organitzacions amb més de 50 treballadors, independentment del sector."
      },
      {
        "text": "Una administració pública amb 40 treballadors.",
        "isCorrect": false,
        "rationale": "Encara que és una pràctica recomanable, la directiva europea estableix el llindar mínim en 50 empleats per a l'obligatorietat."
      },
      {
        "text": "Qualsevol empresa que tracti dades personals, sense importar la seva mida.",
        "isCorrect": false,
        "rationale": "L'obligació de tenir canals de denúncia es basa en el nombre de treballadors, no directament en el tipus de dades que es tracten."
      },
      {
        "text": "Només les empreses que cotitzen a borsa.",
        "isCorrect": false,
        "rationale": "L'obligació no es limita a les empreses cotitzades, sinó que s'aplica de manera més àmplia segons la mida de la plantilla."
      }
    ],
    "hint": "Recorda el llindar numèric de treballadors que activa aquesta obligació segons la normativa europea sobre protecció d'informants."
  },
  {
    "guid": "639d6acb-b4e4-4ea2-9dfd-32518d6eb454",
    "subjectId": "T27",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "Dins d'un sistema de gestió del compliance, quin element té com a objectiu principal identificar, valorar i classificar els riscos legals, operacionals i reputacionals?",
    "answerOptions": [
      {
        "text": "El canal de denúncies.",
        "isCorrect": false,
        "rationale": "El canal de denúncies és un mecanisme per detectar incompliments, però no per a la identificació sistemàtica i prèvia de tots els riscos."
      },
      {
        "text": "El Codi Ètic i de Conducta.",
        "isCorrect": false,
        "rationale": "El codi ètic estableix les normes de comportament, que es basen en els riscos identificats, però no és l'eina d'identificació en si mateixa."
      },
      {
        "text": "El mapa de riscos.",
        "isCorrect": true,
        "rationale": "Aquest document o procés és la base sobre la qual es construeix el sistema de compliance, ja que defineix on cal aplicar els controls."
      },
      {
        "text": "L'auditoria externa.",
        "isCorrect": false,
        "rationale": "L'auditoria verifica l'eficàcia del sistema i pot identificar nous riscos, però la seva funció principal és la validació, no la creació inicial del mapa."
      }
    ],
    "hint": "Pensa en el primer pas estratègic que ha de fer una organització per saber a quins perills normatius s'enfronta."
  },
  {
    "guid": "81e7bfa6-f4fe-4776-9103-f4c3687c9083",
    "subjectId": "T27",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "Una empresa de software vol obtenir una certificació internacional per demostrar que el seu sistema de gestió de la seguretat de la informació compleix amb les millors pràctiques. Quina norma ISO hauria de prendre com a referència principal?",
    "answerOptions": [
      {
        "text": "ISO 37301",
        "isCorrect": false,
        "rationale": "Aquesta norma se centra en els sistemes de gestió del Compliance en general, no específicament en la seguretat de la informació."
      },
      {
        "text": "ISO 37001",
        "isCorrect": false,
        "rationale": "Aquesta norma està dissenyada per als sistemes de gestió anti-suborn, un àmbit molt concret del compliance penal."
      },
      {
        "text": "ISO 27001",
        "isCorrect": true,
        "rationale": "És l'estàndard internacional per excel·lència per a la implementació d'un Sistema de Gestió de Seguretat de la Informació (SGSI)."
      },
      {
        "text": "ISO 19600",
        "isCorrect": false,
        "rationale": "Aquesta norma era una guia de bones pràctiques per al compliance, però ha estat substituïda per la ISO 37301 i no és certificable."
      }
    ],
    "hint": "Busca l'estàndard que s'enfoca directament en els SGSI (Sistemes de Gestió de Seguretat de la Informació)."
  },
  {
    "guid": "31a4e42f-82fd-4089-a658-774ed3c5d204",
    "subjectId": "T27",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "Quin és l'objectiu principal del 'Compliance Penal' en una organització, segons el marc normatiu espanyol?",
    "answerOptions": [
      {
        "text": "Assegurar el compliment de la normativa laboral i de prevenció de riscos.",
        "isCorrect": false,
        "rationale": "Això correspon al Compliance Legal o Laboral, que tracta de les relacions amb els treballadors i la seva seguretat."
      },
      {
        "text": "Establir un Codi Ètic per fomentar una cultura de transparència i bon govern.",
        "isCorrect": false,
        "rationale": "Aquesta és una finalitat del Compliance Ètic i RSC, que va més enllà de les obligacions legals penals."
      },
      {
        "text": "Prevenir la comissió de delictes que puguin generar responsabilitat penal per a la persona jurídica.",
        "isCorrect": true,
        "rationale": "El seu focus és implementar models de prevenció per evitar delictes com suborn, frau o blanqueig de capitals, tal com regula l'article 31 bis del Codi Penal."
      },
      {
        "text": "Garantir el compliment del RGPD i l'Esquema Nacional de Seguretat.",
        "isCorrect": false,
        "rationale": "Aquestes normatives s'emmarquen dins del Compliance TIC i de Ciberseguretat, que té sancions administratives, no directament penals en primera instància."
      }
    ],
    "hint": "Relaciona aquest tipus de compliance amb l'article 31 bis del Codi Penal i les conseqüències per a l'empresa si es comet un delicte en el seu si."
  },
  {
    "guid": "e3864827-3103-4741-889c-5f9658dd7033",
    "subjectId": "T27",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "A l'Ajuntament de Barcelona, quin mecanisme s'ha establert específicament perquè el personal o la ciutadania pugui comunicar males pràctiques internes garantint la confidencialitat i l'opció d'anonimat?",
    "answerOptions": [
      {
        "text": "El Portal Jurídic de l'Ajuntament.",
        "isCorrect": false,
        "rationale": "El Portal Jurídic és una eina de transparència per consultar normativa, però no un canal per rebre comunicacions de males pràctiques."
      },
      {
        "text": "L'aplicació mòbil 'Barcelona a la butxaca'.",
        "isCorrect": false,
        "rationale": "Aquesta app serveix per a queixes i suggeriments generals sobre serveis municipals, no està dissenyada per a denúncies internes de males pràctiques amb protecció de l'informant."
      },
      {
        "text": "La Bústia Ètica i de Bon Govern.",
        "isCorrect": true,
        "rationale": "Aquest canal està dissenyat explícitament per complir la funció de canal de denúncies intern, en línia amb la Llei 2/2023."
      },
      {
        "text": "El Codi Ètic i de Conducta municipal.",
        "isCorrect": false,
        "rationale": "El Codi Ètic és el document que defineix les normes, però no és el canal per comunicar el seu incompliment."
      }
    ],
    "hint": "Pensa en l'eina que equival a un 'canal de denúncies' o 'whistleblowing channel' en el context de l'Ajuntament."
  },
  {
    "guid": "e0ceedc5-b335-4826-916f-faa0e04080d4",
    "subjectId": "T27",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "Un prestador de serveis de confiança que emet certificats qualificats a Europa, segons el Reglament eIDAS, ha de sotmetre's a auditories de conformitat. Amb quina periodicitat mínima s'han de realitzar aquestes auditories?",
    "answerOptions": [
      {
        "text": "Cada 5 anys.",
        "isCorrect": false,
        "rationale": "Aquest termini és massa llarg per garantir la seguretat i fiabilitat contínua que exigeix la normativa per a serveis qualificats."
      },
      {
        "text": "Cada 2 anys.",
        "isCorrect": true,
        "rationale": "El Reglament (UE) 910/2014 estableix explícitament que els prestadors qualificats han de ser auditats per un organisme de conformitat com a mínim cada 24 mesos."
      },
      {
        "text": "Cada any.",
        "isCorrect": false,
        "rationale": "Encara que una empresa pot optar per auditories anuals, la freqüència mínima obligatòria establerta per la normativa europea és menor."
      },
      {
        "text": "Només quan hi ha un incident de seguretat.",
        "isCorrect": false,
        "rationale": "Les auditories són una mesura de control preventiu i periòdic, no només una reacció a incidents."
      }
    ],
    "hint": "Consulta la periodicitat de control que s'exigeix als proveïdors que ofereixen el màxim nivell de garantia en serveis d'identificació digital."
  },
  {
    "guid": "7fdb571c-aed1-49cc-aeac-1bbee1586fc3",
    "subjectId": "T27",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "Si una consultora tecnològica que treballa per a l'Administració Pública ha d'assegurar el compliment de les mesures de seguretat TIC obligatòries per al sector públic a Espanya, quina normativa és la seva principal referència?",
    "answerOptions": [
      {
        "text": "La Llei 6/2020 de serveis electrònics de confiança.",
        "isCorrect": false,
        "rationale": "Aquesta llei desenvolupa el reglament eIDAS, centrant-se en la signatura i segells electrònics, però no defineix el marc general de seguretat per a les AAPP."
      },
      {
        "text": "El Reglament General de Protecció de Dades (RGPD).",
        "isCorrect": false,
        "rationale": "El RGPD és clau per a la protecció de dades personals, però l'ENS estableix el marc complet de mesures tècniques i organitzatives de seguretat per al sector públic."
      },
      {
        "text": "L'Esquema Nacional de Seguretat (ENS - RD 311/2022).",
        "isCorrect": true,
        "rationale": "L'ENS és la norma que estableix la política de seguretat en la utilització de mitjans electrònics i és d'obligat compliment per a totes les Administracions Públiques i els seus proveïdors."
      },
      {
        "text": "La norma ISO 22301 sobre continuïtat de negoci.",
        "isCorrect": false,
        "rationale": "La ISO 22301 és un estàndard de referència per a la continuïtat, però no és la normativa de compliment obligatori que defineix totes les mesures de seguretat per a les AAPP espanyoles."
      }
    ],
    "hint": "Pensa en el marc normatiu espanyol que estableix les dimensions de seguretat (disponibilitat, integritat, confidencialitat, etc.) per als sistemes del sector públic."
  },
  {
    "guid": "3cbcf5b0-8d7a-47fc-b5b1-b99e21e513b4",
    "subjectId": "T27",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "Dins dels rols clau en la gestió del Compliance, qui té la responsabilitat principal de garantir que l'òrgan de Compliance disposi dels recursos necessaris i de liderar amb l'exemple la cultura de compliment?",
    "answerOptions": [
      {
        "text": "Els auditors externs.",
        "isCorrect": false,
        "rationale": "Els auditors validen el sistema, però no són responsables de dotar-lo de recursos; aquesta és una funció interna de govern."
      },
      {
        "text": "El Compliance Officer.",
        "isCorrect": false,
        "rationale": "El Compliance Officer dissenya i supervisa el sistema, però depèn d'un nivell superior per a l'assignació de recursos i el suport estratègic."
      },
      {
        "text": "L'Alta Direcció.",
        "isCorrect": true,
        "rationale": "El suport i compromís de l'alta direcció ('tone at the top') és fonamental per a l'èxit de qualsevol sistema de compliance, incloent-hi la provisió de mitjans."
      },
      {
        "text": "El Comitè d'Ètica.",
        "isCorrect": false,
        "rationale": "El comitè és un òrgan de suport i decisió, però la responsabilitat última sobre els recursos i el lideratge recau en la cúpula directiva de l'organització."
      }
    ],
    "hint": "Busca el rol que es troba al cim de la jerarquia organitzativa i del qual depèn el suport estratègic del programa."
  },
  {
    "guid": "6f443478-a68f-4bb6-acf5-417d78766681",
    "subjectId": "T27",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "Quina és la principal diferència entre el temari de Compliance de les OPOS 24 (Tema 27) i el de les OPOS 23 (Tema 39)?",
    "answerOptions": [
      {
        "text": "El temari de OPOS 24 és més ampli perquè inclou la gestió de riscos laborals.",
        "isCorrect": false,
        "rationale": "La gestió de riscos laborals és part del compliance legal general, però la diferència clau entre els dos temaris rau en un altre àmbit."
      },
      {
        "text": "El temari de OPOS 23 era més ampli, ja que incloïa preauditories internes i auditories de fabricants/proveïdors.",
        "isCorrect": true,
        "rationale": "El text especifica que el temari anterior afegia la visió de control previ i extern, fent-lo lleugerament més extens en aquests aspectes concrets."
      },
      {
        "text": "El temari de OPOS 24 se centra exclusivament en Compliance Penal, mentre que el de OPOS 23 era més general.",
        "isCorrect": false,
        "rationale": "Tots dos temaris aborden el compliance de manera general; la diferència no està en l'exclusivitat sinó en la inclusió d'elements addicionals."
      },
      {
        "text": "No hi ha cap diferència substancial, només ha canviat la numeració del tema.",
        "isCorrect": false,
        "rationale": "El text indica clarament que, a més del canvi de número, hi havia una diferència de contingut relacionada amb auditories específiques."
      }
    ],
    "hint": "Compara els títols i les descripcions dels temaris d'ambdues convocatòries que es detallen a la font."
  },
  {
    "guid": "e7eb8dea-12f7-4a5f-ab1f-736da3fa92f4",
    "subjectId": "T27",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "Una organització implementa un codi de conducta, polítiques de diversitat i plans de sostenibilitat mediambiental que van més enllà de les seves obligacions legals. A quin tipus de compliance corresponen principalment aquestes iniciatives?",
    "answerOptions": [
      {
        "text": "Compliance Legal.",
        "isCorrect": false,
        "rationale": "El Compliance Legal se centra a complir les lleis vigents, mentre que aquestes accions superen el mínim legal exigit."
      },
      {
        "text": "Compliance TIC i Ciberseguretat.",
        "isCorrect": false,
        "rationale": "Aquestes iniciatives no estan directament relacionades amb la seguretat de la informació o les tecnologies digitals."
      },
      {
        "text": "Compliance Penal.",
        "isCorrect": false,
        "rationale": "Encara que algunes accions poden ajudar a prevenir delictes mediambientals, el seu enfocament principal és més ampli i voluntari."
      },
      {
        "text": "Compliance Ètic i Responsabilitat Social Corporativa (RSC).",
        "isCorrect": true,
        "rationale": "Aquest tipus de compliance es basa en l'autoregulació i l'adopció de bones pràctiques i valors que milloren la reputació i la sostenibilitat."
      }
    ],
    "hint": "Pensa en el tipus de compliment que es basa en valors, autoregulació i compromisos voluntaris de l'organització."
  },
  {
    "guid": "214f838f-4425-4c4f-b7f7-caffa2e49ca2",
    "subjectId": "T27",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "Una empresa sospita que un dels seus directius ha acceptat un suborn. Després d'una investigació interna, es confirma l'incompliment. Segons el cicle de vida d'un sistema de compliance, quin seria el pas següent?",
    "answerOptions": [
      {
        "text": "Realitzar una auditoria externa de tot el sistema.",
        "isCorrect": false,
        "rationale": "L'auditoria és una eina de monitorització i validació, però l'acció immediata després de confirmar un incompliment és una altra."
      },
      {
        "text": "Actualitzar el mapa de riscos de l'organització.",
        "isCorrect": false,
        "rationale": "L'actualització del mapa de riscos pot ser una conseqüència, però abans cal gestionar l'incident detectat."
      },
      {
        "text": "Aplicar el procediment de resposta i mesures correctives.",
        "isCorrect": true,
        "rationale": "Aquesta fase inclou accions com sancions disciplinàries, comunicació a les autoritats si escau, i la implementació de millores per evitar la repetició."
      },
      {
        "text": "Impartir formació urgent a tota la plantilla sobre suborns.",
        "isCorrect": false,
        "rationale": "La formació és una mesura preventiva clau i pot reforçar-se com a mesura correctora, però el primer pas és gestionar l'incompliment ja confirmat."
      }
    ],
    "hint": "Un cop detectat i investigat un problema, què ha de fer l'organització per gestionar-lo i aprendre'n?"
  },
  {
    "guid": "12d75018-7821-49d5-8d15-4200ba8a9092",
    "subjectId": "T27",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "El Reglament (UE) 910/2014, conegut com a eIDAS, regula diversos serveis electrònics. Quin dels següents NO és considerat un servei de confiança segons aquest reglament?",
    "answerOptions": [
      {
        "text": "El segell de temps electrònic.",
        "isCorrect": false,
        "rationale": "El segell de temps (timestamping) és un servei de confiança explícitament regulat per eIDAS per provar que una dada existia en un moment concret."
      },
      {
        "text": "La signatura electrònica.",
        "isCorrect": false,
        "rationale": "La signatura electrònica és un dels pilars fonamentals del reglament eIDAS, que estableix el seu marc legal a tota la UE."
      },
      {
        "text": "L'emmagatzematge de dades al núvol (cloud storage).",
        "isCorrect": true,
        "rationale": "Encara que els proveïdors de cloud han de complir altres normatives (com RGPD o ENS), l'emmagatzematge com a tal no està definit com un 'servei de confiança' en el marc d'eIDAS."
      },
      {
        "text": "El servei de lliurament electrònic certificat.",
        "isCorrect": false,
        "rationale": "Aquest servei, que proporciona proves sobre l'enviament i recepció de dades, està contemplat dins dels serveis de confiança regulats per eIDAS."
      }
    ],
    "hint": "Revisa la llista de serveis que tenen a veure amb la identitat i la validació de transaccions electròniques segons la normativa europea."
  },
  {
    "guid": "fdb87ffb-0d6a-47a0-8918-f2a38235443d",
    "subjectId": "T27",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "¿Cuál es la principal función de un 'mapa de riesgos' dentro de un sistema de gestión de Compliance?",
    "answerOptions": [
      {
        "text": "Establecer las sanciones disciplinarias para los empleados que cometan infracciones.",
        "isCorrect": false,
        "rationale": "El mapa de riesgos se enfoca en la prevención y el análisis previo, mientras que el establecimiento de sanciones forma parte de la fase de respuesta y medidas correctivas."
      },
      {
        "text": "Redactar el código ético y las políticas internas de la organización.",
        "isCorrect": false,
        "rationale": "La redacción de políticas es una consecuencia del análisis de riesgos, pero la función principal del mapa es identificar dónde se necesitan dichas políticas."
      },
      {
        "text": "Identificar, valorar y clasificar los riesgos legales y éticos a los que se enfrenta la organización.",
        "isCorrect": true,
        "rationale": "Esta es la definición central del mapa de riesgos, que sirve como base para desarrollar el resto de los controles y procedimientos del sistema de Compliance."
      },
      {
        "text": "Realizar auditorías externas para certificar el cumplimiento de las normas ISO.",
        "isCorrect": false,
        "rationale": "Las auditorías son un elemento de monitorización y validación del sistema, pero el mapa de riesgos es el paso inicial para diseñar qué se debe auditar."
      }
    ],
    "hint": "Piensa en el primer paso que una organización debe dar para saber a qué peligros normativos se expone."
  },
  {
    "guid": "6da50253-c021-43ae-bc0e-d8b5291cd185",
    "subjectId": "T27",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "Según la Directiva (UE) 2019/1937, ¿qué requisito fundamental deben cumplir las organizaciones para implementar un canal de denuncias o 'whistleblowing'?",
    "answerOptions": [
      {
        "text": "Tener más de 50 trabajadores.",
        "isCorrect": true,
        "rationale": "La directiva establece este umbral de personal como el criterio principal para la obligatoriedad de implementar canales de denuncia internos."
      },
      {
        "text": "Operar en el sector financiero o sanitario.",
        "isCorrect": false,
        "rationale": "Aunque estos sectores tienen regulaciones estrictas, la obligación del canal de denuncias según esta directiva se basa en el tamaño de la plantilla, no en el sector."
      },
      {
        "text": "Haber sufrido un incidente de seguridad previamente.",
        "isCorrect": false,
        "rationale": "La implementación del canal es una medida preventiva obligatoria por ley, no una reacción a un incidente ya ocurrido."
      },
      {
        "text": "Estar en proceso de certificación ISO 37001.",
        "isCorrect": false,
        "rationale": "Aunque un canal de denuncias es un elemento clave para la certificación anti-soborno, la obligación legal general proviene de la directiva europea y se basa en el número de empleados."
      }
    ],
    "hint": "La normativa europea sobre protección de informantes establece un criterio basado en el tamaño de la organización."
  },
  {
    "guid": "0f8182b5-b7cd-4889-97d2-b45503aa7e7b",
    "subjectId": "T27",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "Si una empresa implementa un programa específico para evitar delitos de soborno, fraude y corrupción, con el objetivo de eximir o atenuar su responsabilidad penal, ¿en qué tipo de Compliance se está enfocando principalmente?",
    "answerOptions": [
      {
        "text": "Compliance TIC y Ciberseguridad",
        "isCorrect": false,
        "rationale": "Este tipo de Compliance se centra en normativas como el RGPD o el ENS, relacionadas con la seguridad de la información, no directamente con la prevención de delitos penales corporativos."
      },
      {
        "text": "Compliance Ético y RSC",
        "isCorrect": false,
        "rationale": "Aunque la prevención de la corrupción tiene un componente ético, el objetivo de atenuar la responsabilidad penal de la persona jurídica lo enmarca específicamente en otra categoría."
      },
      {
        "text": "Compliance Penal",
        "isCorrect": true,
        "rationale": "Este enfoque está directamente relacionado con el artículo 31 bis del Código Penal español, que regula la responsabilidad penal de las personas jurídicas y los modelos de prevención de delitos."
      },
      {
        "text": "Compliance Sectorial",
        "isCorrect": false,
        "rationale": "A menos que se trate de un sector con una regulación anti-corrupción específica, la prevención general de delitos corporativos se engloba en una categoría más amplia."
      }
    ],
    "hint": "Considera qué normativa española regula la responsabilidad de las empresas por delitos cometidos en su nombre."
  },
  {
    "guid": "0b0bfda1-14ab-4db9-8b7f-fd2803be82b2",
    "subjectId": "T27",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "¿Qué estándar internacional proporciona los requisitos para implantar un Sistema de Gestión Anti-Suborno?",
    "answerOptions": [
      {
        "text": "ISO 37301",
        "isCorrect": false,
        "rationale": "Esta norma establece los requisitos para un Sistema de Gestión de Compliance en general, abarcando todo tipo de obligaciones de cumplimiento, no solo el soborno."
      },
      {
        "text": "ISO 19600",
        "isCorrect": false,
        "rationale": "Esta norma era una guía de directrices sobre sistemas de gestión de Compliance, pero fue anulada y reemplazada por la ISO 37301, y no era específica para el anti-soborno."
      },
      {
        "text": "ISO 27001",
        "isCorrect": false,
        "rationale": "Este estándar se centra en los Sistemas de Gestión de la Seguridad de la Información (SGSI), un pilar del Compliance TIC, pero no del anti-soborno."
      },
      {
        "text": "ISO 37001",
        "isCorrect": true,
        "rationale": "Este estándar está diseñado específicamente para ayudar a las organizaciones a prevenir, detectar y abordar el soborno, estableciendo un marco de gestión para ello."
      }
    ],
    "hint": "Busca la norma ISO que se especializa en una forma concreta de corrupción mencionada en el temario."
  },
  {
    "guid": "c27e0c0b-ab59-44ed-918e-04fd289b0c79",
    "subjectId": "T27",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "En el contexto del Ajuntament de Barcelona, ¿cuál es la herramienta específica que cumple la función de canal de denuncias para comunicar malas prácticas internas, garantizando la confidencialidad y el anonimato?",
    "answerOptions": [
      {
        "text": "El Portal Jurídic de l'Ajuntament",
        "isCorrect": false,
        "rationale": "El Portal Jurídic es una herramienta de transparencia para consultar la normativa municipal, pero no es un canal para recibir denuncias de forma confidencial."
      },
      {
        "text": "La aplicación 'Barcelona a la butxaca'",
        "isCorrect": false,
        "rationale": "Esta aplicación es un canal de comunicación ciudadana para incidencias, quejas y sugerencias generales sobre la ciudad, no un canal interno para denunciar infracciones normativas."
      },
      {
        "text": "El Codi Ètic i de Conducta",
        "isCorrect": false,
        "rationale": "El Código Ético es el documento que establece las normas de comportamiento, pero no es la herramienta o el mecanismo para comunicar su incumplimiento."
      },
      {
        "text": "La Bústia Ètica i de Bon Govern",
        "isCorrect": true,
        "rationale": "Esta es la denominación del canal específico creado por el Ajuntament de Barcelona para que se puedan reportar malas prácticas de forma segura, en línea con la Directiva de Whistleblowing."
      }
    ],
    "hint": "El nombre de esta herramienta municipal hace referencia tanto a la ética como a la buena administración."
  },
  {
    "guid": "14d61c94-fbdb-42ea-b13c-ea47a1d34d05",
    "subjectId": "T27",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "La obligación de una entidad del sector público de aplicar un conjunto de medidas mínimas de seguridad en sus sistemas de información está regulada principalmente por:",
    "answerOptions": [
      {
        "text": "El Reglamento (UE) eIDAS",
        "isCorrect": false,
        "rationale": "El reglamento eIDAS se enfoca en la identificación electrónica y los servicios de confianza (como la firma electrónica), no en el marco general de seguridad de los sistemas de las AAPP."
      },
      {
        "text": "El Esquema Nacional de Seguridad (ENS)",
        "isCorrect": true,
        "rationale": "El ENS (RD 311/2022) es la normativa clave en España que establece la política de seguridad en la utilización de medios electrónicos y es de obligado cumplimiento para el sector público."
      },
      {
        "text": "La Ley 10/2010 de prevención de blanqueo de capitales",
        "isCorrect": false,
        "rationale": "Esta ley impone obligaciones de control para prevenir delitos financieros, pero no establece el marco general de seguridad técnica para los sistemas de información."
      },
      {
        "text": "El Código Penal (art. 31 bis)",
        "isCorrect": false,
        "rationale": "El Código Penal regula la responsabilidad penal de las personas jurídicas, pero es el ENS el que dicta las medidas técnicas y organizativas de seguridad que deben implantar."
      }
    ],
    "hint": "Esta normativa forma parte del núcleo del Compliance TIC para las Administraciones Públicas en España."
  },
  {
    "guid": "8dff9eaf-61e4-4572-b052-5a646f84809b",
    "subjectId": "T27",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "Un prestador de servicios de confianza cualificado, según el Reglamento (UE) 910/2014 (eIDAS), debe someterse a una auditoría de conformidad por un organismo de evaluación. ¿Con qué periodicidad mínima debe realizarse dicha auditoría?",
    "answerOptions": [
      {
        "text": "Cada 5 años.",
        "isCorrect": false,
        "rationale": "Este período es demasiado largo para garantizar la fiabilidad continua que exigen los servicios de confianza cualificados."
      },
      {
        "text": "Cada 2 años.",
        "isCorrect": true,
        "rationale": "El reglamento eIDAS establece este intervalo máximo para asegurar que los prestadores cualificados mantienen los altos estándares de seguridad y fiabilidad requeridos."
      },
      {
        "text": "Cada año.",
        "isCorrect": false,
        "rationale": "Aunque es una buena práctica, la obligación mínima legal establecida por el reglamento es menos frecuente."
      },
      {
        "text": "Solo cuando lo solicite la autoridad de supervisión.",
        "isCorrect": false,
        "rationale": "La auditoría es un requisito periódico y proactivo, no depende de una solicitud puntual de la autoridad supervisora."
      }
    ],
    "hint": "Esta pregunta, similar a una de exámenes anteriores, evalúa un requisito temporal específico de la normativa eIDAS para los prestadores de mayor nivel."
  },
  {
    "guid": "6e48c018-a48c-4a31-a62d-c48a434c99f8",
    "subjectId": "T27",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "¿Cuál de las siguientes afirmaciones describe mejor el rol y la característica esencial de un Compliance Officer?",
    "answerOptions": [
      {
        "text": "Es un auditor externo contratado anualmente para certificar las cuentas de la empresa.",
        "isCorrect": false,
        "rationale": "El Compliance Officer es una figura interna o con dedicación continua, distinta del auditor financiero externo, y su ámbito es el cumplimiento normativo, no solo las cuentas."
      },
      {
        "text": "Es el máximo responsable de la dirección ejecutiva y toma todas las decisiones estratégicas.",
        "isCorrect": false,
        "rationale": "La Alta Dirección apoya y dota de recursos al Compliance Officer, pero este último es un rol especializado en la supervisión del sistema, no el director ejecutivo de la organización."
      },
      {
        "text": "Es el responsable de diseñar, implantar y supervisar el sistema de Compliance, y debe gozar de independencia y autoridad.",
        "isCorrect": true,
        "rationale": "Esta definición recoge sus funciones clave y las condiciones de autonomía y respaldo necesarias para que su labor sea efectiva dentro de la organización."
      },
      {
        "text": "Es un representante de los trabajadores encargado exclusivamente de recibir las denuncias del personal.",
        "isCorrect": false,
        "rationale": "Aunque puede estar implicado en la gestión del canal de denuncias, sus responsabilidades abarcan todo el sistema de gestión de Compliance, no solo ese elemento."
      }
    ],
    "hint": "Piensa en la figura que centraliza la supervisión del sistema de cumplimiento y qué condiciones necesita para actuar con eficacia."
  },
  {
    "guid": "cdcc3a3d-038f-479e-89b7-26f601052ac6",
    "subjectId": "T27",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "Según el material de estudio, ¿cuál fue la principal diferencia entre el temario de OPOS 23 (Tema 39) y el de OPOS 24 (Tema 27) en relación con el Compliance?",
    "answerOptions": [
      {
        "text": "El temario de OPOS 23 no incluía la normativa sobre protección de datos (RGPD).",
        "isCorrect": false,
        "rationale": "La protección de datos es un pilar fundamental del Compliance y estaba presente en ambos temarios; la diferencia radicaba en otros aspectos."
      },
      {
        "text": "El temario de OPOS 24 introdujo por primera vez los estándares ISO como materia de examen.",
        "isCorrect": false,
        "rationale": "Los estándares ISO son referenciales en Compliance y formaban parte del contexto de ambos temarios; el cambio fue sobre la amplitud de los procesos cubiertos."
      },
      {
        "text": "El temario de OPOS 23 era más amplio, ya que incluía preauditorías internas y auditorías de fabricantes/proveedores.",
        "isCorrect": true,
        "rationale": "El texto especifica que el temario anterior añadía una visión de control previo y externo que no se detalla en el temario más reciente, haciéndolo más extenso."
      },
      {
        "text": "El temario de OPOS 24 se centra exclusivamente en el Compliance Penal, eliminando el resto de tipos.",
        "isCorrect": false,
        "rationale": "El temario de OPOS 24 es general sobre la Gestión del Compliance, abarcando todos sus tipos, no solo el penal."
      }
    ],
    "hint": "Revisa la sección de correspondencia entre los temarios de diferentes oposiciones que se encuentra al inicio del documento."
  },
  {
    "guid": "e248a779-3168-4456-a6b6-6bb05282a761",
    "subjectId": "T27",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "Una herramienta de software que integra en una única plataforma la gestión de riesgos, el seguimiento de controles y la planificación de auditorías se conoce como:",
    "answerOptions": [
      {
        "text": "SIEM (Security Information and Event Management)",
        "isCorrect": false,
        "rationale": "Las herramientas SIEM son específicas de ciberseguridad para la gestión de eventos y logs, mientras que la pregunta se refiere a una gestión más amplia de gobernanza."
      },
      {
        "text": "EDR (Endpoint Detection & Response)",
        "isCorrect": false,
        "rationale": "Las soluciones EDR se centran en la seguridad de los dispositivos finales (ordenadores, servidores) para detectar y responder a amenazas, no en la gestión integral del Compliance."
      },
      {
        "text": "Software GRC (Governança, Riscos i Compliment)",
        "isCorrect": true,
        "rationale": "Estas plataformas están diseñadas específicamente para unificar las tres áreas mencionadas (Gobierno, Riesgo y Cumplimiento) y facilitar una visión integrada."
      },
      {
        "text": "DRP (Disaster Recovery Plan)",
        "isCorrect": false,
        "rationale": "Un DRP es un plan o conjunto de procedimientos para recuperar la operativa tras un desastre, no una herramienta de software para la gestión continua de riesgos y controles."
      }
    ],
    "hint": "El nombre de este tipo de software se corresponde con las iniciales de las tres áreas que gestiona."
  },
  {
    "guid": "9b6b8e6e-4a2a-4c7b-9f3c-2a9b0f8a1c21",
    "subjectId": "T62",
    "difficulty": 1,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Què s'entén per sistema de compliance en una administració pública com l'Ajuntament de Barcelona?",
    "answerOptions": [
      {
        "text": "Un conjunt de mesures per assegurar el compliment normatiu, ètic i de bones pràctiques",
        "isCorrect": true,
        "rationale": "El compliance integra polítiques, procediments i controls per garantir el compliment de la legalitat i els valors ètics."
      },
      {
        "text": "Un sistema exclusiu de control pressupostari",
        "isCorrect": false,
        "rationale": "El control pressupostari és només una part de la gestió pública, però no defineix el compliance."
      },
      {
        "text": "Una eina informàtica per a la gestió de projectes TIC",
        "isCorrect": false,
        "rationale": "El compliance no és una eina TIC concreta, sinó un marc organitzatiu i normatiu."
      },
      {
        "text": "Un procediment sancionador intern",
        "isCorrect": false,
        "rationale": "El procediment sancionador pot derivar del compliance, però no el defineix."
      }
    ]
  },
  {
    "guid": "2f1c9a0e-8c1e-4c0e-8a7e-1b6c2d7e4f90",
    "subjectId": "T62",
    "difficulty": 2,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Quin és un dels objectius principals del compliance en l'àmbit TIC municipal?",
    "answerOptions": [
      {
        "text": "Reduir els riscos legals i operatius associats a l'ús de les tecnologies",
        "isCorrect": true,
        "rationale": "El compliance TIC busca minimitzar riscos legals, de seguretat i reputacionals."
      },
      {
        "text": "Incrementar la despesa en infraestructures tecnològiques",
        "isCorrect": false,
        "rationale": "L'augment de despesa no és un objectiu del compliance."
      },
      {
        "text": "Externalitzar tots els serveis informàtics",
        "isCorrect": false,
        "rationale": "El compliance no obliga a l'externalització dels serveis TIC."
      },
      {
        "text": "Eliminar els controls interns",
        "isCorrect": false,
        "rationale": "El compliance reforça els controls interns, no els elimina."
      }
    ]
  },
  {
    "guid": "7a3f4b2d-1c9e-4e6a-9d4a-6e0c8b2a5d33",
    "subjectId": "T62",
    "difficulty": 2,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Quin rol acostuma a tenir l'oficial de compliance dins d'una organització pública?",
    "answerOptions": [
      {
        "text": "Supervisar i impulsar el compliment normatiu i ètic",
        "isCorrect": true,
        "rationale": "L'oficial de compliance vetlla pel compliment de la normativa i assessora l'organització."
      },
      {
        "text": "Autoritzar totes les contractacions públiques",
        "isCorrect": false,
        "rationale": "La contractació té òrgans específics i no depèn exclusivament del compliance."
      },
      {
        "text": "Gestionar directament els sistemes informàtics",
        "isCorrect": false,
        "rationale": "La gestió tècnica correspon als serveis TIC, no al compliance."
      },
      {
        "text": "Exercir funcions polítiques",
        "isCorrect": false,
        "rationale": "El compliance té un rol tècnic i de control, no polític."
      }
    ]
  },
  {
    "guid": "c4e1b2a9-5d7f-4a1e-8c6b-9a2d3e7f0b11",
    "subjectId": "T62",
    "difficulty": 3,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Quina normativa és clau en el compliance TIC pel que fa a la protecció de dades personals?",
    "answerOptions": [
      {
        "text": "Reglament General de Protecció de Dades (RGPD)",
        "isCorrect": true,
        "rationale": "El RGPD estableix les obligacions en matèria de protecció de dades a la UE."
      },
      {
        "text": "Llei de pressupostos generals",
        "isCorrect": false,
        "rationale": "La llei de pressupostos no regula la protecció de dades personals."
      },
      {
        "text": "Estatut dels Treballadors",
        "isCorrect": false,
        "rationale": "L'estatut regula relacions laborals, no específicament dades personals."
      },
      {
        "text": "Codi Civil",
        "isCorrect": false,
        "rationale": "El Codi Civil no és la norma principal en protecció de dades."
      }
    ]
  },
  {
    "guid": "e8b6a0d2-3c4f-4b7e-9a6d-1f2c5e9b7a44",
    "subjectId": "T62",
    "difficulty": 3,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Quin element és essencial en un model de compliance eficaç?",
    "answerOptions": [
      {
        "text": "Avaluació i gestió dels riscos",
        "isCorrect": true,
        "rationale": "Identificar i gestionar riscos és clau per prevenir incompliments."
      },
      {
        "text": "Absència de documentació",
        "isCorrect": false,
        "rationale": "La documentació és necessària per evidenciar el compliance."
      },
      {
        "text": "Dependència exclusiva de proveïdors externs",
        "isCorrect": false,
        "rationale": "El compliance ha d'estar integrat internament."
      },
      {
        "text": "Aplicació només reactiva",
        "isCorrect": false,
        "rationale": "El compliance ha de ser preventiu i proactiu."
      }
    ]
  },
  {
    "guid": "1d9f7a6b-2e4c-4f8a-9b3d-0c6e5a2f8b77",
    "subjectId": "T62",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Com contribueix el compliance a la transparència en la gestió TIC municipal?",
    "answerOptions": [
      {
        "text": "Establint procediments clars i traçables",
        "isCorrect": true,
        "rationale": "La traçabilitat i procediments clars milloren la transparència."
      },
      {
        "text": "Limitant l'accés a la informació pública",
        "isCorrect": false,
        "rationale": "El compliance promou l'accés adequat, no la limitació injustificada."
      },
      {
        "text": "Reduint els mecanismes de control",
        "isCorrect": false,
        "rationale": "Els mecanismes de control són essencials per a la transparència."
      },
      {
        "text": "Centralitzant totes les decisions en una sola persona",
        "isCorrect": false,
        "rationale": "La concentració de poder va en contra de les bones pràctiques."
      }
    ]
  }
,
  {
    "guid": "a3f9d2b1-7c4e-4b6a-9e21-5d8c0f6a1b90",
    "subjectId": "T62",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Quina relació existeix entre el sistema de compliance i el model de control intern en una administració pública?",
    "answerOptions": [
      {
        "text": "El compliance complementa i reforça el sistema de control intern",
        "isCorrect": true,
        "rationale": "El compliance actua com a capa preventiva i transversal que enforteix el control intern."
      },
      {
        "text": "El compliance substitueix completament el control intern",
        "isCorrect": false,
        "rationale": "El control intern continua sent necessari i no és substituït pel compliance."
      },
      {
        "text": "No existeix cap relació entre ambdós conceptes",
        "isCorrect": false,
        "rationale": "Ambdós comparteixen objectius de prevenció i supervisió."
      },
      {
        "text": "El control intern només s'aplica a l'àmbit financer",
        "isCorrect": false,
        "rationale": "El control intern té un abast més ampli que el financer."
      }
    ]
  },
  {
    "guid": "f6c1e8a9-2d5b-4f3c-8a7e-91b0d4c2e633",
    "subjectId": "T62",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Quin és un risc específic de compliance associat a la contractació de serveis TIC al sector públic?",
    "answerOptions": [
      {
        "text": "Conflictes d'interès i incompliment de la normativa de contractació",
        "isCorrect": true,
        "rationale": "La contractació TIC és especialment sensible a riscos de conflicte d'interès i legalitat."
      },
      {
        "text": "L'ús de programari de codi obert",
        "isCorrect": false,
        "rationale": "El codi obert no és un risc de compliance per si mateix."
      },
      {
        "text": "La formació contínua del personal",
        "isCorrect": false,
        "rationale": "La formació redueix riscos, no els incrementa."
      },
      {
        "text": "La documentació dels procediments",
        "isCorrect": false,
        "rationale": "La documentació és una bona pràctica de compliance."
      }
    ]
  },
  {
    "guid": "0b7d6f9e-1a3c-4e8b-9d2a-7c4f5e6a8812",
    "subjectId": "T62",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "En un model de compliance TIC avançat, quin paper té l'auditoria interna?",
    "answerOptions": [
      {
        "text": "Verificar l'eficàcia dels controls i detectar possibles incompliments",
        "isCorrect": true,
        "rationale": "L'auditoria interna avalua l'eficàcia del sistema de compliance."
      },
      {
        "text": "Assumir la gestió operativa dels sistemes TIC",
        "isCorrect": false,
        "rationale": "L'auditoria no té funcions de gestió operativa."
      },
      {
        "text": "Definir les polítiques públiques municipals",
        "isCorrect": false,
        "rationale": "La definició de polítiques correspon als òrgans de govern."
      },
      {
        "text": "Externalitzar totes les funcions de control",
        "isCorrect": false,
        "rationale": "El control intern no s'ha d'externalitzar completament."
      }
    ]
  },
  {
    "guid": "9e2c4a7b-5d1f-4a8e-bc6d-3f0a1e9d4420",
    "subjectId": "T62",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Per què és clau la cultura organitzativa en l'èxit d'un sistema de compliance?",
    "answerOptions": [
      {
        "text": "Perquè afavoreix l'adopció real i transversal de les normes i valors",
        "isCorrect": true,
        "rationale": "Sense una cultura ètica compartida, el compliance és només formal."
      },
      {
        "text": "Perquè elimina la necessitat de controls",
        "isCorrect": false,
        "rationale": "Els controls continuen sent necessaris."
      },
      {
        "text": "Perquè permet reduir la normativa aplicable",
        "isCorrect": false,
        "rationale": "La cultura no redueix les obligacions legals."
      },
      {
        "text": "Perquè substitueix la formació del personal",
        "isCorrect": false,
        "rationale": "La cultura es reforça, entre d'altres, amb formació."
      }
    ]
  },
  {
    "guid": "c8a5f3d2-4b7e-4f9a-9d61-0e3b7a6c5f19",
    "subjectId": "T62",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Quin és l'impacte del compliance en la responsabilitat penal de l'administració i els seus directius?",
    "answerOptions": [
      {
        "text": "Pot actuar com a element atenuant o preventiu davant responsabilitats",
        "isCorrect": true,
        "rationale": "Un sistema de compliance eficaç pot reduir o evitar responsabilitats."
      },
      {
        "text": "Elimina automàticament qualsevol responsabilitat penal",
        "isCorrect": false,
        "rationale": "El compliance no garanteix la inexistència de responsabilitats."
      },
      {
        "text": "Només té impacte en l'àmbit disciplinari",
        "isCorrect": false,
        "rationale": "El seu impacte pot ser també penal i administratiu."
      },
      {
        "text": "No té cap impacte jurídic",
        "isCorrect": false,
        "rationale": "El compliance té rellevància jurídica reconeguda."
      }
    ]
  },
  {
    "guid": "a1f4c9d2-3e7b-4c8a-9d10-2f6e5b7a1001",
    "subjectId": "T62",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Quina llei regula a l'Estat espanyol la protecció de les persones que informen sobre infraccions normatives en el sector públic?",
    "answerOptions": [
      {
        "text": "Llei 2/2023, reguladora de la protecció de les persones que informin sobre infraccions normatives",
        "isCorrect": true,
        "rationale": "És la norma que transposa la Directiva (UE) 2019/1937 sobre whistleblowing."
      },
      {
        "text": "Llei 19/2014 de transparència",
        "isCorrect": false,
        "rationale": "Aquesta llei regula la transparència, no la protecció d'informants."
      },
      {
        "text": "Llei 40/2015 del règim jurídic del sector públic",
        "isCorrect": false,
        "rationale": "Regula l'organització administrativa, no els canals d'informació."
      },
      {
        "text": "Estatut Bàsic de l'Empleat Públic",
        "isCorrect": false,
        "rationale": "No regula específicament la protecció d'informants."
      }
    ]
  },
  {
    "guid": "b2e9d1c4-5f6a-4b7e-8c21-9a0d3f6e1002",
    "subjectId": "T62",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Quina normativa estableix el marc general de la protecció de dades personals aplicable a les administracions públiques?",
    "answerOptions": [
      {
        "text": "Reglament (UE) 2016/679, Reglament General de Protecció de Dades",
        "isCorrect": true,
        "rationale": "El RGPD és directament aplicable a totes les administracions públiques."
      },
      {
        "text": "Llei 39/2015 del procediment administratiu comú",
        "isCorrect": false,
        "rationale": "No és la norma principal en protecció de dades."
      },
      {
        "text": "Llei de transparència catalana",
        "isCorrect": false,
        "rationale": "Complementa, però no substitueix el RGPD."
      },
      {
        "text": "Codi Penal",
        "isCorrect": false,
        "rationale": "No regula de forma general la protecció de dades."
      }
    ]
  },
  {
    "guid": "c3a7f2e9-8d1b-4f6c-9a30-e5d7b2c41003",
    "subjectId": "T62",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Quina llei regula el règim jurídic del sector públic i és clau per al compliance institucional?",
    "answerOptions": [
      {
        "text": "Llei 40/2015, de règim jurídic del sector públic",
        "isCorrect": true,
        "rationale": "Estableix els principis de funcionament, responsabilitat i control del sector públic."
      },
      {
        "text": "Llei 9/2017 de contractes del sector públic",
        "isCorrect": false,
        "rationale": "Regula específicament la contractació."
      },
      {
        "text": "Llei 2/2023",
        "isCorrect": false,
        "rationale": "Regula la protecció d'informants."
      },
      {
        "text": "Llei orgànica 3/2018",
        "isCorrect": false,
        "rationale": "És complementària al RGPD."
      }
    ]
  },
  {
    "guid": "d4b6c8e1-9f5a-4d7c-8b20-1e3a9f6d1004",
    "subjectId": "T62",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Quina norma regula la contractació pública i és especialment rellevant en el compliance TIC?",
    "answerOptions": [
      {
        "text": "Llei 9/2017, de contractes del sector públic",
        "isCorrect": true,
        "rationale": "És la norma bàsica en contractació pública i prevenció de riscos de corrupció."
      },
      {
        "text": "Llei 39/2015",
        "isCorrect": false,
        "rationale": "Regula el procediment administratiu."
      },
      {
        "text": "RGPD",
        "isCorrect": false,
        "rationale": "No regula contractació pública."
      },
      {
        "text": "Llei de finances locals",
        "isCorrect": false,
        "rationale": "No és la norma principal en contractació TIC."
      }
    ]
  },
  {
    "guid": "e5f1d9b3-6a4c-4e8f-9d21-0c7a5b6e1005",
    "subjectId": "T62",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Quina norma regula el procediment administratiu comú i incideix en el compliance procedimental?",
    "answerOptions": [
      {
        "text": "Llei 39/2015, del procediment administratiu comú de les administracions públiques",
        "isCorrect": true,
        "rationale": "Estableix garanties procedimentals clau per al compliance."
      },
      {
        "text": "Llei 40/2015",
        "isCorrect": false,
        "rationale": "Regula l'organització i funcionament del sector públic."
      },
      {
        "text": "Llei 2/2023",
        "isCorrect": false,
        "rationale": "Regula canals d'informació."
      },
      {
        "text": "Codi Penal",
        "isCorrect": false,
        "rationale": "No regula procediment administratiu."
      }
    ]
  },
  {
    "guid": "f6c7a4d9-1e2b-4a8c-9f30-6b5e7d2a1006",
    "subjectId": "T62",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Quina llei catalana és clau en matèria de transparència i bon govern per al compliance municipal?",
    "answerOptions": [
      {
        "text": "Llei 19/2014, de transparència, accés a la informació pública i bon govern",
        "isCorrect": true,
        "rationale": "És la norma de referència a Catalunya en transparència i bon govern."
      },
      {
        "text": "Llei 2/2023",
        "isCorrect": false,
        "rationale": "És d'àmbit estatal."
      },
      {
        "text": "Llei 9/2017",
        "isCorrect": false,
        "rationale": "Regula contractació."
      },
      {
        "text": "LOPDGDD",
        "isCorrect": false,
        "rationale": "Regula protecció de dades."
      }
    ]
  }
]
