[
  {
    "guid": "a0bf9b39-bf00-4e86-b351-4a3776deb204",
    "subjectId": "T28",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Según el reglamento eIDAS2, ¿cuál es la principal novedad que se introduce para los ciudadanos y empresas de la Unión Europea?",
    "answerOptions": [
      {
        "text": "La obligatoriedad de usar exclusivamente certificados digitales para todas las transacciones.",
        "isCorrect": false,
        "rationale": "El reglamento promueve los certificados pero no los hace exclusivamente obligatorios para todo; su principal novedad es otra."
      },
      {
        "text": "La creación de la Carpeta d’identitat digital europea (EUDI Wallet).",
        "isCorrect": true,
        "rationale": "Esta es la innovación central de eIDAS2, una cartera digital emitida por los Estados miembros para almacenar datos identificativos y credenciales."
      },
      {
        "text": "La eliminación del Esquema Nacional de Seguretat (ENS) para simplificar la normativa.",
        "isCorrect": false,
        "rationale": "eIDAS2 es una normativa europea que no elimina las normativas de seguridad nacionales como el ENS, sino que convive con ellas."
      },
      {
        "text": "La introducción de un nuevo servicio de confianza llamado \"libros mayores electrónicos\" como único método de archivo.",
        "isCorrect": false,
        "rationale": "Aunque los libros mayores electrónicos son un nuevo servicio de confianza introducido, la novedad central y más destacada del reglamento es la EUDI Wallet."
      }
    ],
    "hint": "Piensa en la herramienta principal que eIDAS2 proporcionará a los ciudadanos para gestionar su identidad digital de forma centralizada."
  },
  {
    "guid": "ac0fa3eb-8b06-46a2-95a9-fdc1823be10f",
    "subjectId": "T28",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Una organización necesita un sistema de control de acceso que tome decisiones dinámicas basadas en múltiples atributos, como la ubicación del usuario, la hora del día y el tipo de dispositivo. ¿Qué modelo de autorización sería el más adecuado?",
    "answerOptions": [
      {
        "text": "RBAC (Role-Based Access Control)",
        "isCorrect": false,
        "rationale": "RBAC se basa en roles predefinidos y es menos flexible para condiciones dinámicas y contextuales."
      },
      {
        "text": "ABAC (Attribute-Based Access Control)",
        "isCorrect": true,
        "rationale": "Este modelo está diseñado específicamente para tomar decisiones granulares basadas en un conjunto de atributos del sujeto, el recurso y el entorno."
      },
      {
        "text": "DAC (Discretionary Access Control)",
        "isCorrect": false,
        "rationale": "En el modelo DAC, el propietario de un recurso es quien determina los permisos, lo que no se ajusta a la necesidad de políticas centralizadas y dinámicas."
      },
      {
        "text": "SSO (Single Sign-On)",
        "isCorrect": false,
        "rationale": "SSO es un mecanismo de autenticación para acceder a múltiples aplicaciones con un solo login, no un modelo para definir qué puede hacer un usuario una vez autenticado."
      }
    ],
    "hint": "Considera qué modelo de control de acceso se centra en las características (atributos) del sujeto y el contexto en lugar de en roles estáticos."
  },
  {
    "guid": "af21cccf-9404-4681-a0bb-c19bfbc55986",
    "subjectId": "T28",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "¿Cuál de las siguientes afirmaciones describe correctamente la relación entre OAuth 2.0 y OpenID Connect (OIDC)?",
    "answerOptions": [
      {
        "text": "OAuth 2.0 es una capa de identidad que funciona sobre OpenID Connect para gestionar la autorización.",
        "isCorrect": false,
        "rationale": "Esta afirmación invierte la relación; uno de los protocolos se construye sobre el otro, no al revés."
      },
      {
        "text": "Ambos protocolos son idénticos y utilizan XML para el intercambio de información.",
        "isCorrect": false,
        "rationale": "Aunque están relacionados, no son idénticos y se caracterizan por usar un formato de datos diferente al XML, más ligero y moderno."
      },
      {
        "text": "OpenID Connect es una capa de identidad construida sobre OAuth 2.0, que añade la funcionalidad de autenticación.",
        "isCorrect": true,
        "rationale": "OIDC extiende OAuth 2.0 (un framework de autorización) para proporcionar información sobre la identidad del usuario, cubriendo así la autenticación."
      },
      {
        "text": "OpenID Connect es un protocolo más antiguo que fue reemplazado por SAML 2.0 para aplicaciones móviles.",
        "isCorrect": false,
        "rationale": "OIDC es un estándar moderno, especialmente adecuado para aplicaciones móviles y SPA, mientras que SAML es más tradicional en entornos corporativos."
      }
    ],
    "hint": "Recuerda que uno de estos protocolos se enfoca principalmente en la autorización (qué puede hacer una aplicación en tu nombre) y el otro añade la pieza de quién eres tú."
  },
  {
    "guid": "d1e3378f-f60f-4525-94a0-f976fc43f351",
    "subjectId": "T28",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "En la arquitectura de autenticación del Ajuntament de Barcelona, ¿qué función cumple el token JWT emitido por el MCA (Mòdul d’Arquitectura d’Autenticació)?",
    "answerOptions": [
      {
        "text": "Es la credencial inicial que el ciudadano utiliza para identificarse en un IdP externo como Cl@ve.",
        "isCorrect": false,
        "rationale": "El token JWT se genera después de la autenticación externa, no antes."
      },
      {
        "text": "Actúa como un certificado digital almacenado en el navegador del usuario para firmar documentos.",
        "isCorrect": false,
        "rationale": "Un token JWT es un medio para transmitir claims de identidad de forma segura, pero no es un certificado digital para firma electrónica."
      },
      {
        "text": "Funciona como el \"pasaporte digital\" interno que permite al ciudadano acceder a diferentes aplicaciones municipales (SSO) sin volver a autenticarse.",
        "isCorrect": true,
        "rationale": "Este token es la clave de acceso que, una vez emitido, se reutiliza para acceder a múltiples servicios internos, cumpliendo una función de SSO."
      },
      {
        "text": "Sirve únicamente para registrar la actividad del usuario con fines de auditoría, sin gestionar el acceso.",
        "isCorrect": false,
        "rationale": "Aunque puede usarse para auditoría, su función principal es gestionar la sesión y el acceso a los recursos de forma segura."
      }
    ],
    "hint": "Piensa en cómo un sistema centralizado permite que un usuario navegue entre diferentes servicios relacionados sin tener que iniciar sesión repetidamente."
  },
  {
    "guid": "71f675ee-f51b-47d4-a8ae-fa485ce670b9",
    "subjectId": "T28",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "¿Cuál es una diferencia clave entre SAML 2.0 y OpenID Connect en cuanto al formato de los datos que intercambian?",
    "answerOptions": [
      {
        "text": "SAML utiliza JSON, mientras que OpenID Connect se basa en XML.",
        "isCorrect": false,
        "rationale": "Esta opción invierte los formatos de datos asociados a cada protocolo."
      },
      {
        "text": "Ambos protocolos utilizan exclusivamente tokens en formato binario para mayor seguridad.",
        "isCorrect": false,
        "rationale": "Ninguno de los dos se basa principalmente en formatos binarios; utilizan lenguajes de marcado de texto."
      },
      {
        "text": "SAML se basa en aserciones XML, mientras que OpenID Connect utiliza tokens en formato JSON/JWT.",
        "isCorrect": true,
        "rationale": "Esta es la distinción fundamental; SAML es un estándar más antiguo basado en XML, mientras que OIDC y OAuth 2.0 están diseñados para ser más ligeros usando JSON."
      },
      {
        "text": "SAML no tiene un formato estandarizado, depende de la implementación del proveedor.",
        "isCorrect": false,
        "rationale": "SAML es un estándar abierto y bien definido, cuyo formato se basa estrictamente en XML."
      }
    ],
    "hint": "Recuerda qué tecnología es más tradicional en entornos corporativos y cuál está más optimizada para APIs REST y aplicaciones móviles."
  },
  {
    "guid": "52e37192-a6c2-48be-99d2-6b80178d871d",
    "subjectId": "T28",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "La gestión del ciclo de vida de las identidades incluye tres fases principales. ¿Qué acción corresponde a la fase de \"Modificació\"?",
    "answerOptions": [
      {
        "text": "Crear una nueva cuenta de usuario cuando un empleado se incorpora a la empresa.",
        "isCorrect": false,
        "rationale": "Esta acción pertenece a la fase inicial del ciclo de vida de una identidad."
      },
      {
        "text": "Revocar todos los accesos de un empleado que se ha jubilado.",
        "isCorrect": false,
        "rationale": "Esta acción corresponde a la fase final del ciclo de vida."
      },
      {
        "text": "Asignar nuevos permisos a un usuario debido a un cambio de rol en la organización.",
        "isCorrect": true,
        "rationale": "Un cambio en los atributos, roles o permisos de una identidad existente es una modificación."
      },
      {
        "text": "Realizar una auditoría semestral de todas las cuentas activas.",
        "isCorrect": false,
        "rationale": "La auditoría es un proceso de seguimiento y control, no una fase del ciclo de vida de una identidad individual."
      }
    ],
    "hint": "Esta fase se ocupa de los cambios que ocurren mientras la identidad está activa dentro del sistema."
  },
  {
    "guid": "68564c0e-2ec5-486c-a027-7a00cf289827",
    "subjectId": "T28",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "¿Qué concepto de seguridad se describe con la filosofía \"nunca confiar, siempre verificar\", donde la identidad es el núcleo del perímetro de seguridad?",
    "answerOptions": [
      {
        "text": "Multi-Factor Authentication (MFA)",
        "isCorrect": false,
        "rationale": "MFA es una técnica específica para fortalecer la autenticación, pero no define la estrategia de seguridad completa de no confiar por defecto."
      },
      {
        "text": "Identity Federation",
        "isCorrect": false,
        "rationale": "La federación se basa en establecer confianza entre diferentes dominios, lo cual es casi lo opuesto a la idea de no confiar por defecto."
      },
      {
        "text": "Zero Trust",
        "isCorrect": true,
        "rationale": "Este modelo de seguridad se basa en la premisa de que no se debe confiar en ninguna solicitud por defecto, independientemente de su origen, y siempre se debe verificar."
      },
      {
        "text": "Customer IAM (CIAM)",
        "isCorrect": false,
        "rationale": "CIAM es un tipo de gestión de identidades enfocado en clientes, no un modelo o filosofía de seguridad subyacente."
      }
    ],
    "hint": "El nombre de este modelo refleja directamente su principio fundamental de no asumir confianza."
  },
  {
    "guid": "599c1423-35bc-40a9-a66d-12e5172995f3",
    "subjectId": "T28",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Según la normativa europea eIDAS2, ¿qué plazo tienen los Estados miembros para poner a disposición de los ciudadanos al menos una EUDI Wallet desde la entrada en vigor del reglamento el 20 de mayo de 2024?",
    "answerOptions": [
      {
        "text": "12 meses, por lo que deben estar disponibles a mediados de 2025.",
        "isCorrect": false,
        "rationale": "El plazo establecido por el reglamento es más largo para permitir el desarrollo y la implementación adecuados."
      },
      {
        "text": "No hay un plazo fijo, cada Estado miembro decide cuándo implementarla.",
        "isCorrect": false,
        "rationale": "El reglamento establece un plazo vinculante para garantizar la interoperabilidad en toda la UE."
      },
      {
        "text": "Inmediatamente, desde el 20 de mayo de 2024.",
        "isCorrect": false,
        "rationale": "La entrada en vigor marca el inicio del periodo de implementación, no la fecha de disponibilidad."
      },
      {
        "text": "24 meses, por lo que deben estar operativas hacia mediados de 2026.",
        "isCorrect": true,
        "rationale": "El texto especifica claramente un periodo de dos años para que los Estados miembros ofrezcan las carteras digitales."
      }
    ],
    "hint": "El material de estudio indica un plazo de dos años para esta implementación clave."
  },
  {
    "guid": "47bf5b98-1578-47af-b0a6-afdc10fe1692",
    "subjectId": "T28",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Un usuario se autentica una sola vez y puede acceder a múltiples aplicaciones como Microsoft 365 y Salesforce sin volver a introducir sus credenciales. ¿Cómo se llama este mecanismo?",
    "answerOptions": [
      {
        "text": "Autenticación Multifactor (MFA)",
        "isCorrect": false,
        "rationale": "MFA se refiere a usar varios factores para verificar la identidad en un único inicio de sesión, no a la capacidad de acceder a múltiples sistemas después."
      },
      {
        "text": "Single Sign-On (SSO)",
        "isCorrect": true,
        "rationale": "Este término describe precisamente la capacidad de un usuario de iniciar sesión una vez y obtener acceso a múltiples sistemas sin volver a autenticarse."
      },
      {
        "text": "Federación de identidades",
        "isCorrect": false,
        "rationale": "La federación es el acuerdo de confianza entre dominios que permite el SSO, pero SSO es el nombre del mecanismo que experimenta el usuario."
      },
      {
        "text": "Role-Based Access Control (RBAC)",
        "isCorrect": false,
        "rationale": "RBAC es un modelo de autorización que define qué puede hacer un usuario, no cómo se autentica para acceder a diferentes aplicaciones."
      }
    ],
    "hint": "Piensa en el término que describe la experiencia del usuario de \"un solo inicio de sesión\"."
  },
  {
    "guid": "7509538a-dd61-4a70-a1d6-67b949803561",
    "subjectId": "T28",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Utilizar una contraseña junto con un código de un solo uso (OTP) enviado a una aplicación móvil es un ejemplo de:",
    "answerOptions": [
      {
        "text": "Autenticación biométrica",
        "isCorrect": false,
        "rationale": "La biometría se basa en características físicas o de comportamiento del usuario (factor \"ser\"), no en algo que conoce y algo que posee."
      },
      {
        "text": "Autenticación de factor único basado en posesión",
        "isCorrect": false,
        "rationale": "Esta opción solo describe una parte del proceso (el OTP), pero ignora la otra (la contraseña)."
      },
      {
        "text": "Autenticación Multifactor (MFA)",
        "isCorrect": true,
        "rationale": "Este proceso combina dos factores diferentes: algo que el usuario conoce (contraseña) y algo que posee (el dispositivo con la app de OTP)."
      },
      {
        "text": "Autorización basada en atributos (ABAC)",
        "isCorrect": false,
        "rationale": "ABAC es un modelo para decidir el acceso a los recursos después de la autenticación, no el proceso de verificar la identidad en sí."
      }
    ],
    "hint": "Considera cómo se denomina el uso combinado de diferentes tipos de factores para verificar la identidad."
  },
  {
    "guid": "681db1f5-0a40-4dac-aa6f-8ad160a98916",
    "subjectId": "T28",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "¿Cuál es el objetivo principal de la Gestión de Identidades y Accesos (IAM)?",
    "answerOptions": [
      {
        "text": "Asegurar que la persona correcta tenga el acceso correcto a los recursos correctos en el momento adecuado.",
        "isCorrect": true,
        "rationale": "Esta opción encapsula el propósito fundamental de la IAM, que equilibra la seguridad, la eficiencia y la experiencia del usuario."
      },
      {
        "text": "Implementar exclusivamente la autenticación multifactor (MFA) para todos los usuarios de la organización.",
        "isCorrect": false,
        "rationale": "Aunque la MFA es un componente crucial de una estrategia de IAM, no representa el objetivo global, que es más amplio."
      },
      {
        "text": "Centralizar el almacenamiento de contraseñas de los usuarios para mejorar la eficiencia operativa.",
        "isCorrect": false,
        "rationale": "La gestión de credenciales es una parte de la IAM, pero el objetivo principal abarca la identidad, la autenticación y la autorización en su conjunto."
      },
      {
        "text": "Monitorizar la actividad de los usuarios para cumplir con la normativa de protección de datos como el RGPD.",
        "isCorrect": false,
        "rationale": "El cumplimiento normativo es un beneficio y un requisito de la IAM, pero el objetivo principal se centra en la gestión del acceso."
      }
    ],
    "hint": "Piensa en la frase que resume la finalidad de este conjunto de procesos, equilibrando seguridad y acceso."
  },
  {
    "guid": "4ac1ff2e-4aaf-4aa1-aa19-5897750aee3f",
    "subjectId": "T28",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Un usuario inicia sesión con su contraseña y, a continuación, debe aprobar la solicitud en una aplicación de su teléfono móvil. ¿Qué tipo de factor de autenticación representa la aplicación móvil?",
    "answerOptions": [
      {
        "text": "Un factor de conocimiento.",
        "isCorrect": false,
        "rationale": "El factor de conocimiento es algo que el usuario sabe, como una contraseña o un PIN, no un dispositivo que posee."
      },
      {
        "text": "Un factor de posesión.",
        "isCorrect": true,
        "rationale": "El teléfono móvil con la aplicación de autenticación es algo que el usuario posee físicamente para poder completar el inicio de sesión."
      },
      {
        "text": "Un factor de inherencia (biométrico).",
        "isCorrect": false,
        "rationale": "Este factor se refiere a una característica física o de comportamiento del usuario, como una huella dactilar o el reconocimiento facial."
      },
      {
        "text": "Un factor de autorización.",
        "isCorrect": false,
        "rationale": "La autorización define lo que un usuario puede hacer después de ser autenticado, no es un método para verificar la identidad."
      }
    ],
    "hint": "Considera a qué categoría pertenece un objeto físico o digital que el usuario debe tener consigo para autenticarse."
  },
  {
    "guid": "6cd2ab99-d009-432c-a240-4f022b02b8d7",
    "subjectId": "T28",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "¿Qué modelo de control de acceso es más adecuado para implementar políticas de autorización granulares y dinámicas que dependen del contexto, como la ubicación del usuario o la hora del día?",
    "answerOptions": [
      {
        "text": "RBAC (Role-Based Access Control)",
        "isCorrect": false,
        "rationale": "RBAC se basa en roles predefinidos, lo que lo hace menos flexible para condiciones que cambian dinámicamente."
      },
      {
        "text": "ABAC (Attribute-Based Access Control)",
        "isCorrect": true,
        "rationale": "Este modelo está diseñado para tomar decisiones basadas en atributos del sujeto, el recurso y el entorno, permitiendo políticas muy detalladas y contextuales."
      },
      {
        "text": "DAC (Discretionary Access Control)",
        "isCorrect": false,
        "rationale": "En el modelo DAC, el propietario de un recurso decide quién puede acceder a él, pero no se basa inherentemente en atributos contextuales dinámicos."
      },
      {
        "text": "MAC (Mandatory Access Control)",
        "isCorrect": false,
        "rationale": "MAC es un modelo rígido basado en niveles de seguridad y etiquetas, comúnmente usado en entornos militares, y no es flexible para el contexto dinámico."
      }
    ],
    "hint": "Busca el modelo que utiliza una combinación de características del usuario, el recurso y el entorno para tomar decisiones de acceso."
  },
  {
    "guid": "13205a91-4cd3-4739-b8ca-1079dfc95eaf",
    "subjectId": "T28",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "En el contexto de SSO, ¿cuál es la principal diferencia de formato entre las aserciones de SAML 2.0 y los tokens de OpenID Connect?",
    "answerOptions": [
      {
        "text": "SAML utiliza JSON, mientras que OpenID Connect utiliza XML.",
        "isCorrect": false,
        "rationale": "Esta afirmación invierte los formatos; SAML es conocido por su uso de XML."
      },
      {
        "text": "SAML utiliza XML, mientras que OpenID Connect utiliza JSON/JWT.",
        "isCorrect": true,
        "rationale": "SAML se basa en el lenguaje de marcado extensible (XML), mientras que OpenID Connect utiliza tokens web JSON (JWT), que son más ligeros y adecuados para APIs y aplicaciones móviles."
      },
      {
        "text": "SAML utiliza tokens binarios, mientras que OpenID Connect utiliza texto plano.",
        "isCorrect": false,
        "rationale": "Ninguno de los dos protocolos utiliza estos formatos como su estándar principal para las aserciones o tokens de identidad."
      },
      {
        "text": "Ambos protocolos utilizan exclusivamente tokens JWT firmados.",
        "isCorrect": false,
        "rationale": "Solo OpenID Connect se basa fundamentalmente en JWT; SAML tiene su propio formato de aserción basado en XML."
      }
    ],
    "hint": "Recuerda qué tecnología de formato de datos está asociada con entornos corporativos tradicionales frente a las APIs web modernas."
  },
  {
    "guid": "1b784870-85eb-48cb-9859-c38627eaf4c9",
    "subjectId": "T28",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "El sistema Cl@ve permite a un ciudadano español autenticarse una vez y acceder a servicios de múltiples administraciones públicas (AEAT, Seguridad Social, etc.). Este es un ejemplo de:",
    "answerOptions": [
      {
        "text": "Federación de identidades.",
        "isCorrect": true,
        "rationale": "Este concepto describe el acuerdo de confianza entre diferentes dominios (organizaciones) para reconocer y aceptar las identidades gestionadas por otros."
      },
      {
        "text": "Un servicio de directorio local.",
        "isCorrect": false,
        "rationale": "Un servicio de directorio como Active Directory gestiona identidades dentro de una sola organización, no entre varias entidades de confianza."
      },
      {
        "text": "Autenticación biométrica.",
        "isCorrect": false,
        "rationale": "Aunque se podría usar biometría dentro de Cl@ve, el concepto de usar una identidad en múltiples organizaciones es la federación."
      },
      {
        "text": "Customer IAM (CIAM).",
        "isCorrect": false,
        "rationale": "CIAM es el tipo de sistema que gestiona estas identidades, pero el principio que permite la interoperabilidad entre administraciones es la federación."
      }
    ],
    "hint": "Considera cómo diferentes organizaciones confían entre sí para validar la identidad de un usuario sin que éste tenga que registrarse en cada una."
  },
  {
    "guid": "de84fca2-0d39-4aee-b67a-dff7f4b1bc9a",
    "subjectId": "T28",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "¿Cuál es la principal novedad que introduce el reglamento eIDAS2?",
    "answerOptions": [
      {
        "text": "La obligatoriedad de usar certificados digitales para todas las transacciones online.",
        "isCorrect": false,
        "rationale": "eIDAS ya regulaba los certificados digitales, pero eIDAS2 no los hace obligatorios para todas las transacciones."
      },
      {
        "text": "La creación de la Carpeta de Identidad Digital Europea (EUDI Wallet).",
        "isCorrect": true,
        "rationale": "La EUDI Wallet es el elemento central y más innovador de eIDAS2, permitiendo a los ciudadanos gestionar su identidad y atributos digitales de forma segura."
      },
      {
        "text": "La sustitución completa del RGPD en materia de identidad.",
        "isCorrect": false,
        "rationale": "eIDAS2 complementa y se alinea con el RGPD, pero no lo sustituye; ambos reglamentos coexisten."
      },
      {
        "text": "La estandarización del protocolo SAML 2.0 en toda la Unión Europea.",
        "isCorrect": false,
        "rationale": "El reglamento promueve la interoperabilidad y estándares comunes, pero no impone un único protocolo técnico como SAML 2.0."
      }
    ],
    "hint": "Piensa en la herramienta digital personal que esta nueva regulación quiere poner en manos de cada ciudadano europeo."
  },
  {
    "guid": "4ce97883-2898-434d-9db1-4d4f68fc530d",
    "subjectId": "T28",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "El principio de seguridad \"nunca confiar, siempre verificar\", que trata cada solicitud de acceso como si proviniera de una red no fiable, es la base del modelo:",
    "answerOptions": [
      {
        "text": "Zero Trust.",
        "isCorrect": true,
        "rationale": "Este modelo elimina la idea de un perímetro de red seguro, exigiendo una verificación estricta de la identidad para cada persona y dispositivo que intente acceder a los recursos."
      },
      {
        "text": "RBAC.",
        "isCorrect": false,
        "rationale": "RBAC se centra en la asignación de permisos basados en roles, pero no incorpora intrínsecamente el principio de verificación continua de cada acceso."
      },
      {
        "text": "Defensa en profundidad.",
        "isCorrect": false,
        "rationale": "La defensa en profundidad consiste en superponer múltiples capas de seguridad, lo cual es compatible con Zero Trust, pero no es el nombre del principio en sí."
      },
      {
        "text": "Federación de identidades.",
        "isCorrect": false,
        "rationale": "La federación se basa en una confianza preestablecida entre dominios, lo que contrasta con la filosofía de \"nunca confiar\" de Zero Trust."
      }
    ],
    "hint": "Considera el enfoque de seguridad que asume que las amenazas pueden existir tanto dentro como fuera de la red."
  },
  {
    "guid": "8f8ed1ab-95c2-4558-ac3d-743fe6c82e9e",
    "subjectId": "T28",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "En la arquitectura de autenticación del Ayuntamiento de Barcelona, ¿qué entidad actúa como el Proveedor de Identidad (IdP) interno que emite los tokens JWT para el acceso a las aplicaciones municipales?",
    "answerOptions": [
      {
        "text": "AOC (Administració Oberta de Catalunya).",
        "isCorrect": false,
        "rationale": "La AOC actúa como el IdP externo que federa las identidades de los ciudadanos (idCAT Mòbil, Cl@ve), pero no es el emisor de tokens interno."
      },
      {
        "text": "OVT (Oficina Virtual de Tràmits).",
        "isCorrect": false,
        "rationale": "La OVT es el Proveedor de Servicios (SP) que consume los tokens para permitir al ciudadano realizar trámites; no emite los tokens."
      },
      {
        "text": "MCA (Mòdul d’Arquitectura d’Autenticació).",
        "isCorrect": true,
        "rationale": "El MCA es el IdP interno del Ayuntamiento que, tras validar la autenticación externa, genera y gestiona el ciclo de vida de los tokens JWT utilizados dentro del ecosistema municipal."
      },
      {
        "text": "Cl@ve.",
        "isCorrect": false,
        "rationale": "Cl@ve es uno de los sistemas de identidad federados a través de la AOC, pero no es el componente interno del Ayuntamiento que emite los tokens."
      }
    ],
    "hint": "Busca el componente que actúa como el corazón de la autenticación dentro de la infraestructura del Ayuntamiento, una vez que la identidad del ciudadano ha sido verificada externamente."
  },
  {
    "guid": "c4647707-101d-4d19-a0e7-034acdce1cdf",
    "subjectId": "T28",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Un sistema que gestiona el ciclo de vida de la identidad de un usuario, desde la creación de su cuenta al incorporarse a la empresa hasta su eliminación al marcharse, está implementando la fase de:",
    "answerOptions": [
      {
        "text": "Autorización.",
        "isCorrect": false,
        "rationale": "La autorización define los permisos de un usuario, que pueden cambiar durante su ciclo de vida, pero no es el proceso completo en sí."
      },
      {
        "text": "Autenticación.",
        "isCorrect": false,
        "rationale": "La autenticación es el proceso de verificar la identidad en un momento dado, no la gestión de esa identidad a lo largo del tiempo."
      },
      {
        "text": "Gestión del ciclo de vida de identidades.",
        "isCorrect": true,
        "rationale": "Este concepto abarca todas las fases: alta (onboarding), modificación y baja (offboarding) de una identidad digital en una organización."
      },
      {
        "text": "Auditoría de seguridad.",
        "isCorrect": false,
        "rationale": "La auditoría revisa el ciclo de vida para asegurar que se sigue correctamente, pero no es el proceso de gestión en sí mismo."
      }
    ],
    "hint": "Considera el término que describe todo el recorrido de una identidad digital, desde su nacimiento hasta su desaparición en un sistema."
  },
  {
    "guid": "687fecbb-6fd8-401b-9b60-72f7a520a36c",
    "subjectId": "T28",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "¿Qué normativa europea establece un marco común para la identidad electrónica y los servicios de confianza, como la firma electrónica y los certificados digitales?",
    "answerOptions": [
      {
        "text": "RGPD (Reglamento General de Protección de Datos).",
        "isCorrect": false,
        "rationale": "El RGPD se centra en la protección de datos personales, mientras que la normativa en cuestión se especializa en la identidad y la confianza digital."
      },
      {
        "text": "ENS (Esquema Nacional de Seguridad).",
        "isCorrect": false,
        "rationale": "El ENS es un marco español para la seguridad en las administraciones públicas, no un reglamento europeo sobre identidad digital."
      },
      {
        "text": "ISO/IEC 27001.",
        "isCorrect": false,
        "rationale": "ISO 27001 es un estándar internacional para la gestión de la seguridad de la información, no una ley europea específica para identidad electrónica."
      },
      {
        "text": "eIDAS (electronic IDentification, Authentication and trust Services).",
        "isCorrect": true,
        "rationale": "Este reglamento crea un mercado único europeo para las transacciones electrónicas seguras, estableciendo las bases para la identificación y los servicios de confianza."
      }
    ],
    "hint": "El acrónimo de esta normativa hace referencia directa a la identificación electrónica y los servicios de confianza."
  },
  {
    "guid": "e385af26-9ae4-49af-984f-326d0fa22b28",
    "subjectId": "T28",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Una cuenta de usuario que pertenece a un empleado que ya no trabaja en la organización pero que no ha sido desactivada se conoce como:",
    "answerOptions": [
      {
        "text": "Una cuenta con privilegios excesivos.",
        "isCorrect": false,
        "rationale": "Una cuenta puede tener privilegios excesivos y además ser huérfana, pero el término específico para una cuenta de un ex-empleado es otro."
      },
      {
        "text": "Una cuenta huérfana.",
        "isCorrect": true,
        "rationale": "Este término se utiliza para describir cuentas que ya no están asociadas a un propietario activo, lo que supone un riesgo de seguridad significativo."
      },
      {
        "text": "Una cuenta federada.",
        "isCorrect": false,
        "rationale": "Una cuenta federada es una identidad que se utiliza en múltiples dominios de confianza, lo cual no está relacionado con el estado de un ex-empleado."
      },
      {
        "text": "Una cuenta de servicio.",
        "isCorrect": false,
        "rationale": "Las cuentas de servicio se utilizan para aplicaciones o sistemas automatizados, no para usuarios humanos que han dejado la organización."
      }
    ],
    "hint": "Piensa en un término que describa a algo o alguien que ha quedado sin un dueño o responsable."
  },
  {
    "guid": "a13b0533-e5a6-45d9-830d-98b3193f4e45",
    "subjectId": "T28",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Un sistema de IAM enfocado en gestionar la identidad y el acceso de clientes y ciudadanos en lugar de empleados internos se denomina:",
    "answerOptions": [
      {
        "text": "IAM (Identity and Access Management).",
        "isCorrect": false,
        "rationale": "IAM es el término general; existe una especialización para el caso de clientes."
      },
      {
        "text": "IdP (Identity Provider).",
        "isCorrect": false,
        "rationale": "Un IdP es un componente tecnológico que puede formar parte de cualquier sistema de IAM, no el tipo de sistema en sí."
      },
      {
        "text": "CIAM (Customer Identity and Access Management).",
        "isCorrect": true,
        "rationale": "CIAM se especializa en los desafíos únicos de la gestión de identidades de clientes, como la escalabilidad masiva, la experiencia de usuario y el autoservicio."
      },
      {
        "text": "LDAP (Lightweight Directory Access Protocol).",
        "isCorrect": false,
        "rationale": "LDAP es un protocolo para acceder a servicios de directorio, no un tipo de sistema de gestión de identidades."
      }
    ],
    "hint": "Considera el acrónimo que añade una letra al inicio de 'IAM' para indicar que se enfoca en los usuarios externos."
  },
  {
    "guid": "24e6c7d8-0887-4c77-9df8-267d9158652d",
    "subjectId": "T28",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Según el reglamento eIDAS2, ¿cuál es el plazo que tienen los Estados miembros para poner a disposición de los ciudadanos al menos una EUDI Wallet desde la entrada en vigor del reglamento en mayo de 2024?",
    "answerOptions": [
      {
        "text": "12 meses.",
        "isCorrect": false,
        "rationale": "Este plazo es demasiado corto para la complejidad de la implementación requerida a nivel nacional."
      },
      {
        "text": "18 meses.",
        "isCorrect": false,
        "rationale": "Aunque es un plazo considerable, el reglamento establece un periodo ligeramente más largo."
      },
      {
        "text": "24 meses.",
        "isCorrect": true,
        "rationale": "El reglamento otorga dos años a los Estados miembros, lo que sitúa la fecha límite en torno a mediados de 2026."
      },
      {
        "text": "36 meses.",
        "isCorrect": false,
        "rationale": "Este plazo es más largo que el estipulado en la normativa."
      }
    ],
    "hint": "El plazo establecido es de dos años a partir de la fecha de entrada en vigor."
  },
  {
    "guid": "0570017c-26fe-41e8-b876-904a35a24143",
    "subjectId": "T28",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "En el contexto de la autenticación, ¿a qué categoría pertenece el uso de una tarjeta inteligente (smart card) o un token de hardware?",
    "answerOptions": [
      {
        "text": "Algo que eres (biometría).",
        "isCorrect": false,
        "rationale": "Esta categoría incluye características inherentes a la persona, como la huella dactilar, no objetos."
      },
      {
        "text": "Algo que sabes (conocimiento).",
        "isCorrect": false,
        "rationale": "Esta categoría se refiere a información secreta como una contraseña o un PIN."
      },
      {
        "text": "Algo que posees (posesión).",
        "isCorrect": true,
        "rationale": "Una tarjeta inteligente o un token son objetos físicos que el usuario debe tener en su poder para autenticarse."
      },
      {
        "text": "Algo que haces (comportamiento).",
        "isCorrect": false,
        "rationale": "Esta es una subcategoría de la biometría que incluye patrones como la forma de teclear o la firma, no un objeto físico."
      }
    ],
    "hint": "Piensa si este método de autenticación se basa en un secreto memorizado, una característica física o un objeto que llevas contigo."
  },
  {
    "guid": "5adf9ee4-8e64-4209-9039-25b13ed99956",
    "subjectId": "T28",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Comparando OAuth 2.0 y OpenID Connect (OIDC), ¿cuál es la función principal que OIDC añade sobre OAuth 2.0?",
    "answerOptions": [
      {
        "text": "OIDC añade una capa de autorización para el acceso a APIs.",
        "isCorrect": false,
        "rationale": "La autorización es la función principal de OAuth 2.0; OIDC se construye sobre eso para añadir otra capacidad."
      },
      {
        "text": "OIDC añade una capa de autenticación e información de identidad del usuario.",
        "isCorrect": true,
        "rationale": "OIDC introduce el 'ID Token', que permite a la aplicación cliente verificar la identidad del usuario y obtener información básica de su perfil, algo que OAuth 2.0 por sí solo no proporciona."
      },
      {
        "text": "OIDC reemplaza el uso de tokens de OAuth 2.0 por aserciones XML.",
        "isCorrect": false,
        "rationale": "OIDC sigue utilizando el marco de tokens de OAuth 2.0 (basados en JSON/JWT), no cambia a XML, que es característico de SAML."
      },
      {
        "text": "OIDC simplifica OAuth 2.0 eliminando la necesidad de un 'access token'.",
        "isCorrect": false,
        "rationale": "OIDC opera junto con el 'access token' de OAuth 2.0, no lo elimina; añade un 'ID token' adicional para la autenticación."
      }
    ],
    "hint": "Considera qué pieza de información fundamental sobre el usuario proporciona OIDC que OAuth 2.0 por sí solo no estandariza."
  },
  {
    "guid": "3a92bff0-699b-4f02-beee-a9fee0b04e28",
    "subjectId": "T28",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "¿Cuál de los siguientes es un reto común en la gestión de identidades en entornos híbridos?",
    "answerOptions": [
      {
        "text": "La falta de soluciones de autenticación multifactor (MFA).",
        "isCorrect": false,
        "rationale": "Existen numerosas soluciones de MFA compatibles con entornos híbridos; el reto no es la falta de ellas, sino su integración."
      },
      {
        "text": "La integración y sincronización de identidades entre sistemas on-premises y en la nube.",
        "isCorrect": true,
        "rationale": "Mantener la coherencia y la seguridad de las identidades a través de sistemas locales (como Active Directory) y servicios en la nube (como Azure AD) es un desafío técnico y operativo clave."
      },
      {
        "text": "La imposibilidad de aplicar el modelo de control de acceso basado en roles (RBAC) en la nube.",
        "isCorrect": false,
        "rationale": "RBAC es un modelo ampliamente soportado y utilizado en las principales plataformas en la nube."
      },
      {
        "text": "La prohibición normativa de almacenar datos de identidad en la nube.",
        "isCorrect": false,
        "rationale": "Normativas como el RGPD regulan cómo se almacenan los datos, pero no prohíben su almacenamiento en la nube si se cumplen las garantías adecuadas."
      }
    ],
    "hint": "Piensa en el desafío de mantener una única 'verdad' para la identidad de un usuario cuando esta debe existir en dos mundos tecnológicos diferentes."
  },
  {
    "guid": "bd9edab7-cfc6-47f4-8da6-d76c8d116543",
    "subjectId": "T28",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Dentro de la arquitectura del Ayuntamiento de Barcelona, la validación continua del token JWT por parte del MCA en cada acción sensible del ciudadano refleja la filosofía de:",
    "answerOptions": [
      {
        "text": "Single Sign-On (SSO).",
        "isCorrect": false,
        "rationale": "El SSO permite al usuario acceder a múltiples aplicaciones sin volver a autenticarse, pero la validación continua es un principio de seguridad más específico."
      },
      {
        "text": "Federación de identidades.",
        "isCorrect": false,
        "rationale": "La federación se produce al inicio con la AOC; la validación interna posterior se rige por otro principio."
      },
      {
        "text": "Zero Trust.",
        "isCorrect": true,
        "rationale": "Este principio implica no confiar implícitamente en ninguna solicitud y verificarla siempre, que es exactamente lo que hace el MCA al validar el token repetidamente."
      },
      {
        "text": "Defensa en profundidad.",
        "isCorrect": false,
        "rationale": "Aunque es parte de una estrategia de defensa en profundidad, el nombre específico para la filosofía de verificación constante es Zero Trust."
      }
    ],
    "hint": "Considera qué modelo de seguridad parte de la premisa de que no se debe confiar en nadie por defecto, ni siquiera dentro del propio sistema."
  },
  {
    "guid": "25fd2fce-a19a-40de-ba59-dba09d00d0b6",
    "subjectId": "T28",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "¿Qué ventaja principal ofrece el control de acceso basado en roles (RBAC) en la gestión de permisos?",
    "answerOptions": [
      {
        "text": "Permite definir permisos extremadamente granulares basados en el contexto.",
        "isCorrect": false,
        "rationale": "Esta es la principal ventaja de ABAC, no de RBAC, que es menos flexible en cuanto al contexto dinámico."
      },
      {
        "text": "Simplifica la administración de permisos al agruparlos en roles según la función del usuario.",
        "isCorrect": true,
        "rationale": "RBAC reduce la complejidad al asignar permisos a roles (ej. 'Administrador', 'Editor') en lugar de a usuarios individuales, facilitando la gestión y la auditoría."
      },
      {
        "text": "Es el único modelo compatible con los servicios de directorio como Active Directory.",
        "isCorrect": false,
        "rationale": "Aunque Active Directory utiliza RBAC extensivamente, también puede soportar otros modelos y no es el único compatible."
      },
      {
        "text": "Elimina la necesidad de autenticación de los usuarios.",
        "isCorrect": false,
        "rationale": "RBAC es un modelo de autorización que se aplica después de que un usuario ha sido autenticado; no reemplaza la autenticación."
      }
    ],
    "hint": "Piensa en cómo este modelo agrupa a los usuarios por su trabajo o responsabilidad para facilitar la asignación de derechos."
  },
  {
    "guid": "d0d0ed57-dc3e-4f92-86c2-ded0952051e3",
    "subjectId": "T28",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Además de la EUDI Wallet, eIDAS2 amplía los servicios de confianza cualificados. ¿Cuál de los siguientes es un NUEVO servicio introducido por eIDAS2?",
    "answerOptions": [
      {
        "text": "Sello electrónico cualificado.",
        "isCorrect": false,
        "rationale": "El sello electrónico cualificado ya estaba definido en el reglamento eIDAS original."
      },
      {
        "text": "Archivo electrónico cualificado.",
        "isCorrect": true,
        "rationale": "La conservación y archivo de documentos electrónicos con valor legal a largo plazo es una de las nuevas categorías de servicios de confianza que añade eIDAS2."
      },
      {
        "text": "Sello de tiempo cualificado.",
        "isCorrect": false,
        "rationale": "El sello de tiempo cualificado ya era un servicio de confianza reconocido por el eIDAS original."
      },
      {
        "text": "Servicio de entrega electrónica certificada cualificado.",
        "isCorrect": false,
        "rationale": "Este servicio también estaba contemplado en la primera versión del reglamento eIDAS."
      }
    ],
    "hint": "Considera qué nuevo servicio aborda la necesidad de conservar documentos digitales con garantías legales a lo largo del tiempo."
  },
  {
    "guid": "8c9a24f3-77bd-4efb-8ac9-05ae8ca092ff",
    "subjectId": "T28",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "La publicación NIST SP 800-63 es una guía de referencia fundamental para:",
    "answerOptions": [
      {
        "text": "La protección de datos personales en Europa.",
        "isCorrect": false,
        "rationale": "La principal regulación para la protección de datos en Europa es el RGPD, no una publicación del NIST."
      },
      {
        "text": "La implementación de sistemas de gestión de seguridad de la información (SGSI).",
        "isCorrect": false,
        "rationale": "La guía principal para SGSI es la familia de estándares ISO/IEC 27000."
      },
      {
        "text": "Definir los requisitos y niveles de seguridad para la identidad digital.",
        "isCorrect": true,
        "rationale": "Esta publicación del Instituto Nacional de Estándares y Tecnología de EE. UU. es una guía técnica detallada sobre credenciales, autenticación y federación."
      },
      {
        "text": "El diseño de arquitecturas de microservicios seguros.",
        "isCorrect": false,
        "rationale": "Aunque los principios del NIST se pueden aplicar, esta guía no se centra específicamente en la arquitectura de microservicios."
      }
    ],
    "hint": "Busca el documento que es una guía técnica de un organismo estadounidense sobre cómo verificar y gestionar identidades en sistemas digitales."
  },
  {
    "guid": "76862535-e764-4418-9289-9a659e01f7d4",
    "subjectId": "T28",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "El proceso de cambiar los permisos de un empleado que ha sido ascendido a un nuevo puesto con más responsabilidades es un ejemplo de la fase de ______ del ciclo de vida de la identidad.",
    "answerOptions": [
      {
        "text": "Alta.",
        "isCorrect": false,
        "rationale": "El alta se refiere a la creación inicial de la identidad del empleado cuando se une a la organización."
      },
      {
        "text": "Modificación.",
        "isCorrect": true,
        "rationale": "Esta fase incluye cualquier cambio en los atributos, roles o permisos de una identidad existente durante su permanencia en la organización."
      },
      {
        "text": "Baja.",
        "isCorrect": false,
        "rationale": "La baja se produce cuando el empleado deja la organización y sus accesos deben ser revocados."
      },
      {
        "text": "Certificación.",
        "isCorrect": false,
        "rationale": "La certificación o auditoría es un proceso de revisión de los accesos, no el cambio en sí mismo."
      }
    ],
    "hint": "Considera qué término describe la actualización de una identidad ya existente en el sistema."
  },
  {
    "guid": "c0708092-bd97-42cd-a8e9-508efdaa59df",
    "subjectId": "T28",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "En una solución de SSO con SAML, la entidad que verifica la identidad del usuario y emite la aserción de autenticación se denomina:",
    "answerOptions": [
      {
        "text": "Proveedor de Servicios (Service Provider - SP).",
        "isCorrect": false,
        "rationale": "El Proveedor de Servicios es la aplicación o recurso al que el usuario quiere acceder; confía en el IdP para la autenticación."
      },
      {
        "text": "Agente de Usuario (User Agent).",
        "isCorrect": false,
        "rationale": "El agente de usuario es el navegador web del cliente, que facilita la comunicación entre el SP y el IdP pero no emite aserciones."
      },
      {
        "text": "Proveedor de Identidad (Identity Provider - IdP).",
        "isCorrect": true,
        "rationale": "El IdP es la autoridad responsable de mantener y gestionar la información de identidad, autenticar a los usuarios y proporcionar aserciones a los SP."
      },
      {
        "text": "Servicio de Directorio (Directory Service).",
        "isCorrect": false,
        "rationale": "El servicio de directorio (como LDAP) puede ser el repositorio donde el IdP almacena las identidades, pero el rol de autenticar y emitir aserciones lo desempeña el IdP."
      }
    ],
    "hint": "Piensa en el componente del sistema que actúa como la fuente de verdad para la identidad de los usuarios."
  },
  {
    "guid": "043d210c-4408-401c-8c80-c87ef2090b42",
    "subjectId": "T28",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Una de las ventajas clave de la EUDI Wallet propuesta en eIDAS2 es que permitirá al usuario:",
    "answerOptions": [
      {
        "text": "Almacenar un número ilimitado de identidades de diferentes países.",
        "isCorrect": false,
        "rationale": "La wallet está vinculada a la identidad de un Estado miembro, no está diseñada para almacenar múltiples identidades legales."
      },
      {
        "text": "Acceder a servicios públicos de países fuera de la Unión Europea.",
        "isCorrect": false,
        "rationale": "El reconocimiento mutuo de la wallet está garantizado dentro de los Estados miembros de la UE."
      },
      {
        "text": "Decidir qué atributos de su identidad comparte con cada servicio (divulgación selectiva).",
        "isCorrect": true,
        "rationale": "Un principio fundamental de la wallet es dar al ciudadano el control sobre sus datos, permitiéndole compartir solo la información estrictamente necesaria para una transacción."
      },
      {
        "text": "Reemplazar completamente su documento de identidad físico en todas las situaciones.",
        "isCorrect": false,
        "rationale": "Aunque permitirá muchos usos, está pensada como un complemento y su aceptación en todos los contextos offline puede variar."
      }
    ],
    "hint": "Considera cómo esta nueva herramienta mejora la privacidad y el control del usuario sobre su propia información personal."
  },
  {
    "guid": "4b074b64-87f8-4000-b333-1058ab28f625",
    "subjectId": "T28",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "OAuth 2.0 es fundamentalmente un framework para la ________, mientras que OpenID Connect es una capa construida sobre él para la ________.",
    "answerOptions": [
      {
        "text": "autorización ... autenticación",
        "isCorrect": true,
        "rationale": "OAuth 2.0 permite a un usuario conceder a una aplicación acceso limitado a sus recursos sin compartir sus credenciales (autorización), y OIDC añade la capacidad de confirmar quién es ese usuario (autenticación)."
      },
      {
        "text": "autenticación ... autorización",
        "isCorrect": false,
        "rationale": "Esta opción invierte los roles de los dos protocolos. OAuth 2.0 gestiona el 'qué puedes hacer', no el 'quién eres'."
      },
      {
        "text": "identificación ... federación",
        "isCorrect": false,
        "rationale": "Aunque relacionados, los términos más precisos para describir sus funciones principales son autenticación y autorización."
      },
      {
        "text": "federación ... identificación",
        "isCorrect": false,
        "rationale": "La federación es un concepto más amplio que puede usar estos protocolos, pero no define su función principal."
      }
    ],
    "hint": "Recuerda la diferencia entre conceder permiso para acceder a tus fotos (delegación de permiso) y confirmar que eres tú quien concede ese permiso."
  },
  {
    "guid": "a3aed7e1-b69c-4791-9e89-3463b21452fa",
    "subjectId": "T28",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Al integrar un nuevo empleado, el sistema de IAM se conecta automáticamente con el sistema de Recursos Humanos para crear la cuenta de usuario. Esto es un ejemplo de:",
    "answerOptions": [
      {
        "text": "Mejora de la experiencia de usuario.",
        "isCorrect": false,
        "rationale": "Aunque puede mejorar la experiencia, el beneficio principal de este proceso es otro."
      },
      {
        "text": "Mejora de la seguridad.",
        "isCorrect": false,
        "rationale": "La automatización reduce errores manuales, lo cual mejora la seguridad, pero el beneficio más directo se relaciona con la rapidez y el ahorro de trabajo."
      },
      {
        "text": "Eficiencia operativa y automatización.",
        "isCorrect": true,
        "rationale": "Este proceso automatiza las altas, reduciendo la carga de trabajo manual del equipo de TI y acelerando la incorporación del nuevo empleado."
      },
      {
        "text": "Cumplimiento normativo.",
        "isCorrect": false,
        "rationale": "La automatización ayuda al cumplimiento, pero el beneficio más inmediato y evidente es la eficiencia."
      }
    ],
    "hint": "Piensa en cómo este proceso afecta al trabajo diario de los departamentos de TI y RRHH."
  },
  {
    "guid": "954c71be-a511-409e-b974-1d5e1ab3678e",
    "subjectId": "T28",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "La capacidad de usar el login de Google para acceder a una aplicación de terceros sin crear una nueva cuenta es un ejemplo práctico de:",
    "answerOptions": [
      {
        "text": "Un servicio de directorio como Active Directory.",
        "isCorrect": false,
        "rationale": "Active Directory gestiona identidades dentro de un dominio corporativo, no para federación en internet a nivel de consumidor."
      },
      {
        "text": "Identidad federada y SSO con un IdP social.",
        "isCorrect": true,
        "rationale": "Google actúa como un Proveedor de Identidad (IdP) que federa la identidad del usuario a la aplicación de terceros, habilitando el Single Sign-On."
      },
      {
        "text": "Autenticación multifactor (MFA) únicamente.",
        "isCorrect": false,
        "rationale": "Aunque el login de Google puede usar MFA, el concepto de usar esa identidad en otro sitio es la federación."
      },
      {
        "text": "Control de Acceso Basado en Atributos (ABAC).",
        "isCorrect": false,
        "rationale": "ABAC es un modelo de autorización que se aplicaría después del login, no el mecanismo de login en sí mismo."
      }
    ],
    "hint": "Considera cómo una gran empresa tecnológica permite que uses tu cuenta existente para identificarte en otros sitios web y aplicaciones."
  },
  {
    "guid": "51e57835-c3c2-4a91-ace6-fa8823707bfb",
    "subjectId": "T28",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Según el material, ¿qué protocolo SSO se considera menos optimizado para aplicaciones móviles y SPAs (Single-Page Applications) debido a su formato basado en XML y su mayor complejidad?",
    "answerOptions": [
      {
        "text": "OAuth 2.0",
        "isCorrect": false,
        "rationale": "OAuth 2.0, especialmente con OIDC, está bien adaptado para estos entornos modernos al usar JSON/JWT."
      },
      {
        "text": "OpenID Connect",
        "isCorrect": false,
        "rationale": "Este protocolo fue diseñado específicamente con la simplicidad y los entornos móviles/web en mente."
      },
      {
        "text": "SAML 2.0",
        "isCorrect": true,
        "rationale": "El uso de XML y la complejidad de sus mensajes hacen que SAML 2.0 sea más pesado y menos ágil para integrar en aplicaciones móviles y de una sola página en comparación con las alternativas basadas en JSON."
      },
      {
        "text": "LDAP",
        "isCorrect": false,
        "rationale": "LDAP es un protocolo de acceso a directorios, no un protocolo de SSO para aplicaciones web o móviles."
      }
    ],
    "hint": "Piensa en el protocolo que tiene sus raíces en entornos empresariales y federaciones web más tradicionales."
  }
]