[
  {
    "guid": "4d069edb-e670-41a2-8c0e-9cb200c2ccbd",
    "subjectId": "T29",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Según el material de estudio, ¿qué distingue principalmente un 'incidente de seguridad' de un 'evento de seguridad'?",
    "answerOptions": [
      {
        "text": "Un incidente siempre implica un ataque malicioso, mientras que un evento puede ser cualquier suceso observable.",
        "isCorrect": true,
        "rationale": "Un evento es un suceso observable en un sistema (como un log de acceso), que se convierte en incidente solo si compromete la confidencialidad, integridad o disponibilidad."
      },
      {
        "text": "Un evento de seguridad siempre tiene un impacto negativo, mientras que un incidente no necesariamente.",
        "isCorrect": false,
        "rationale": "Esta afirmación invierte los conceptos; es el incidente el que por definición tiene un impacto negativo, comprometiendo la seguridad."
      },
      {
        "text": "No existe ninguna diferencia, los términos son intercambiables en la gestión de ciberseguridad.",
        "isCorrect": false,
        "rationale": "El material establece una clara distinción, siendo fundamental no reaccionar a cada evento como si fuera un incidente para evitar la fatiga de alertas."
      },
      {
        "text": "Un incidente se refiere a la pérdida de datos, y un evento a un intento de acceso no autorizado.",
        "isCorrect": false,
        "rationale": "Esta es una simplificación excesiva; un incidente puede ser cualquier compromiso de la CID, no solo la pérdida de datos, y un evento es mucho más genérico que un intento de acceso."
      }
    ],
    "hint": "Piensa en la diferencia entre una simple observación y una consecuencia negativa confirmada."
  },
  {
    "guid": "42ad1d89-8dbd-4a87-b3ec-a0745bac4160",
    "subjectId": "T29",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "En el contexto del RGPD, una 'brecha de seguridad' se define específicamente como un incidente que resulta en...",
    "answerOptions": [
      {
        "text": "la saturación de los recursos de un servidor (ataque DoS).",
        "isCorrect": false,
        "rationale": "Aunque un ataque DoS es un incidente de seguridad que afecta la disponibilidad, no se ajusta a la definición específica de brecha de seguridad del RGPD, que se centra en los datos personales."
      },
      {
        "text": "la publicación de una vulnerabilidad de día cero (Zero-Day).",
        "isCorrect": false,
        "rationale": "Una vulnerabilidad es una debilidad, pero no constituye una brecha hasta que no se explota y resulta en un compromiso de datos personales."
      },
      {
        "text": "el acceso, pérdida o divulgación no autorizada de datos personales.",
        "isCorrect": true,
        "rationale": "El RGPD enfoca el término 'brecha' específicamente en incidentes que comprometen la seguridad de los datos de carácter personal."
      },
      {
        "text": "cualquier acceso no autorizado a los sistemas de la organización.",
        "isCorrect": false,
        "rationale": "Un acceso no autorizado es un incidente, pero solo se considera una 'brecha RGPD' si se confirma que ha afectado a datos personales."
      }
    ],
    "hint": "Recuerda el enfoque principal del Reglamento General de Protección de Datos."
  },
  {
    "guid": "7a1190db-b250-4245-8dd8-c4b53d934414",
    "subjectId": "T29",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "¿Cuál de las siguientes fases del proceso de gestión de incidentes se centra en eliminar completamente la causa raíz del problema, como desinstalar malware o aplicar parches?",
    "answerOptions": [
      {
        "text": "Contención",
        "isCorrect": false,
        "rationale": "La contención busca limitar el daño y evitar que el incidente se propague, pero no elimina la causa original."
      },
      {
        "text": "Recuperación",
        "isCorrect": false,
        "rationale": "La recuperación se enfoca en restaurar los servicios a su estado normal de funcionamiento después de que la amenaza ha sido eliminada."
      },
      {
        "text": "Eradicación",
        "isCorrect": true,
        "rationale": "Esta fase tiene como objetivo principal asegurarse de que el atacante o el software malicioso sea completamente eliminado de los sistemas afectados."
      },
      {
        "text": "Análisis y clasificación",
        "isCorrect": false,
        "rationale": "El análisis se realiza antes para entender el alcance y la naturaleza del incidente, pero no implica acciones correctivas directas."
      }
    ],
    "hint": "Esta fase va un paso más allá de simplemente detener el ataque; busca eliminarlo por completo."
  },
  {
    "guid": "bcc9fd73-409d-4b73-92ae-3915e434b690",
    "subjectId": "T29",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "La normativa europea DORA (Digital Operational Resilience Act) es de aplicación específica para el sector...",
    "answerOptions": [
      {
        "text": "de la administración pública.",
        "isCorrect": false,
        "rationale": "La administración pública se rige principalmente por el ENS en España, aunque otras normativas también le aplican."
      },
      {
        "text": "financiero.",
        "isCorrect": true,
        "rationale": "DORA establece requisitos estrictos de resiliencia operativa digital, incluyendo la gestión de incidentes, para entidades financieras como bancos y aseguradoras."
      },
      {
        "text": "de proveedores de servicios digitales.",
        "isCorrect": false,
        "rationale": "Los proveedores de servicios digitales están principalmente cubiertos por la directiva NIS2, aunque puede haber solapamientos."
      },
      {
        "text": "de la salud.",
        "isCorrect": false,
        "rationale": "El sector salud está considerado un sector esencial y se ve afectado por normativas como NIS2 y RGPD, pero DORA no es su marco principal."
      }
    ],
    "hint": "Piensa en un sector donde la continuidad operativa digital es crítica para la estabilidad económica."
  },
  {
    "guid": "da9f9340-c495-4fdb-9b09-52518b95b363",
    "subjectId": "T29",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "¿Qué rol es el responsable de evaluar si una brecha de datos personales implica un alto riesgo para los afectados y coordinar la notificación a la autoridad de control?",
    "answerOptions": [
      {
        "text": "CISO (Chief Information Security Officer)",
        "isCorrect": false,
        "rationale": "El CISO coordina la respuesta técnica y estratégica general, pero la evaluación del riesgo para los derechos y libertades de las personas es una competencia específica de otro rol."
      },
      {
        "text": "SOC (Security Operations Center)",
        "isCorrect": false,
        "rationale": "El SOC se encarga de la detección y el análisis técnico inicial, pero no de la evaluación del impacto legal y de privacidad sobre las personas."
      },
      {
        "text": "Alta dirección",
        "isCorrect": false,
        "rationale": "La alta dirección toma decisiones estratégicas y provee recursos, pero delega la evaluación específica del cumplimiento normativo en roles especializados."
      },
      {
        "text": "DPD (Delegat de Protecció de Dades)",
        "isCorrect": true,
        "rationale": "El DPD es el experto en la normativa de protección de datos y su función es supervisar el cumplimiento del RGPD, incluyendo la gestión y notificación de brechas."
      }
    ],
    "hint": "Este rol es el principal garante del cumplimiento de la normativa de protección de datos dentro de una organización."
  },
  {
    "guid": "6c40bef5-7434-41d5-9cd5-15f2f3fa3d9e",
    "subjectId": "T29",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Una herramienta SIEM (Security Information and Event Management) tiene como función principal:",
    "answerOptions": [
      {
        "text": "Detectar y bloquear intrusiones en tiempo real en el perímetro de la red.",
        "isCorrect": false,
        "rationale": "Esta descripción corresponde más a un sistema IDS/IPS (Intrusion Detection/Prevention System)."
      },
      {
        "text": "Automatizar los flujos de trabajo de respuesta a incidentes.",
        "isCorrect": false,
        "rationale": "La automatización de la respuesta es la función principal de las herramientas SOAR (Security Orchestration, Automation and Response)."
      },
      {
        "text": "Centralizar, correlacionar y analizar logs de múltiples fuentes para generar alertas.",
        "isCorrect": true,
        "rationale": "El propósito de un SIEM es agregar datos de logs de diversas fuentes para identificar actividades anómalas o maliciosas a través de la correlación de eventos."
      },
      {
        "text": "Analizar el comportamiento en los endpoints (ordenadores, servidores) para detectar amenazas avanzadas.",
        "isCorrect": false,
        "rationale": "Esta es la función específica de las herramientas EDR/XDR (Endpoint/Extended Detection and Response)."
      }
    ],
    "hint": "Piensa en una herramienta que actúa como un 'concentrador' de registros de eventos para obtener una visión global."
  },
  {
    "guid": "f034cd2b-2916-4190-af86-c31e91ac17a0",
    "subjectId": "T29",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "De acuerdo con el Esquema Nacional de Seguretat (ENS), ¿cuál es el principio relativo a las responsabilidades del responsable de seguridad y el responsable del sistema?",
    "answerOptions": [
      {
        "text": "Deben ser siempre la misma persona para agilizar la toma de decisiones.",
        "isCorrect": false,
        "rationale": "El ENS promueve lo contrario para evitar conflictos de interés, aunque contempla excepciones."
      },
      {
        "text": "El responsable de seguridad debe tener una dependencia jerárquica del responsable del sistema.",
        "isCorrect": false,
        "rationale": "Esto comprometería la independencia de la función de seguridad, que debe poder supervisar y cuestionar las operaciones del sistema."
      },
      {
        "text": "Las responsabilidades deben estar diferenciadas, aunque se permite que recaigan en la misma persona con justificación y medidas compensatorias.",
        "isCorrect": true,
        "rationale": "El ENS establece el principio de 'responsabilidades diferenciadas' para garantizar la segregación de funciones, pero permite excepciones justificadas."
      },
      {
        "text": "El responsable del sistema no puede tomar decisiones de seguridad, que son exclusivas del responsable de seguridad.",
        "isCorrect": false,
        "rationale": "Aunque el responsable de seguridad define la estrategia, el responsable del sistema es quien la implementa y opera, tomando decisiones técnicas alineadas."
      }
    ],
    "hint": "El ENS busca evitar conflictos de interés entre quien opera un sistema y quien supervisa su seguridad."
  },
  {
    "guid": "79abaca4-33a8-4e03-b020-d04bc7dd3322",
    "subjectId": "T29",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "¿Qué métrica se utiliza para medir el tiempo medio que transcurre desde que ocurre un incidente hasta que es detectado por la organización?",
    "answerOptions": [
      {
        "text": "MTTR (Mean Time To Respond/Recover)",
        "isCorrect": false,
        "rationale": "MTTR mide el tiempo de respuesta o recuperación, es decir, cuánto se tarda en solucionar el incidente una vez detectado."
      },
      {
        "text": "RTO (Recovery Time Objective)",
        "isCorrect": false,
        "rationale": "RTO es un objetivo de negocio que define el tiempo máximo que un servicio puede estar interrumpido, no una métrica de detección."
      },
      {
        "text": "MTTD (Mean Time To Detect)",
        "isCorrect": true,
        "rationale": "Esta métrica es clave para evaluar la eficacia de las capacidades de monitorización y detección de una organización."
      },
      {
        "text": "RPO (Recovery Point Objective)",
        "isCorrect": false,
        "rationale": "RPO se refiere a la cantidad máxima de datos que se pueden perder, no está relacionado con el tiempo de detección."
      }
    ],
    "hint": "La 'D' en la sigla de esta métrica se refiere al primer paso para poder gestionar un incidente."
  },
  {
    "guid": "346ed957-72ea-48ff-aab4-4140dbf1a17b",
    "subjectId": "T29",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "En el ejemplo del incidente en la Oficina Virtual de Trámites (OVT), ¿cuál fue la medida de contención inmediata decidida por el CISO?",
    "answerOptions": [
      {
        "text": "Aplicar un parche de seguridad al gestor documental.",
        "isCorrect": false,
        "rationale": "Aplicar un parche es una medida de erradicación, que se realiza una vez se ha analizado la causa raíz y se ha contenido el impacto inmediato."
      },
      {
        "text": "Notificar a la Autoridad Catalana de Protección de Datos (APDCAT).",
        "isCorrect": false,
        "rationale": "La notificación es un paso legal posterior, coordinado por el DPD, que se realiza tras evaluar el alcance y el riesgo de la brecha."
      },
      {
        "text": "Desconectar temporalmente el módulo afectado de la OVT.",
        "isCorrect": true,
        "rationale": "Esta acción aísla el problema y detiene inmediatamente la fuga de datos, cumpliendo el objetivo de la fase de contención de minimizar el impacto."
      },
      {
        "text": "Realizar un informe post-incidente para documentar las lecciones aprendidas.",
        "isCorrect": false,
        "rationale": "El informe post-incidente se elabora al final de todo el proceso, en la fase de aprendizaje y mejora."
      }
    ],
    "hint": "Piensa en la acción más rápida y efectiva para detener la fuga de información en ese momento."
  },
  {
    "guid": "dfb6906d-4ff8-4488-8ea6-178d91d09b52",
    "subjectId": "T29",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "¿Cuál de las siguientes es considerada una mala práctica o error habitual en la gestión de incidentes?",
    "answerOptions": [
      {
        "text": "Colaborar con organismos oficiales como CCN-CERT o INCIBE-CERT.",
        "isCorrect": false,
        "rationale": "El material de estudio identifica la colaboración con autoridades como una buena práctica para obtener apoyo especializado y compartir información."
      },
      {
        "text": "Realizar simulacros y ciberejercicios de forma regular.",
        "isCorrect": false,
        "rationale": "Los simulacros son una buena práctica fundamental para probar la eficacia del plan de respuesta y entrenar al equipo."
      },
      {
        "text": "No preservar las evidencias para un posible análisis forense digital.",
        "isCorrect": true,
        "rationale": "La destrucción o alteración de evidencias impide investigar el incidente a fondo, entender cómo ocurrió y tomar acciones legales si fuera necesario."
      },
      {
        "text": "Actualizar las políticas y procedimientos tras un incidente.",
        "isCorrect": false,
        "rationale": "Esto corresponde a la fase de 'aprendizaje y mejora', que es una buena práctica esencial para fortalecer la seguridad a futuro."
      }
    ],
    "hint": "Considera qué acción podría impedir una investigación futura sobre el origen y alcance del ataque."
  },
  {
    "guid": "9852a182-26d7-4061-8a4a-b517a886fc71",
    "subjectId": "T29",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "La directiva europea NIS2 amplía las obligaciones de ciberseguridad y notificación de incidentes principalmente a:",
    "answerOptions": [
      {
        "text": "Todas las pequeñas y medianas empresas (PYMES) sin excepción.",
        "isCorrect": false,
        "rationale": "Aunque NIS2 amplía el ámbito, no aplica a todas las PYMES, sino a aquellas que operan en sectores específicos considerados importantes o esenciales."
      },
      {
        "text": "Únicamente a las administraciones públicas de los estados miembros.",
        "isCorrect": false,
        "rationale": "Las administraciones públicas ya estaban cubiertas por la primera directiva NIS y por normativas nacionales como el ENS. NIS2 se enfoca en ampliar el ámbito al sector privado."
      },
      {
        "text": "Operadores de servicios esenciales y proveedores de servicios digitales.",
        "isCorrect": true,
        "rationale": "NIS2 refuerza y amplía el alcance de la directiva original, afectando a más sectores y tipos de entidades críticas para la economía y la sociedad."
      },
      {
        "text": "El sector financiero de forma exclusiva.",
        "isCorrect": false,
        "rationale": "El sector financiero tiene su propia regulación específica (DORA), aunque también puede ser considerado un sector esencial bajo NIS2."
      }
    ],
    "hint": "Esta normativa se centra en proteger las infraestructuras críticas y los servicios digitales clave de la Unión Europea."
  },
  {
    "guid": "69757695-3fea-4c76-a628-94e089e68c56",
    "subjectId": "T29",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "La norma ISO/IEC 27035 es un estándar internacional que se centra específicamente en:",
    "answerOptions": [
      {
        "text": "Establecer un Sistema de Gestión de Seguridad de la Información (SGSI).",
        "isCorrect": false,
        "rationale": "Esta es la descripción de la norma ISO/IEC 27001, que es el marco general para la gestión de la seguridad."
      },
      {
        "text": "La gestión de la continuidad del negocio (BCP).",
        "isCorrect": false,
        "rationale": "La continuidad del negocio se aborda en otras normas como la ISO 22301, aunque está relacionada con la respuesta a incidentes."
      },
      {
        "text": "Las auditorías de sistemas de información.",
        "isCorrect": false,
        "rationale": "Las auditorías están cubiertas por otras normas y marcos, como la ISO 19011 para la auditoría de sistemas de gestión."
      },
      {
        "text": "El proceso de gestión de incidentes de seguridad de la información.",
        "isCorrect": true,
        "rationale": "ISO 27035 proporciona una guía detallada sobre las fases de preparación, detección, respuesta, y aprendizaje en la gestión de incidentes."
      }
    ],
    "hint": "Busca la norma que el material de estudio menciona como la referencia específica para el proceso de gestión de incidentes."
  },
  {
    "guid": "c351333d-0c81-497a-b7ed-be7fa62625c2",
    "subjectId": "T29",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "¿Qué es un ataque de 'Zero-Day exploit'?",
    "answerOptions": [
      {
        "text": "Un ataque que logra saturar un servicio en menos de 24 horas.",
        "isCorrect": false,
        "rationale": "Esto describe un efecto (saturación rápida) pero no la naturaleza de un exploit de día cero."
      },
      {
        "text": "La explotación de una vulnerabilidad antes de que el fabricante publique un parche para corregirla.",
        "isCorrect": true,
        "rationale": "El término 'día cero' se refiere a que los desarrolladores han tenido cero días para solucionar la vulnerabilidad desde que fue descubierta por los atacantes."
      },
      {
        "text": "Un tipo de ransomware que cifra los archivos y da un plazo de un día para pagar el rescate.",
        "isCorrect": false,
        "rationale": "Aunque un ataque de ransomware podría usar un exploit de día cero, la definición se centra en la naturaleza de la vulnerabilidad, no en el tipo de malware."
      },
      {
        "text": "Un ataque de phishing que se lanza el primer día de una campaña de concienciación.",
        "isCorrect": false,
        "rationale": "Esto describe una táctica de ingeniería social, pero no tiene relación con el concepto de vulnerabilidades no conocidas."
      }
    ],
    "hint": "El nombre de este tipo de ataque hace referencia al tiempo que ha tenido el desarrollador para reaccionar."
  },
  {
    "guid": "dcf2f13c-6832-43f6-adeb-db77a28c29a4",
    "subjectId": "T29",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Dentro de la tipología de incidentes, el 'phishing', 'smishing' y 'vishing' son formas de:",
    "answerOptions": [
      {
        "text": "Denegación de servicio (DoS/DDoS).",
        "isCorrect": false,
        "rationale": "Los ataques DoS buscan agotar los recursos de un sistema para que no esté disponible, no engañar a los usuarios."
      },
      {
        "text": "Malware y ransomware.",
        "isCorrect": false,
        "rationale": "Aunque un ataque de phishing puede ser el vector para entregar malware, la técnica en sí misma no es un tipo de software malicioso."
      },
      {
        "text": "Ingeniería social.",
        "isCorrect": true,
        "rationale": "Todas estas técnicas se basan en la manipulación psicológica del usuario para que realice acciones o revele información confidencial."
      },
      {
        "text": "Intrusiones y accesos no autorizados.",
        "isCorrect": false,
        "rationale": "Aunque el objetivo final puede ser obtener un acceso no autorizado, el método empleado es la manipulación del usuario, no la explotación técnica directa de una vulnerabilidad."
      }
    ],
    "hint": "Estos ataques se basan en el engaño y la manipulación de las personas, no de las máquinas."
  },
  {
    "guid": "ced9a935-b1e5-483a-aef3-cc347c26ae5e",
    "subjectId": "T29",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "En España, ¿qué organismo de tipo CERT/CSIRT se enfoca principalmente en la gestión de incidentes de ciberseguridad en el sector público y la Administración?",
    "answerOptions": [
      {
        "text": "INCIBE-CERT",
        "isCorrect": false,
        "rationale": "INCIBE-CERT presta servicio principalmente a ciudadanos y empresas del sector privado en España."
      },
      {
        "text": "ENISA",
        "isCorrect": false,
        "rationale": "ENISA es la Agencia de la Unión Europea para la Ciberseguridad; opera a nivel europeo, no nacional, y se centra en recomendaciones y buenas prácticas."
      },
      {
        "text": "CCN-CERT",
        "isCorrect": true,
        "rationale": "El Centro Criptológico Nacional (CCN-CERT) es el equipo de respuesta a incidentes de seguridad para el sector público español."
      },
      {
        "text": "APDCAT",
        "isCorrect": false,
        "rationale": "La APDCAT (Autoritat Catalana de Protecció de Dades) es una autoridad de control en materia de protección de datos, no un equipo de respuesta a incidentes técnicos."
      }
    ],
    "hint": "Piensa en el organismo que depende del Centro Criptológico Nacional."
  },
  {
    "guid": "851fa24c-53e2-4383-bfb2-dbdf7d85a2bf",
    "subjectId": "T29",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "¿Cuál es uno de los objetivos clave de la fase de 'Aprenentatge i millora' (Lecciones aprendidas) en la gestión de incidentes?",
    "answerOptions": [
      {
        "text": "Restaurar los servicios afectados lo antes posible.",
        "isCorrect": false,
        "rationale": "La restauración de servicios corresponde a la fase de 'Recuperación', que ocurre antes de la fase de lecciones aprendidas."
      },
      {
        "text": "Aislar los sistemas comprometidos para evitar la propagación.",
        "isCorrect": false,
        "rationale": "El aislamiento de sistemas es una acción típica de la fase de 'Contención'."
      },
      {
        "text": "Actualizar políticas y procedimientos para prevenir futuros incidentes.",
        "isCorrect": true,
        "rationale": "El propósito de esta fase final es analizar qué salió bien y qué mal para fortalecer las defensas y mejorar los tiempos de respuesta en el futuro."
      },
      {
        "text": "Determinar el origen y el vector de ataque del incidente.",
        "isCorrect": false,
        "rationale": "La investigación del origen y el vector de ataque se realiza en la fase de 'Análisis y clasificación'."
      }
    ],
    "hint": "Esta fase mira hacia el futuro para evitar que los mismos errores vuelvan a ocurrir."
  },
  {
    "guid": "a7ed4913-e1c9-4e2a-aeb4-3e7c986cd4fa",
    "subjectId": "T29",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "El marco MITRE ATT&CK® es una base de conocimiento que se utiliza principalmente para:",
    "answerOptions": [
      {
        "text": "Gestionar el inventario de activos de una organización.",
        "isCorrect": false,
        "rationale": "La gestión de activos es fundamental para la seguridad, pero no es el propósito de este marco específico."
      },
      {
        "text": "Clasificar las tácticas, técnicas y procedimientos (TTPs) utilizados por los atacantes.",
        "isCorrect": true,
        "rationale": "Se utiliza como una enciclopedia del comportamiento de los adversarios, ayudando a los defensores a entender y detectar sus métodos."
      },
      {
        "text": "Certificar que una organización cumple con la norma ISO/IEC 27001.",
        "isCorrect": false,
        "rationale": "La certificación ISO 27001 es un proceso de auditoría de un Sistema de Gestión de Seguridad de la Información, no está directamente relacionado con este marco."
      },
      {
        "text": "Automatizar la aplicación de parches de seguridad en los sistemas.",
        "isCorrect": false,
        "rationale": "La gestión de parches es un proceso técnico importante, pero MITRE ATT&CK se enfoca en el comportamiento del adversario, no en la gestión de vulnerabilidades."
      }
    ],
    "hint": "Esta herramienta de 'Threat Intelligence' ayuda a entender 'cómo' actúan los ciberdelincuentes."
  },
  {
    "guid": "51230430-52dd-44ca-8717-cf8eb5cd877d",
    "subjectId": "T29",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Una de las recomendaciones de ENISA para mitigar el ransomware, mencionada en las preguntas de examen anteriores, es mantener copias de seguridad de una forma específica. ¿Cuál es esa característica crucial?",
    "answerOptions": [
      {
        "text": "Deben estar almacenadas exclusivamente en la nube para garantizar su disponibilidad.",
        "isCorrect": false,
        "rationale": "Aunque la nube es una opción, la recomendación clave no es su ubicación, sino su estado de conexión."
      },
      {
        "text": "Deben estar cifradas y fuera de línea (offline).",
        "isCorrect": true,
        "rationale": "Mantener las copias 'offline' o en un sistema aislado (air-gapped) es vital para que el ransomware no pueda cifrarlas también durante un ataque."
      },
      {
        "text": "Deben verificarse una única vez al año para no sobrecargar los sistemas.",
        "isCorrect": false,
        "rationale": "La recomendación es verificar las copias de seguridad de forma regular, no esporádica, para asegurar que son recuperables."
      },
      {
        "text": "No deben estar cifradas para facilitar una recuperación más rápida.",
        "isCorrect": false,
        "rationale": "El cifrado de las copias de seguridad es una buena práctica para proteger la confidencialidad de los datos en caso de que el soporte de la copia sea robado o accedido."
      }
    ],
    "hint": "Piensa en cómo protegerías las copias de seguridad del propio ransomware para que no las cifre."
  },
  {
    "guid": "ae95e618-68f8-49dd-a5b3-2aa82f56937d",
    "subjectId": "T29",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Según el material, ¿qué significa el principio CID en seguridad de la información?",
    "answerOptions": [
      {
        "text": "Control, Identificación y Detección.",
        "isCorrect": false,
        "rationale": "Aunque son conceptos de seguridad, no corresponden a los tres pilares fundamentales que define esta sigla."
      },
      {
        "text": "Certificación, Investigación y Documentación.",
        "isCorrect": false,
        "rationale": "Estas son actividades relacionadas con la gestión de la seguridad, pero no los atributos básicos de la información que se busca proteger."
      },
      {
        "text": "Confidencialidad, Integridad y Disponibilidad.",
        "isCorrect": true,
        "rationale": "Estos son los tres pilares clásicos de la seguridad de la información. Un incidente de seguridad compromete al menos uno de ellos."
      },
      {
        "text": "Comunicación, Incidente y Decisión.",
        "isCorrect": false,
        "rationale": "Estos términos son relevantes en la gestión de incidentes, pero no definen la sigla fundamental de los objetivos de la seguridad."
      }
    ],
    "hint": "Son los tres pilares fundamentales que todo sistema de seguridad busca proteger."
  },
  {
    "guid": "2f6f6d81-de20-43da-84bb-13f45884c007",
    "subjectId": "T29",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "¿Qué herramienta permite automatizar y orquestar flujos de trabajo en la respuesta a incidentes, integrándose con otras herramientas de seguridad?",
    "answerOptions": [
      {
        "text": "SIEM",
        "isCorrect": false,
        "rationale": "Un SIEM se especializa en la agregación y correlación de logs para la detección, no en la automatización de la respuesta."
      },
      {
        "text": "EDR",
        "isCorrect": false,
        "rationale": "Un EDR se enfoca en la detección y respuesta en los endpoints, pero no es una plataforma de orquestación general."
      },
      {
        "text": "IDS/IPS",
        "isCorrect": false,
        "rationale": "Un IDS/IPS detecta y/o previene intrusiones a nivel de red, pero no orquesta procesos complejos de respuesta."
      },
      {
        "text": "SOAR",
        "isCorrect": true,
        "rationale": "La 'O', 'A' y 'R' de SOAR significan Orquestación, Automatización y Respuesta, describiendo exactamente su función principal de agilizar y automatizar las tareas del SOC."
      }
    ],
    "hint": "El nombre de esta tecnología describe literalmente sus tres funciones principales: orquestar, automatizar y responder."
  },
  {
    "guid": "873d5712-bcc8-47e3-ad5a-3068048f1757",
    "subjectId": "T29",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "En el contexto del ENS, la auditoría de seguridad ordinaria de un sistema de categoría ALTA debe realizarse con una periodicidad mínima de:",
    "answerOptions": [
      {
        "text": "Cada 3 años.",
        "isCorrect": false,
        "rationale": "Este plazo corresponde a la auditoría de sistemas de categoría BÁSICA o MEDIA, según la fuente (la pregunta de examen del material menciona 3 años de forma genérica, pero el ENS detalla plazos distintos)."
      },
      {
        "text": "Anualmente.",
        "isCorrect": true,
        "rationale": "El Real Decreto 311/2022 que actualiza el ENS establece que para sistemas de categoría ALTA la auditoría debe ser anual. Para MEDIA y BÁSICA es bienal (cada 2 años)."
      },
      {
        "text": "Cada 5 años.",
        "isCorrect": false,
        "rationale": "Este plazo es demasiado largo para cualquier categoría de sistema según el ENS, dado el dinamismo de las ciberamenazas."
      },
      {
        "text": "Solo cuando ocurra un incidente grave.",
        "isCorrect": false,
        "rationale": "Se requiere una auditoría extraordinaria tras modificaciones sustanciales o incidentes graves, pero existe una obligación de realizar auditorías regulares periódicas."
      }
    ],
    "hint": "Los sistemas más críticos requieren una revisión más frecuente. La pregunta de examen mencionaba una periodicidad, pero el ENS es más específico según la categoría."
  },
  {
    "guid": "4632cdcf-bb38-420a-b4f5-cd7dce874ea2",
    "subjectId": "T29",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Un Plan de Continuidad de Negocio (BCP) se diferencia de un Plan de Recuperación de Desastres (DRP) en que:",
    "answerOptions": [
      {
        "text": "El DRP es un subconjunto del BCP, enfocado específicamente en la recuperación de la infraestructura TIC.",
        "isCorrect": true,
        "rationale": "El BCP es más amplio y abarca todos los procesos críticos del negocio (personal, instalaciones, proveedores), mientras que el DRP se centra en los aspectos tecnológicos para restaurar sistemas y datos."
      },
      {
        "text": "El BCP solo se activa en caso de desastres naturales, mientras que el DRP se activa por ciberataques.",
        "isCorrect": false,
        "rationale": "Ambos planes pueden activarse por diversas causas. La diferencia radica en su alcance (negocio vs. tecnología), no en el tipo de desastre."
      },
      {
        "text": "No hay diferencia real, son dos nombres para el mismo documento.",
        "isCorrect": false,
        "rationale": "Aunque están íntimamente relacionados, tienen objetivos y alcances distintos. El BCP busca mantener operando el negocio, el DRP busca recuperar la tecnología."
      },
      {
        "text": "El BCP es desarrollado por la alta dirección y el DRP por el equipo técnico, sin conexión entre ellos.",
        "isCorrect": false,
        "rationale": "Aunque los responsables son distintos, ambos planes deben estar completamente alineados, ya que la tecnología (DRP) es un pilar para la continuidad del negocio (BCP)."
      }
    ],
    "hint": "Piensa en cuál de los dos planes tiene un alcance más amplio, abarcando no solo la tecnología sino toda la organización."
  },
  {
    "guid": "667e5584-85cc-4ba1-be62-fd6e5df42cfe",
    "subjectId": "T29",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Cuando un incidente es causado por personal interno, ya sea de forma voluntaria o por negligencia, se clasifica como:",
    "answerOptions": [
      {
        "text": "Error de configuración.",
        "isCorrect": false,
        "rationale": "Aunque un insider podría cometer un error de configuración, la categoría se centra en el actor (interno) más que en la acción específica."
      },
      {
        "text": "Amenaza interna (insider).",
        "isCorrect": true,
        "rationale": "Esta categoría describe específicamente las amenazas que se originan desde dentro de la propia organización."
      },
      {
        "text": "Ingeniería social.",
        "isCorrect": false,
        "rationale": "La ingeniería social es una técnica de manipulación, que podría ser usada contra un empleado, pero no describe la amenaza que el propio empleado representa."
      },
      {
        "text": "Escalado de privilegios.",
        "isCorrect": false,
        "rationale": "El escalado de privilegios es una técnica que un atacante (interno o externo) puede usar para obtener más permisos, pero no es la clasificación general del tipo de amenaza."
      }
    ],
    "hint": "El nombre de esta categoría de incidente se enfoca en el origen de la amenaza."
  },
  {
    "guid": "24c9eb3e-a9ea-4561-97c3-065c32780d89",
    "subjectId": "T29",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "¿Cuál de los siguientes NO es un objetivo principal de la gestión de incidentes de ciberseguridad?",
    "answerOptions": [
      {
        "text": "Minimizar el impacto en los servicios y la información.",
        "isCorrect": false,
        "rationale": "Este es uno de los objetivos más importantes: limitar el daño causado por el incidente."
      },
      {
        "text": "Garantizar la persecución legal y condena de todos los atacantes.",
        "isCorrect": true,
        "rationale": "Aunque la preservación de evidencias puede permitir acciones legales, el objetivo principal del proceso es la respuesta y recuperación, no la acción judicial, que no siempre es factible o prioritaria."
      },
      {
        "text": "Restaurar la normalidad en el menor tiempo posible.",
        "isCorrect": false,
        "rationale": "La rápida recuperación de los servicios es un objetivo clave para mantener la continuidad del negocio."
      },
      {
        "text": "Preservar evidencias para una posible investigación forense.",
        "isCorrect": false,
        "rationale": "La recopilación y preservación de pruebas es fundamental para entender el incidente y, si es necesario, emprender acciones posteriores."
      }
    ],
    "hint": "Piensa en los objetivos que están directamente bajo el control del equipo de respuesta, en contraposición a los que dependen de sistemas externos como el judicial."
  },
  {
    "guid": "11ed372d-fb5b-470c-afb8-aac21bd01ae8",
    "subjectId": "T29",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "La normativa eIDAS2 regula los servicios de confianza y la identidad digital. En este contexto, la gestión de incidentes es crucial para:",
    "answerOptions": [
      {
        "text": "Los operadores de redes sociales.",
        "isCorrect": false,
        "rationale": "Las redes sociales son consideradas servicios digitales bajo NIS2, pero eIDAS2 se centra en un tipo de servicio más específico."
      },
      {
        "text": "Las empresas del sector del transporte.",
        "isCorrect": false,
        "rationale": "El transporte es un sector esencial bajo NIS2, pero no es el foco principal de la regulación de identidad digital."
      },
      {
        "text": "Los prestadores de servicios cualificados de confianza (ej. certificados digitales, firmas electrónicas).",
        "isCorrect": true,
        "rationale": "eIDAS2 establece requisitos estrictos para estos prestadores, ya que un incidente en sus sistemas podría socavar la confianza en las transacciones digitales en toda la UE."
      },
      {
        "text": "Las entidades financieras.",
        "isCorrect": false,
        "rationale": "Aunque utilizan servicios de confianza, las entidades financieras tienen su propio marco principal de resiliencia operativa en DORA."
      }
    ],
    "hint": "Esta regulación se enfoca en las entidades que nos permiten identificarnos y firmar documentos de forma segura en el mundo digital."
  },
  {
    "guid": "7b4d9539-7e30-4add-bc7a-3b51c115182f",
    "subjectId": "T29",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "¿Qué implica el 'principio de mínimo privilegio', mencionado como una buena práctica?",
    "answerOptions": [
      {
        "text": "Asignar a todos los usuarios los privilegios de administrador para agilizar el trabajo.",
        "isCorrect": false,
        "rationale": "Esto es exactamente lo contrario al principio; dar privilegios máximos a todos aumenta enormemente la superficie de ataque."
      },
      {
        "text": "Otorgar a los usuarios y sistemas únicamente los permisos estrictamente necesarios para realizar sus funciones.",
        "isCorrect": true,
        "rationale": "Este principio busca limitar el daño potencial que un usuario o sistema comprometido puede causar, al restringir su acceso a lo indispensable."
      },
      {
        "text": "Utilizar la menor cantidad posible de herramientas de seguridad para reducir la complejidad.",
        "isCorrect": false,
        "rationale": "Aunque la simplicidad es deseable, este principio se refiere a los permisos de acceso de los usuarios, no al número de herramientas."
      },
      {
        "text": "Responder a los incidentes con la mínima intervención posible para no alterar las evidencias.",
        "isCorrect": false,
        "rationale": "Aunque se deben preservar las evidencias, la respuesta debe ser la necesaria para contener y erradicar la amenaza. El principio se refiere a la configuración de permisos 'a priori'."
      }
    ],
    "hint": "Se trata de una estrategia proactiva de control de acceso, no de una forma de reaccionar a los incidentes."
  },
  {
    "guid": "8a0d370a-08c7-4212-b1d0-dd66bbba8f99",
    "subjectId": "T29",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "Según el RGPD, ¿cuál es el plazo máximo para notificar una brecha de seguridad de datos personales a la autoridad de control competente?",
    "answerOptions": [
      {
        "text": "24 horas desde la detección.",
        "isCorrect": false,
        "rationale": "Este es un plazo muy estricto que no se corresponde con el requisito general del RGPD, aunque podría ser una política interna más exigente."
      },
      {
        "text": "72 horas desde que se tiene constancia de la brecha.",
        "isCorrect": true,
        "rationale": "El artículo 33 del RGPD establece explícitamente este plazo para realizar la notificación a la autoridad de control, a menos que sea improbable que la brecha constituya un riesgo."
      },
      {
        "text": "Una semana, para permitir una investigación exhaustiva.",
        "isCorrect": false,
        "rationale": "Aunque la investigación puede continuar, la notificación inicial debe realizarse mucho antes para cumplir con la normativa."
      },
      {
        "text": "Inmediatamente, sin demora indebida, pero sin un plazo fijo.",
        "isCorrect": false,
        "rationale": "La frase 'sin demora indebida' se usa en el reglamento, pero va acompañada de un plazo máximo concreto que debe cumplirse."
      }
    ],
    "hint": "Piensa en el marco temporal específico que establece el reglamento europeo de protección de datos para las comunicaciones formales."
  },
  {
    "guid": "40f79f1c-331c-460f-9642-56d9a365e739",
    "subjectId": "T29",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "¿Cuál es la diferencia fundamental entre un 'evento de seguridad' y un 'incidente de seguridad'?",
    "answerOptions": [
      {
        "text": "Un evento es siempre malicioso, mientras que un incidente puede no serlo.",
        "isCorrect": false,
        "rationale": "Esta es la relación inversa; los eventos no son necesariamente maliciosos, pero los incidentes sí comprometen la seguridad."
      },
      {
        "text": "Un evento es un suceso observable, mientras que un incidente es un evento que compromete la confidencialidad, integridad o disponibilidad (CID).",
        "isCorrect": true,
        "rationale": "Esta definición se alinea con las descripciones del material, donde un incidente es una categoría confirmada y perjudicial de un evento."
      },
      {
        "text": "Un evento afecta a los sistemas, y un incidente afecta a los datos personales.",
        "isCorrect": false,
        "rationale": "Un incidente puede afectar tanto a sistemas como a datos, y una brecha es el tipo específico de incidente que afecta a datos personales."
      },
      {
        "text": "No hay diferencia, los términos se utilizan indistintamente en la gestión de la ciberseguridad.",
        "isCorrect": false,
        "rationale": "Aunque a veces se usan de forma laxa, en la gestión formal de incidentes la distinción entre ambos conceptos es crucial para el triaje y la respuesta."
      }
    ],
    "hint": "Considera qué término representa una ocurrencia normal en los registros del sistema y cuál implica un impacto negativo confirmado."
  },
  {
    "guid": "7d727d19-6cd2-4f22-ac7b-5990fec01b02",
    "subjectId": "T29",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "En el proceso de gestión de incidentes basado en la norma ISO 27035, ¿cuál es el objetivo principal de la fase de 'Contención'?",
    "answerOptions": [
      {
        "text": "Eliminar completamente el malware o la cuenta de usuario comprometida del sistema.",
        "isCorrect": false,
        "rationale": "Esta acción pertenece a la fase de 'Erradicación', que se enfoca en eliminar la causa raíz del problema."
      },
      {
        "text": "Restaurar los servicios y validar que los sistemas operan de forma segura.",
        "isCorrect": false,
        "rationale": "Este es el objetivo de la fase de 'Recuperación', que ocurre después de haber eliminado la amenaza."
      },
      {
        "text": "Analizar los logs y determinar el alcance y el vector de ataque del incidente.",
        "isCorrect": false,
        "rationale": "Esto se realiza principalmente en la fase de 'Análisis y clasificación', justo antes de tomar medidas de contención."
      },
      {
        "text": "Limitar el impacto del incidente y evitar que se propague a otros sistemas.",
        "isCorrect": true,
        "rationale": "La contención se centra en acciones inmediatas, como aislar un sistema de la red, para detener el daño mientras se prepara la erradicación."
      }
    ],
    "hint": "Esta fase se enfoca en 'parar la hemorragia' antes de 'curar la herida'."
  },
  {
    "guid": "a85cf74b-da73-490e-845a-8440b6d49550",
    "subjectId": "T29",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "¿Qué herramienta de ciberseguridad está diseñada para correlacionar eventos de múltiples fuentes (logs, firewalls, etc.) y generar alertas de seguridad?",
    "answerOptions": [
      {
        "text": "EDR (Endpoint Detection and Response)",
        "isCorrect": false,
        "rationale": "Un EDR se enfoca en la detección y respuesta en los dispositivos finales (endpoints), pero no en la correlación centralizada de eventos de toda la red."
      },
      {
        "text": "IDS/IPS (Intrusion Detection/Prevention System)",
        "isCorrect": false,
        "rationale": "Un IDS/IPS monitoriza el tráfico de red en busca de actividad maliciosa, pero un SIEM tiene un alcance mucho más amplio al agregar logs de diversas fuentes."
      },
      {
        "text": "SIEM (Security Information and Event Management)",
        "isCorrect": true,
        "rationale": "La función principal de un SIEM es agregar, analizar y correlacionar datos de eventos de seguridad de toda la infraestructura para proporcionar una visión unificada y generar alertas."
      },
      {
        "text": "SOAR (Security Orchestration, Automation and Response)",
        "isCorrect": false,
        "rationale": "Una plataforma SOAR se utiliza para automatizar las respuestas a las alertas, a menudo integrándose con un SIEM que es quien genera dichas alertas."
      }
    ],
    "hint": "Busca la herramienta cuya función principal es la gestión y correlación de información y eventos de seguridad."
  },
  {
    "guid": "b323449f-c37a-4ff9-8ea2-a924234e1eaf",
    "subjectId": "T29",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "En el contexto de la gestión de incidentes, ¿cuál es la función principal del Delegado de Protección de Datos (DPD)?",
    "answerOptions": [
      {
        "text": "Coordinar la respuesta técnica para aislar los sistemas afectados y erradicar el malware.",
        "isCorrect": false,
        "rationale": "Esta es una responsabilidad técnica que recae típicamente en el equipo CSIRT o el SOC, no en el DPD."
      },
      {
        "text": "Asumir la coordinación general del incidente y reportar a la alta dirección.",
        "isCorrect": false,
        "rationale": "La coordinación general del incidente suele ser responsabilidad del CISO (Chief Information Security Officer)."
      },
      {
        "text": "Evaluar el riesgo para los derechos y libertades de las personas afectadas y gestionar la notificación a la autoridad de control.",
        "isCorrect": true,
        "rationale": "El DPD es el experto en la normativa de protección de datos (RGPD) y su rol es clave cuando un incidente involucra datos personales."
      },
      {
        "text": "Realizar el análisis forense de los sistemas para preservar las evidencias digitales.",
        "isCorrect": false,
        "rationale": "El análisis forense es una tarea altamente especializada que realizan expertos técnicos, no el DPD, cuya función es de supervisión y asesoramiento legal."
      }
    ],
    "hint": "Este rol se enfoca específicamente en el cumplimiento de la normativa de protección de datos personales."
  },
  {
    "guid": "5855dcb3-2a2d-4809-8c8f-e0f33449801d",
    "subjectId": "T29",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "La métrica MTTR (Mean Time To Respond/Recover) es un indicador clave en la gestión de incidentes. ¿Qué mide exactamente?",
    "answerOptions": [
      {
        "text": "El tiempo medio que transcurre desde que ocurre un incidente hasta que es detectado por el SOC.",
        "isCorrect": false,
        "rationale": "Este tiempo se mide con otra métrica clave, el MTTD (Mean Time To Detect)."
      },
      {
        "text": "El coste económico total, directo e indirecto, asociado a un incidente.",
        "isCorrect": false,
        "rationale": "El impacto económico es una métrica importante, pero el MTTR se enfoca exclusivamente en una dimensión temporal."
      },
      {
        "text": "El porcentaje de incidentes que vuelven a ocurrir después de haber sido resueltos.",
        "isCorrect": false,
        "rationale": "Esto se conoce como tasa de reincidencia y mide la efectividad de la erradicación, no el tiempo de respuesta."
      },
      {
        "text": "El tiempo medio necesario para controlar, solucionar y recuperar los servicios tras la detección de un incidente.",
        "isCorrect": true,
        "rationale": "MTTR engloba la eficiencia del equipo de respuesta en todas las fases posteriores a la detección, desde la contención hasta la recuperación total."
      }
    ],
    "hint": "La 'R' en esta métrica puede significar tanto 'Respuesta' como 'Recuperación', indicando el tiempo que se tarda en volver a la normalidad."
  },
  {
    "guid": "6335f158-724c-41c1-8dcd-957cff80d489",
    "subjectId": "T29",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "Según el principio de 'responsabilidades diferenciadas' del Esquema Nacional de Seguridad (ENS), ¿puede el responsable de seguridad ser también el responsable del sistema?",
    "answerOptions": [
      {
        "text": "No, en ningún caso, ya que violaría el principio de segregación de funciones.",
        "isCorrect": false,
        "rationale": "La norma establece que esta es la regla general, pero contempla una excepción específica."
      },
      {
        "text": "Sí, siempre que se justifique y se apliquen medidas compensatorias para mitigar el riesgo.",
        "isCorrect": true,
        "rationale": "El ENS permite esta excepción para mantener la flexibilidad, pero exige una justificación formal y controles adicionales para asegurar la independencia de la función de seguridad."
      },
      {
        "text": "Sí, únicamente si el responsable del sistema tiene una dependencia jerárquica del responsable de seguridad.",
        "isCorrect": false,
        "rationale": "La relación jerárquica no es la condición que permite la excepción según el ENS; la clave es la justificación y las medidas compensatorias."
      },
      {
        "text": "Sí, no existe ninguna restricción al respecto en el ENS.",
        "isCorrect": false,
        "rationale": "El ENS es muy claro en su preferencia por la diferenciación de roles, y no permite que se combinen sin restricciones."
      }
    ],
    "hint": "El ENS busca evitar conflictos de interés, pero también es pragmático. ¿Qué condición permite una excepción a la regla general de separación de roles?"
  },
  {
    "guid": "1a165ba7-a589-4312-bb10-b67f4a7001de",
    "subjectId": "T29",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "Un ataque de 'phishing' se clasifica dentro de qué tipo de incidente de ciberseguridad?",
    "answerOptions": [
      {
        "text": "Malware y ransomware.",
        "isCorrect": false,
        "rationale": "Aunque el phishing puede ser el vehículo para entregar malware, el ataque en sí mismo se basa en una técnica diferente."
      },
      {
        "text": "Denegación de servicio (DoS/DDoS).",
        "isCorrect": false,
        "rationale": "Los ataques DoS buscan agotar los recursos de un servicio para hacerlo inaccesible, un objetivo distinto al del phishing."
      },
      {
        "text": "Ingeniería social.",
        "isCorrect": true,
        "rationale": "El phishing es el ejemplo por excelencia de la ingeniería social, ya que manipula psicológicamente al usuario para que realice una acción (como revelar credenciales)."
      },
      {
        "text": "Errores de configuración.",
        "isCorrect": false,
        "rationale": "Un error de configuración es una debilidad interna del sistema, mientras que el phishing es un ataque activo que se dirige a los usuarios."
      }
    ],
    "hint": "Este tipo de ataque no explota una vulnerabilidad técnica del sistema, sino la confianza o el descuido de una persona."
  },
  {
    "guid": "1178660a-bdc4-4495-95da-7fe34f7583e1",
    "subjectId": "T29",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "Tras un incidente de seguridad grave, ¿qué actividad es fundamental en la fase de 'Aprenentatge i millora' (Lecciones aprendidas y mejora)?",
    "answerOptions": [
      {
        "text": "Aislar los sistemas afectados para prevenir una mayor propagación.",
        "isCorrect": false,
        "rationale": "Esta es una acción crítica, pero pertenece a la fase de 'Contención', al inicio de la respuesta al incidente."
      },
      {
        "text": "Notificar a la autoridad de protección de datos dentro del plazo legal establecido.",
        "isCorrect": false,
        "rationale": "La notificación es una obligación legal que se gestiona durante las fases de análisis y respuesta, no es parte de la mejora post-incidente."
      },
      {
        "text": "Elaborar un informe post-incidente y actualizar los planes y procedimientos.",
        "isCorrect": true,
        "rationale": "Esta fase se centra en analizar qué funcionó y qué no, documentarlo y utilizar ese conocimiento para fortalecer las defensas y mejorar la respuesta futura."
      },
      {
        "text": "Restaurar los datos a partir de las copias de seguridad para recuperar el servicio.",
        "isCorrect": false,
        "rationale": "La restauración de servicios es el objetivo principal de la fase de 'Recuperación', que precede a la de lecciones aprendidas."
      }
    ],
    "hint": "El objetivo de esta última fase del ciclo de vida de la gestión de incidentes es evitar que el mismo problema vuelva a ocurrir."
  },
  {
    "guid": "16d6cc43-0597-4eb3-a9f1-d89a6a95e2ec",
    "subjectId": "T29",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "¿Qué normativa europea se enfoca específicamente en la resiliencia operativa digital del sector financiero, imponiendo obligaciones estrictas en la gestión de incidentes?",
    "answerOptions": [
      {
        "text": "Directiva NIS2",
        "isCorrect": false,
        "rationale": "NIS2 tiene un alcance más amplio, afectando a múltiples sectores esenciales y digitales, no exclusivamente al financiero."
      },
      {
        "text": "RGPD",
        "isCorrect": false,
        "rationale": "El RGPD se centra en la protección de datos personales en todos los sectores, no en la resiliencia operativa de un sector específico."
      },
      {
        "text": "DORA (Digital Operational Resilience Act)",
        "isCorrect": true,
        "rationale": "DORA fue creada específicamente para armonizar y fortalecer la gestión de riesgos TIC y la resiliencia operativa en las entidades financieras de la UE."
      },
      {
        "text": "eIDAS2",
        "isCorrect": false,
        "rationale": "eIDAS2 regula los servicios de identificación electrónica y confianza, como las firmas electrónicas, que son utilizados por el sector financiero pero no es la normativa principal de su resiliencia."
      }
    ],
    "hint": "Busca la regulación cuyo nombre hace referencia explícita a la 'Resiliencia Operativa Digital' y que se aplica a bancos y aseguradoras."
  },
  {
    "guid": "a91f2c3d-4b6e-4f8a-9d21-0c5e7b8a6301",
    "subjectId": "T63",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Quin és l'objectiu principal d'un pla de gestió d'incidents de ciberseguretat en una administració pública?",
    "answerOptions": [
      {
        "text": "Assegurar una resposta coordinada que minimitzi l'impacte operatiu, legal i reputacional",
        "isCorrect": true,
        "rationale": "Els plans d'incidents busquen limitar l'impacte global de l'incident, no només l'aspecte tècnic."
      },
      {
        "text": "Garantir la continuïtat del servei mitjançant mecanismes exclusius de recuperació",
        "isCorrect": false,
        "rationale": "La continuïtat és important, però no recull tota la finalitat del pla d'incidents."
      },
      {
        "text": "Establir responsabilitats jurídiques prèvies davant possibles incompliments",
        "isCorrect": false,
        "rationale": "El pla no té com a objectiu determinar responsabilitats legals prèvies."
      },
      {
        "text": "Centralitzar totes les decisions de seguretat en l'àrea TIC",
        "isCorrect": false,
        "rationale": "La gestió d'incidents és transversal i no exclusivament TIC."
      }
    ]
  },
  {
    "guid": "b2d7e1f4-9a6c-4b3e-8c10-7f5a6d9e6302",
    "subjectId": "T63",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Segons l'Esquema Nacional de Seguretat, quina actuació inicial és clau davant la detecció d'un incident rellevant?",
    "answerOptions": [
      {
        "text": "Identificar i categoritzar l'incident segons el seu impacte i abast",
        "isCorrect": true,
        "rationale": "La categorizació correcta condiciona la resposta posterior."
      },
      {
        "text": "Aplicar immediatament mesures correctores per restablir el servei",
        "isCorrect": false,
        "rationale": "La contenció és important, però sense classificació pot ser inadequada."
      },
      {
        "text": "Activar els protocols de notificació externa",
        "isCorrect": false,
        "rationale": "La notificació depèn del tipus i gravetat de l'incident."
      },
      {
        "text": "Realitzar una anàlisi forense completa",
        "isCorrect": false,
        "rationale": "L'anàlisi forense és posterior a la identificació inicial."
      }
    ]
  },
  {
    "guid": "c3a6f9e8-1b2d-4c7a-9e40-5d6b8f1a6303",
    "subjectId": "T63",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "En cas d'una bretxa de seguretat amb dades personals, quina obligació estableix el RGPD per a una administració pública?",
    "answerOptions": [
      {
        "text": "Notificar la bretxa a l'autoritat de control sense dilació indeguda",
        "isCorrect": true,
        "rationale": "El RGPD fixa un termini màxim general de 72 hores."
      },
      {
        "text": "Informar únicament els afectats quan existeixi un risc elevat",
        "isCorrect": false,
        "rationale": "Aquesta obligació no substitueix la notificació a l'autoritat."
      },
      {
        "text": "Documentar internament la bretxa si s'han aplicat mesures correctores",
        "isCorrect": false,
        "rationale": "La documentació interna no eximeix de notificació."
      },
      {
        "text": "Comunicar-la només en cas de pèrdua irreversible de dades",
        "isCorrect": false,
        "rationale": "El criteri no és la irreversibilitat sinó el risc per als drets."
      }
    ]
  },
  {
    "guid": "d4e2b6c9-7a1f-4d8b-9c30-5a6e8f2d6304",
    "subjectId": "T63",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Quina és la funció principal d'un CSIRT en el marc de la gestió d'incidents municipals?",
    "answerOptions": [
      {
        "text": "Coordinar tècnicament la detecció, resposta i recuperació davant incidents",
        "isCorrect": true,
        "rationale": "El CSIRT actua com a centre especialitzat de resposta."
      },
      {
        "text": "Assessorar jurídicament sobre possibles responsabilitats derivades",
        "isCorrect": false,
        "rationale": "L'assessorament jurídic correspon a altres unitats."
      },
      {
        "text": "Definir les polítiques estratègiques de seguretat",
        "isCorrect": false,
        "rationale": "Les polítiques es defineixen a nivell organitzatiu."
      },
      {
        "text": "Validar la comunicació institucional amb òrgans externs",
        "isCorrect": false,
        "rationale": "La comunicació institucional no és funció principal del CSIRT."
      }
    ]
  },
  {
    "guid": "e5b1c4a9-6d7f-4e2b-9a10-8c5f6d7a6305",
    "subjectId": "T63",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Quin és el valor principal de la preservació d'evidències digitals en la gestió d'un incident greu?",
    "answerOptions": [
      {
        "text": "Garantir la validesa de les proves en investigacions tècniques i legals",
        "isCorrect": true,
        "rationale": "La cadena de custòdia és clau en l'àmbit públic."
      },
      {
        "text": "Facilitar la restauració ràpida dels sistemes afectats",
        "isCorrect": false,
        "rationale": "La restauració no depèn directament de les evidències."
      },
      {
        "text": "Reduir l'abast de les obligacions de notificació",
        "isCorrect": false,
        "rationale": "Les obligacions legals no es veuen reduïdes per la preservació."
      },
      {
        "text": "Permetre el tancament anticipat de l'incident",
        "isCorrect": false,
        "rationale": "La correcta gestió pot allargar la resolució."
      }
    ]
  },
  {
    "guid": "aa1b2c3d-4e5f-4a6b-9c10-1d2e3f4a8401",
    "subjectId": "T63",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Davant una bretxa de seguretat amb dades personals, quina actuació s'ajusta MÉS correctament al que estableix el RGPD?",
    "answerOptions": [
      {
        "text": "Notificar la bretxa a l'autoritat de control sense dilació indeguda i documentar-ne les circumstàncies",
        "isCorrect": true,
        "rationale": "És l'opció que recull de manera més completa l'article 33 del RGPD."
      },
      {
        "text": "Analitzar internament el risc abans de decidir si cal notificar",
        "isCorrect": false,
        "rationale": "L'anàlisi de risc és necessària, però no pot retardar indegudament la notificació."
      },
      {
        "text": "Informar els afectats quan existeixi un risc elevat per als seus drets",
        "isCorrect": false,
        "rationale": "És correcte parcialment, però no substitueix la notificació a l'autoritat."
      },
      {
        "text": "Aplicar mesures correctores immediates per contenir la bretxa",
        "isCorrect": false,
        "rationale": "La contenció és obligada, però no és l'exigència normativa principal."
      }
    ]
  },
  {
    "guid": "bb2c3d4e-5f6a-4b7c-8d20-3e4f5a6b8402",
    "subjectId": "T63",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Segons l'ENS, quina mesura contribueix MÉS directament al compliment de la gestió d'incidents de seguretat?",
    "answerOptions": [
      {
        "text": "Disposar de procediments documentats i sotmesos a revisió periòdica",
        "isCorrect": true,
        "rationale": "És l'exigència nuclear de l'ENS en matèria de gestió d'incidents."
      },
      {
        "text": "Mantenir registres d'activitat dels sistemes crítics",
        "isCorrect": false,
        "rationale": "És una mesura important, però instrumental respecte a la gestió d'incidents."
      },
      {
        "text": "Classificar els sistemes segons la seva categoria",
        "isCorrect": false,
        "rationale": "La classificació és prèvia, però no gestiona incidents per si sola."
      },
      {
        "text": "Comunicar els incidents rellevants als organismes competents",
        "isCorrect": false,
        "rationale": "La comunicació és conseqüència de la gestió, no el seu nucli."
      }
    ]
  },
  {
    "guid": "cc3d4e5f-6a7b-4c8d-9e30-4f5a6b7c8403",
    "subjectId": "T63",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "En relació amb la Directiva NIS, quina obligació resulta MÉS ajustada al seu objecte principal?",
    "answerOptions": [
      {
        "text": "Notificar incidents que tinguin un impacte significatiu en la continuïtat del servei",
        "isCorrect": true,
        "rationale": "La continuïtat dels serveis essencials és l'eix central de la NIS."
      },
      {
        "text": "Adoptar mesures tècniques avançades de detecció d'intrusions",
        "isCorrect": false,
        "rationale": "És una bona pràctica, però no l'obligació nuclear de la Directiva."
      },
      {
        "text": "Publicar informes periòdics de ciberincidents",
        "isCorrect": false,
        "rationale": "La transparència no implica publicació generalitzada."
      },
      {
        "text": "Coordinar-se amb organismes europeus en temps real",
        "isCorrect": false,
        "rationale": "La coordinació existeix, però no és l'obligació principal."
      }
    ]
  },
  {
    "guid": "dd4e5f6a-7b8c-4d9e-a040-5f6a7b8c8404",
    "subjectId": "T63",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Dins del marc normatiu, quina funció descriu MÉS correctament el paper del Delegat de Protecció de Dades en un incident?",
    "answerOptions": [
      {
        "text": "Assessorar i supervisar el compliment de les obligacions del RGPD",
        "isCorrect": true,
        "rationale": "És la funció exacta atribuïda pel RGPD i la LOPDGDD."
      },
      {
        "text": "Decidir la necessitat de notificar l'incident",
        "isCorrect": false,
        "rationale": "La decisió correspon al responsable del tractament."
      },
      {
        "text": "Coordinar la resposta tècnica a l'incident",
        "isCorrect": false,
        "rationale": "És una funció tècnica, no normativa del DPD."
      },
      {
        "text": "Representar l'organització davant l'autoritat de control",
        "isCorrect": false,
        "rationale": "Pot actuar com a punt de contacte, però no com a representant formal."
      }
    ]
  }
]