[
  {
    "guid": "bdc2c584-85d1-4f25-aeb2-bbfd1f9aee37",
    "subjectId": "T30",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Según el material, ¿cuál es la principal diferencia entre RPA (Robotic Process Automation) y BPA (Business Process Automation)?",
    "answerOptions": [
      {
        "text": "RPA se basa en reglas y BPA utiliza inteligencia artificial.",
        "isCorrect": false,
        "rationale": "La distinción entre basado en reglas e IA se establece al comparar RPA con IA, no con BPA. BPA puede o no usar IA."
      },
      {
        "text": "RPA opera sobre la capa de interfaz de usuario existente, mientras que BPA a menudo implica cambios en las aplicaciones subyacentes.",
        "isCorrect": true,
        "rationale": "RPA actúa como un usuario humano interactuando con las interfaces actuales, lo que lo diferencia de BPA, que suele ser más invasivo y requiere integración a nivel de API o base de datos."
      },
      {
        "text": "RPA es exclusivamente para tareas de 'back-office' y BPA para tareas de 'front-office'.",
        "isCorrect": false,
        "rationale": "Aunque RPA se originó en el back-office, puede aplicarse en ambos entornos. La distinción clave no es el área de aplicación, sino el método de automatización."
      },
      {
        "text": "BPA es una tecnología más antigua que ha sido reemplazada por RPA.",
        "isCorrect": false,
        "rationale": "BPA y RPA son enfoques diferentes que coexisten. BPA se centra en la reingeniería de procesos a un nivel más profundo, mientras que RPA se enfoca en la automatización de tareas superficiales."
      }
    ],
    "hint": "Piensa en cómo interactúa cada tipo de automatización con los sistemas existentes. ¿Uno necesita cambiar el sistema y el otro no?"
  },
  {
    "guid": "476e9466-208a-4f1e-bc31-c734bd1548d3",
    "subjectId": "T30",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "En la arquitectura de UiPath, ¿qué componente se utiliza para diseñar visualmente los flujos de trabajo de automatización?",
    "answerOptions": [
      {
        "text": "UiPath Orchestrator",
        "isCorrect": false,
        "rationale": "Orchestrator es la consola de gestión y monitorización, no el entorno de desarrollo para crear los flujos."
      },
      {
        "text": "UiPath Assistant",
        "isCorrect": false,
        "rationale": "Assistant es la interfaz que utiliza el usuario final para lanzar robots atendidos, no para diseñarlos."
      },
      {
        "text": "UiPath Studio",
        "isCorrect": true,
        "rationale": "Studio es el Entorno de Desarrollo Integrado (IDE) que permite construir los procesos de automatización mediante una interfaz visual de arrastrar y soltar."
      },
      {
        "text": "AI Center",
        "isCorrect": false,
        "rationale": "AI Center es el componente que permite integrar capacidades de inteligencia artificial en los flujos, pero el diseño del flujo base se realiza en otra herramienta."
      }
    ],
    "hint": "Busca el componente que funciona como un IDE (Entorno de Desarrollo Integrado) para los desarrolladores de RPA."
  },
  {
    "guid": "37f31541-2548-4214-9825-c3c2a6847e32",
    "subjectId": "T30",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Un funcionario de un ayuntamiento necesita procesar un gran volumen de solicitudes por la noche, sin intervención humana. ¿Qué tipo de robot UiPath sería el más adecuado para esta tarea?",
    "answerOptions": [
      {
        "text": "Attended Robot",
        "isCorrect": false,
        "rationale": "Este robot requiere que un usuario lo inicie y funciona en el escritorio del usuario, por lo que no es adecuado para procesos nocturnos desatendidos."
      },
      {
        "text": "Unattended Robot",
        "isCorrect": true,
        "rationale": "Está diseñado para ejecutarse de forma programada en servidores o máquinas virtuales, ideal para procesos masivos y tareas de back-office que no requieren interacción humana."
      },
      {
        "text": "Test Robot",
        "isCorrect": false,
        "rationale": "Su función es validar y probar automatizaciones en entornos de QA, no ejecutar procesos en producción."
      },
      {
        "text": "Non-Production Robot",
        "isCorrect": false,
        "rationale": "Este tipo de robot se utiliza en entornos de desarrollo y preproducción, pero no está licenciado para ejecutar cargas de trabajo productivas reales."
      }
    ],
    "hint": "Considera qué tipo de robot puede operar de forma autónoma, basándose en una programación horaria o disparadores automáticos."
  },
  {
    "guid": "c61c1c88-9ac7-4f79-94e5-b33c278482eb",
    "subjectId": "T30",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "¿Cuál es la función principal del Centro de Excelencia (CoE) en una implantación de RPA?",
    "answerOptions": [
      {
        "text": "Desarrollar todos los robots de la organización de forma exclusiva.",
        "isCorrect": false,
        "rationale": "Aunque puede tener desarrolladores, su función principal no es solo construir, sino establecer las reglas, estándares y estrategia para que la automatización sea exitosa y escalable."
      },
      {
        "text": "Establecer la gobernanza, los estándares de desarrollo y la estrategia de automatización.",
        "isCorrect": true,
        "rationale": "El CoE es la estructura central que asegura que la implantación de RPA sea segura, escalable, eficiente y alineada con los objetivos de la organización."
      },
      {
        "text": "Gestionar únicamente las licencias de software de UiPath.",
        "isCorrect": false,
        "rationale": "La gestión de licencias es una de sus tareas operativas, pero su rol es mucho más estratégico y abarca todo el ciclo de vida de la RPA."
      },
      {
        "text": "Proporcionar soporte técnico de primer nivel para los robots que fallan.",
        "isCorrect": false,
        "rationale": "El soporte técnico puede ser una función del equipo de operaciones dentro del CoE, pero el propósito del CoE es mucho más amplio, incluyendo la estrategia y la gobernanza."
      }
    ],
    "hint": "Piensa en el CoE como el cerebro y el gobierno central del programa de RPA, no solo como un equipo de desarrollo o soporte."
  },
  {
    "guid": "f4ef732b-6537-4f67-b389-521b09de7860",
    "subjectId": "T30",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Para cumplir con normativas como el ENS y RGPD, ¿cómo debe gestionar UiPath las credenciales de acceso a sistemas sensibles (por ejemplo, contraseñas de SAP)?",
    "answerOptions": [
      {
        "text": "Incrustándolas directamente en el código del flujo de trabajo para facilitar el acceso.",
        "isCorrect": false,
        "rationale": "Esta es una práctica de seguridad muy pobre, ya que expone las credenciales y dificulta su gestión. Está explícitamente desaconsejada."
      },
      {
        "text": "Almacenándolas en un archivo de texto plano en el mismo servidor que el robot.",
        "isCorrect": false,
        "rationale": "Almacenar credenciales en texto plano es un riesgo de seguridad significativo y va en contra de todas las buenas prácticas y normativas."
      },
      {
        "text": "Utilizando los 'Assets' seguros de UiPath Orchestrator o integrándose con un 'vault' externo como CyberArk.",
        "isCorrect": true,
        "rationale": "Esta es la forma recomendada, ya que las credenciales se almacenan de forma cifrada y su acceso se gestiona de manera centralizada y auditable."
      },
      {
        "text": "Enviándolas por correo electrónico al administrador del sistema cada vez que el robot necesita ejecutarse.",
        "isCorrect": false,
        "rationale": "El envío de credenciales por canales no seguros como el correo electrónico es una práctica extremadamente insegura y no auditable."
      }
    ],
    "hint": "La gestión segura de secretos es fundamental. ¿Qué componente de la plataforma UiPath está diseñado para manejar información sensible de forma centralizada y cifrada?"
  },
  {
    "guid": "8602057f-cfef-4548-80bc-9041f94eb1b7",
    "subjectId": "T30",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Si un robot falla cada vez que se actualiza la aplicación web con la que interactúa, ¿qué proceso de gestión de servicios ITIL se encarga de aprobar y controlar la modificación del robot para adaptarlo al cambio?",
    "answerOptions": [
      {
        "text": "Gestión de Incidentes",
        "isCorrect": false,
        "rationale": "La Gestión de Incidentes se ocupa de restaurar el servicio tras el fallo, pero no de gestionar y aprobar el cambio necesario en el código del robot."
      },
      {
        "text": "Gestión de Problemas",
        "isCorrect": false,
        "rationale": "La Gestión de Problemas investiga la causa raíz, pero el proceso que formaliza y autoriza la implementación de la solución es otro."
      },
      {
        "text": "Gestión de Cambios",
        "isCorrect": true,
        "rationale": "Este proceso asegura que las modificaciones en los servicios de TI, como actualizar un robot, se realicen de manera controlada y validada para minimizar el impacto negativo."
      },
      {
        "text": "Gestión de Disponibilidad",
        "isCorrect": false,
        "rationale": "La Gestión de Disponibilidad se enfoca en asegurar que el servicio cumpla los niveles de disponibilidad acordados, pero no gestiona el proceso de modificación técnica."
      }
    ],
    "hint": "Piensa en el proceso formal que evalúa el riesgo y el impacto de una modificación en un sistema en producción antes de autorizar su despliegue."
  },
  {
    "guid": "b98d6803-1f3e-459c-b625-ab4fe4913b2f",
    "subjectId": "T30",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "¿Cuál de los siguientes es un reto cultural común al implementar RPA en una organización?",
    "answerOptions": [
      {
        "text": "La dificultad técnica para integrar UiPath con sistemas antiguos.",
        "isCorrect": false,
        "rationale": "Esto es un reto técnico y de arquitectura, no cultural."
      },
      {
        "text": "La resistencia de los empleados por miedo a ser reemplazados por los robots.",
        "isCorrect": true,
        "rationale": "La percepción de que la automatización eliminará puestos de trabajo es una barrera cultural significativa que requiere una gestión del cambio adecuada."
      },
      {
        "text": "El alto coste de las licencias de UiPath Orchestrator.",
        "isCorrect": false,
        "rationale": "Este es un reto económico o presupuestario, no cultural."
      },
      {
        "text": "La fragilidad de los robots ante cambios en las interfaces de usuario.",
        "isCorrect": false,
        "rationale": "Esto es un riesgo técnico y operativo inherente a la tecnología RPA, no un problema de cultura organizacional."
      }
    ],
    "hint": "Este reto tiene que ver con las personas y su percepción de la nueva tecnología, más que con aspectos técnicos o económicos."
  },
  {
    "guid": "9cfae1af-38fa-4948-b807-61618af9f3a8",
    "subjectId": "T30",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "En un modelo de gobernanza RPA Híbrido, ¿cómo se suelen distribuir las responsabilidades de automatización?",
    "answerOptions": [
      {
        "text": "El CoE desarrolla todos los procesos, tanto críticos como menores.",
        "isCorrect": false,
        "rationale": "Esta descripción corresponde a un modelo de gobernanza Centralizado, no Híbrido."
      },
      {
        "text": "Cada departamento desarrolla sus bots de forma autónoma sin supervisión del CoE.",
        "isCorrect": false,
        "rationale": "Esto sería un modelo descentralizado o de 'Shadow IT', que un modelo Híbrido busca evitar a través de la supervisión."
      },
      {
        "text": "El CoE gestiona los procesos críticos, y los departamentos crean bots menores bajo la supervisión y estándares del CoE.",
        "isCorrect": true,
        "rationale": "Este enfoque equilibra el control central para los procesos de alto riesgo con la agilidad departamental para automatizaciones más sencillas, siendo la definición del modelo Híbrido."
      },
      {
        "text": "Solo los 'Citizen Developers' están autorizados a crear automatizaciones.",
        "isCorrect": false,
        "rationale": "Los 'Citizen Developers' son una parte del modelo, pero el modelo Híbrido también implica un equipo central de desarrolladores expertos para tareas complejas."
      }
    ],
    "hint": "Este modelo busca un equilibrio entre el control total y la agilidad total. ¿Cómo se repartirían las tareas para conseguirlo?"
  },
  {
    "guid": "dc91baf9-de3a-4938-a155-847b825dfffd",
    "subjectId": "T30",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Según el principio de seguridad de mínimo privilegio (PoLP) aplicado a RPA, ¿qué permisos debería tener un robot diseñado para consultar el padrón municipal?",
    "answerOptions": [
      {
        "text": "Permisos de administrador en el sistema de padrón para asegurar que nunca falle por falta de acceso.",
        "isCorrect": false,
        "rationale": "Otorgar privilegios de administrador viola directamente el PoLP, ya que concede muchos más permisos de los estrictamente necesarios (como modificar o borrar datos)."
      },
      {
        "text": "Permisos de lectura y escritura para poder corregir posibles errores encontrados.",
        "isCorrect": false,
        "rationale": "Si la función del robot es solo consultar, los permisos de escritura no son necesarios y, por lo tanto, incumplen el principio de mínimo privilegio."
      },
      {
        "text": "Únicamente permisos de lectura sobre los datos específicos que necesita consultar del padrón.",
        "isCorrect": true,
        "rationale": "Esto se alinea perfectamente con el PoLP, ya que se le otorgan solo los permisos indispensables para realizar su función, minimizando el riesgo."
      },
      {
        "text": "Los mismos permisos que el jefe del departamento de padrón.",
        "isCorrect": false,
        "rationale": "Asignar permisos basados en un usuario de alto nivel es una práctica común pero incorrecta, ya que ese usuario probablemente tenga más permisos de los que el robot necesita."
      }
    ],
    "hint": "Este principio dicta que a una entidad (en este caso, un robot) se le deben otorgar solo los permisos necesarios para completar su tarea y nada más."
  },
  {
    "guid": "4d67f4e7-4125-41db-a571-f5680a635fcb",
    "subjectId": "T30",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "¿Qué componente de la plataforma UiPath se integra con sistemas de ticketing como ServiceNow o JIRA para la gestión de incidencias?",
    "answerOptions": [
      {
        "text": "UiPath Studio",
        "isCorrect": false,
        "rationale": "Studio es para el diseño de flujos; no gestiona la operación ni las incidencias en producción."
      },
      {
        "text": "UiPath Assistant",
        "isCorrect": false,
        "rationale": "Assistant es la interfaz del usuario final para lanzar robots, no una herramienta para la monitorización e integración con sistemas de Service Desk."
      },
      {
        "text": "UiPath Orchestrator",
        "isCorrect": true,
        "rationale": "Orchestrator monitoriza la ejecución de los robots y puede configurarse para que, ante un fallo, genere una alerta o un ticket automáticamente a través de su API REST."
      },
      {
        "text": "UiPath Document Understanding",
        "isCorrect": false,
        "rationale": "Este es un producto de IA para procesar documentos, no está relacionado con la gestión de operaciones o incidencias de los robots."
      }
    ],
    "hint": "Busca el componente central que actúa como el 'cerebro' de la operación, monitorizando todo lo que ocurre y siendo el punto de integración con otras herramientas de gestión."
  },
  {
    "guid": "9a972559-caff-488d-b079-f028c1dc956b",
    "subjectId": "T30",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "¿Cuál de las siguientes características NO es típica de un proceso candidato ideal para la automatización con RPA?",
    "answerOptions": [
      {
        "text": "Alto volumen de transacciones y repetitividad.",
        "isCorrect": false,
        "rationale": "Un alto volumen y la repetitividad son características clave que justifican la inversión en automatización, ya que maximizan el retorno."
      },
      {
        "text": "Requiere toma de decisiones complejas y juicio humano.",
        "isCorrect": true,
        "rationale": "RPA estándar se basa en reglas definidas. Los procesos que requieren juicio, creatividad o toma de decisiones complejas no son buenos candidatos, a menos que se combinen con IA."
      },
      {
        "text": "Se basa en reglas de negocio claras y estructuradas.",
        "isCorrect": false,
        "rationale": "Los robots de RPA ejecutan secuencias de pasos basadas en reglas predefinidas, por lo que la claridad y estructura de estas reglas es fundamental."
      },
      {
        "text": "Utiliza fuentes de datos digitales y estructuradas.",
        "isCorrect": false,
        "rationale": "Los robots trabajan de manera más eficiente y con menos errores cuando la entrada de datos es digital y predecible, como en formularios web o ficheros Excel."
      }
    ],
    "hint": "Recuerda que RPA, en su forma más básica, es 'rule-based'. ¿Qué tipo de tarea no se puede definir fácilmente con un conjunto de reglas?"
  },
  {
    "guid": "ac13b0d6-2f51-4750-894b-3ad67bc16062",
    "subjectId": "T30",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "En el contexto de ITIL aplicado a RPA, ¿a qué se refiere la 'Gestión de Capacidad'?",
    "answerOptions": [
      {
        "text": "Asegurar que los desarrolladores tengan la capacidad y formación para crear robots.",
        "isCorrect": false,
        "rationale": "Esto estaría más relacionado con la gestión de recursos humanos o la formación, no con el proceso ITIL de Gestión de Capacidad."
      },
      {
        "text": "Ajustar el número de robots disponibles para satisfacer la demanda de trabajo, como en picos estacionales.",
        "isCorrect": true,
        "rationale": "La Gestión de Capacidad se asegura de que los recursos de TI (en este caso, los robots) sean suficientes para cumplir con los niveles de servicio acordados, tanto ahora como en el futuro."
      },
      {
        "text": "Documentar las capacidades y funcionalidades de cada proceso automatizado.",
        "isCorrect": false,
        "rationale": "La documentación es importante, pero pertenece a la Gestión del Conocimiento o a las buenas prácticas de desarrollo, no a la Gestión de Capacidad."
      },
      {
        "text": "Medir la capacidad del robot para evitar errores durante su ejecución.",
        "isCorrect": false,
        "rationale": "La medición de errores corresponde a la monitorización y a la Gestión de Incidentes, mientras que la capacidad se refiere al rendimiento y la carga de trabajo."
      }
    ],
    "hint": "Este proceso ITIL se preocupa de que no haya ni demasiados ni muy pocos recursos para realizar el trabajo. Piensa en la escalabilidad."
  },
  {
    "guid": "ae3a0683-407e-42b6-a262-a29e3c695dc0",
    "subjectId": "T30",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Un usuario de negocio utiliza UiPath Assistant en su escritorio para iniciar un robot que le ayuda a copiar y pegar datos entre un Excel y una aplicación web. ¿Qué tipo de robot está utilizando?",
    "answerOptions": [
      {
        "text": "Unattended Robot",
        "isCorrect": false,
        "rationale": "Los robots Unattended se ejecutan en servidores sin interacción del usuario, no en su escritorio a través del Assistant."
      },
      {
        "text": "Attended Robot",
        "isCorrect": true,
        "rationale": "Este es el caso de uso perfecto para un robot atendido: asiste a un humano en su estación de trabajo, siendo iniciado por él para realizar una tarea específica."
      },
      {
        "text": "Citizen Developer",
        "isCorrect": false,
        "rationale": "Citizen Developer es un rol (una persona que crea automatizaciones), no un tipo de robot."
      },
      {
        "text": "Test Robot",
        "isCorrect": false,
        "rationale": "Los Test Robots se usan para validaciones en entornos de pruebas, no para asistir a usuarios en tareas productivas diarias."
      }
    ],
    "hint": "El robot actúa como un 'ayudante' o 'asistente' para el empleado. El nombre del componente de UiPath que se menciona da una pista."
  },
  {
    "guid": "6f2bf139-ad7e-4114-a3d7-a31774064934",
    "subjectId": "T30",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Dentro de la gobernanza de RPA, ¿qué riesgo se mitiga estableciendo un 'pipeline de procesos' gestionado por el CoE?",
    "answerOptions": [
      {
        "text": "El riesgo de que los robots fallen por cambios en las aplicaciones.",
        "isCorrect": false,
        "rationale": "Este riesgo se mitiga con una buena gestión de cambios y monitorización, no directamente con el pipeline de demandas."
      },
      {
        "text": "El riesgo de 'Shadow IT', donde los departamentos crean bots no gobernados.",
        "isCorrect": true,
        "rationale": "Al tener un canal formal y centralizado para solicitar y priorizar automatizaciones, se desincentiva que los departamentos creen sus propias soluciones sin control, mitigando el Shadow IT."
      },
      {
        "text": "El riesgo de robo de credenciales de los robots.",
        "isCorrect": false,
        "rationale": "Este riesgo se mitiga con la gestión segura de credenciales (vaults, assets), no con la gestión de la demanda de procesos."
      },
      {
        "text": "El riesgo de que la infraestructura de servidores no sea suficiente.",
        "isCorrect": false,
        "rationale": "Este riesgo se gestiona a través del proceso de Gestión de Capacidad, no con el pipeline de nuevas automatizaciones."
      }
    ],
    "hint": "Piensa en cómo una organización puede evitar el caos y la duplicación de esfuerzos cuando muchos departamentos quieren empezar a automatizar."
  },
  {
    "guid": "38a305ce-0c07-424c-baee-070ca25035e6",
    "subjectId": "T30",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "En el ciclo de vida de un servicio RPA, ¿en qué fase se realizan las pruebas unitarias y de integración del robot?",
    "answerOptions": [
      {
        "text": "Identificación de procesos candidatos",
        "isCorrect": false,
        "rationale": "En esta fase se evalúa qué automatizar, pero aún no se ha construido nada que se pueda probar."
      },
      {
        "text": "Desarrollo",
        "isCorrect": true,
        "rationale": "Durante la construcción del robot en Studio, es cuando se realizan las pruebas técnicas para asegurar que cada componente funciona correctamente por separado y en conjunto."
      },
      {
        "text": "Despliegue",
        "isCorrect": false,
        "rationale": "En la fase de despliegue se publica el robot en Orchestrator, pero las pruebas técnicas ya deberían haberse completado."
      },
      {
        "text": "Ejecución y operación",
        "isCorrect": false,
        "rationale": "Esta es la fase en la que el robot ya está en producción. Si se encuentran errores aquí, se genera un incidente, pero las pruebas formales son previas."
      }
    ],
    "hint": "Las pruebas son una parte integral de la construcción del software. ¿En qué etapa se construye el robot?"
  },
  {
    "guid": "f419eb6b-8b0f-434a-93b5-4ac09131be70",
    "subjectId": "T30",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "¿Qué tecnología se integra con UiPath para permitir la automatización de procesos que involucran documentos no estructurados, como facturas en PDF o correos electrónicos?",
    "answerOptions": [
      {
        "text": "Business Process Automation (BPA)",
        "isCorrect": false,
        "rationale": "BPA es un enfoque de automatización, no una tecnología específica para interpretar documentos no estructurados."
      },
      {
        "text": "Inteligencia Artificial (IA) y Machine Learning",
        "isCorrect": true,
        "rationale": "A través de herramientas como UiPath Document Understanding, la IA proporciona la capacidad cognitiva para interpretar texto, extraer datos y comprender documentos que un robot basado solo en reglas no podría procesar."
      },
      {
        "text": "Active Directory (AD)",
        "isCorrect": false,
        "rationale": "Active Directory se utiliza para la autenticación y autorización de usuarios y robots, no para el procesamiento de documentos."
      },
      {
        "text": "Power BI",
        "isCorrect": false,
        "rationale": "Power BI es una herramienta de Business Intelligence para visualizar datos y reportar el impacto de la RPA, no para procesar los documentos de entrada."
      }
    ],
    "hint": "RPA por sí sola sigue reglas. ¿Qué necesita para 'entender' o 'interpretar' contenido como lo haría un humano?"
  },
  {
    "guid": "f414e16b-d26f-4296-8ee9-6be56b4f0d6b",
    "subjectId": "T30",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Al aplicar ITIL a RPA, los robots, las colas (Queues) y los procesos se registran en la CMDB como...",
    "answerOptions": [
      {
        "text": "Incidentes (Incidents)",
        "isCorrect": false,
        "rationale": "Los incidentes son interrupciones no planificadas del servicio, no los componentes del servicio en sí."
      },
      {
        "text": "Problemas (Problems)",
        "isCorrect": false,
        "rationale": "Un problema es la causa raíz de uno o más incidentes, no un elemento de infraestructura o software."
      },
      {
        "text": "Elementos de Configuración (CI - Configuration Items)",
        "isCorrect": true,
        "rationale": "Cualquier componente que deba ser gestionado para entregar un servicio de TI se considera un CI. Esto incluye los activos de RPA como robots, procesos y colas."
      },
      {
        "text": "Acuerdos de Nivel de Servicio (SLA - Service Level Agreements)",
        "isCorrect": false,
        "rationale": "Un SLA es un acuerdo que define el nivel de servicio esperado, no un componente físico o lógico del sistema."
      }
    ],
    "hint": "Piensa en el nombre que ITIL da a cualquier componente de la infraestructura de TI que necesita ser gestionado y controlado."
  },
  {
    "guid": "37836b18-978c-4cf1-a94d-d856c9d85539",
    "subjectId": "T30",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "¿Cuál es el propósito de los 'Non-Production Robots' en UiPath?",
    "answerOptions": [
      {
        "text": "Ejecutar procesos de máxima prioridad en el entorno de producción.",
        "isCorrect": false,
        "rationale": "Estos robots están específicamente licenciados para no ser usados en producción, sino en fases previas."
      },
      {
        "text": "Permitir a los desarrolladores y testers validar automatizaciones en entornos de desarrollo y preproducción a un coste reducido.",
        "isCorrect": true,
        "rationale": "Su licencia es más económica y su objetivo es facilitar las fases de desarrollo y pruebas sin necesidad de usar licencias de producción completas."
      },
      {
        "text": "Asistir a los usuarios finales en sus tareas diarias con una licencia más barata.",
        "isCorrect": false,
        "rationale": "La asistencia a usuarios finales es la función de los 'Attended Robots', que tienen su propio modelo de licenciamiento."
      },
      {
        "text": "Servir como robots de respaldo en caso de que los robots de producción fallen.",
        "isCorrect": false,
        "rationale": "La continuidad del servicio se gestiona con robots de producción en configuraciones de alta disponibilidad, no con robots de no producción."
      }
    ],
    "hint": "El nombre de este tipo de robot indica claramente en qué entorno NO deben operar."
  },
  {
    "guid": "d891ef46-9b5d-42b1-b79d-1ec3eb544fb3",
    "subjectId": "T30",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Un modelo de gobernanza RPA 'Federado' ofrece una mayor agilidad a los departamentos, pero ¿cuál es su principal riesgo si no se gestiona correctamente?",
    "answerOptions": [
      {
        "text": "Ralentizar la innovación al imponer demasiadas normas centrales.",
        "isCorrect": false,
        "rationale": "Este es un riesgo asociado al modelo Centralizado, no al Federado, que busca precisamente más agilidad."
      },
      {
        "text": "Generar un cuello de botella en el equipo central del CoE.",
        "isCorrect": false,
        "rationale": "Este riesgo también es más propio de un modelo Centralizado, donde todas las peticiones pasan por un único equipo."
      },
      {
        "text": "Incurrir en costes de infraestructura muy elevados por la centralización.",
        "isCorrect": false,
        "rationale": "La infraestructura puede ser centralizada o no, pero el principal riesgo del modelo federado es de gestión, no de costes de hardware."
      },
      {
        "text": "La duplicación de esfuerzos y la creación de automatizaciones redundantes o inconsistentes.",
        "isCorrect": true,
        "rationale": "Si cada departamento desarrolla por su cuenta sin una buena coordinación desde el CoE, es fácil que se automaticen procesos similares de formas distintas, perdiendo eficiencia."
      }
    ],
    "hint": "Cuando varios equipos trabajan en paralelo con cierta autonomía, ¿qué problema de coordinación puede surgir?"
  },
  {
    "guid": "2842cae1-c9e0-4008-a4d9-c154ae391837",
    "subjectId": "T30",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Para asegurar la trazabilidad y la auditoría completa de las acciones de un robot, ¿qué medida de seguridad operativa es crucial en UiPath?",
    "answerOptions": [
      {
        "text": "El uso de la autenticación multifactor (MFA) para los desarrolladores.",
        "isCorrect": false,
        "rationale": "La MFA mejora la seguridad del acceso de los desarrolladores, pero no garantiza la trazabilidad de lo que hace el robot una vez ejecutado."
      },
      {
        "text": "La integración y exportación de los logs detallados de Orchestrator a un sistema SIEM.",
        "isCorrect": true,
        "rationale": "Orchestrator genera logs de cada acción, pero integrarlos con un sistema SIEM (como Splunk o QRadar) permite centralizarlos, correlacionarlos y asegurar su inmutabilidad para auditorías."
      },
      {
        "text": "La revisión de código (code review) de todos los flujos antes de su despliegue.",
        "isCorrect": false,
        "rationale": "La revisión de código es una buena práctica de desarrollo para asegurar la calidad y seguridad, pero la trazabilidad se refiere al registro de las acciones durante la ejecución."
      },
      {
        "text": "El cifrado de las credenciales utilizando Orchestrator Assets.",
        "isCorrect": false,
        "rationale": "La gestión segura de credenciales es vital para la seguridad, pero no aborda directamente el registro y la auditoría de las acciones que el robot realiza con esas credenciales."
      }
    ],
    "hint": "No basta con que el robot actúe de forma segura; también es necesario tener un registro completo e inalterable de todo lo que ha hecho."
  },
  {
    "guid": "af207eed-330b-4507-a765-42a437848693",
    "subjectId": "T30",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "¿Cuál de los siguientes KPIs se utiliza para medir el beneficio económico directo de una automatización RPA?",
    "answerOptions": [
      {
        "text": "Disponibilidad de los bots (% uptime)",
        "isCorrect": false,
        "rationale": "Este es un KPI operativo que mide la fiabilidad del servicio, no su retorno económico."
      },
      {
        "text": "ROI (Retorno de la Inversión)",
        "isCorrect": true,
        "rationale": "El ROI compara directamente el coste de la implementación (licencias, desarrollo) con el valor generado (horas de trabajo ahorradas, reducción de errores), midiendo así el beneficio financiero."
      },
      {
        "text": "Tasa de éxito de los procesos",
        "isCorrect": false,
        "rationale": "Mide la calidad y eficacia de la automatización, lo cual influye en el ROI, pero no es la medida económica directa."
      },
      {
        "text": "Nivel de satisfacción de los usuarios internos",
        "isCorrect": false,
        "rationale": "Este es un KPI cualitativo que mide el impacto en los empleados, no el beneficio económico."
      }
    ],
    "hint": "Busca el indicador financiero que compara lo que gastaste con lo que ganaste o ahorraste."
  },
  {
    "guid": "d3eceb0f-3325-48fe-8fa7-1d582edcb9c1",
    "subjectId": "T30",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "En la Administración Pública, un caso de uso común para RPA es la transferencia de datos entre la Oficina Virtual Tributaria (OVT) y sistemas internos como un CRM o ERP. ¿Qué beneficio principal aporta RPA en este escenario?",
    "answerOptions": [
      {
        "text": "Aumentar la complejidad de los trámites para el ciudadano.",
        "isCorrect": false,
        "rationale": "El objetivo de la automatización es simplificar y agilizar los procesos, no complicarlos."
      },
      {
        "text": "Reducir la necesidad de tener una Oficina Virtual Tributaria.",
        "isCorrect": false,
        "rationale": "RPA no reemplaza los sistemas existentes como la OVT, sino que los integra y automatiza las tareas manuales que se realizan sobre ellos."
      },
      {
        "text": "Eliminar errores humanos en la transcripción de datos y acelerar el proceso.",
        "isCorrect": true,
        "rationale": "La transferencia manual de datos entre sistemas es propensa a errores y lenta. Un robot realiza esta tarea de forma rápida, precisa y sin descanso, mejorando la calidad y la eficiencia."
      },
      {
        "text": "Implementar nuevas reglas de negocio que antes no eran posibles.",
        "isCorrect": false,
        "rationale": "RPA automatiza las reglas existentes. Aunque puede facilitar la aplicación de nuevas reglas, su beneficio principal en este caso es la eficiencia y la calidad de la ejecución."
      }
    ],
    "hint": "Piensa en las desventajas de que una persona tenga que copiar y pegar información de una pantalla a otra repetidamente durante todo el día."
  },
  {
    "guid": "4624f468-a12d-4933-8b1e-883a3d6fd4cc",
    "subjectId": "T30",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "La integración de UiPath Orchestrator con Active Directory (AD) sirve principalmente para...",
    "answerOptions": [
      {
        "text": "Analizar el rendimiento de los procesos automatizados.",
        "isCorrect": false,
        "rationale": "El análisis de rendimiento se realiza con las herramientas de monitorización y logs de Orchestrator, no a través de la integración con AD."
      },
      {
        "text": "Gestionar la autenticación de usuarios y la asignación de roles (RBAC) de forma centralizada.",
        "isCorrect": true,
        "rationale": "Esta integración permite que los usuarios y robots se autentiquen con sus credenciales de dominio y que sus permisos dentro de Orchestrator se basen en los grupos de AD, simplificando la gestión de accesos."
      },
      {
        "text": "Almacenar el código fuente de las automatizaciones de forma segura.",
        "isCorrect": false,
        "rationale": "El código fuente se gestiona en sistemas de control de versiones como Git, no en Active Directory."
      },
      {
        "text": "Desplegar robots en máquinas virtuales de forma automática.",
        "isCorrect": false,
        "rationale": "Aunque la identidad de la máquina puede estar en AD, el despliegue se gestiona desde Orchestrator y puede usar otras tecnologías de virtualización o contenedores."
      }
    ],
    "hint": "¿Qué sistema suele gestionar las identidades y los permisos de los empleados en una organización grande?"
  },
  {
    "guid": "34e5eb22-395a-4413-b7f6-6bf0d19feaf9",
    "subjectId": "T30",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "¿Qué es una 'Queue' (cola) en UiPath Orchestrator?",
    "answerOptions": [
      {
        "text": "Una lista de los robots que están esperando para ser reparados.",
        "isCorrect": false,
        "rationale": "Las colas no gestionan el estado de los robots, sino los elementos de trabajo que estos deben procesar."
      },
      {
        "text": "Un repositorio donde se guardan las diferentes versiones de un proceso.",
        "isCorrect": false,
        "rationale": "El control de versiones se gestiona a nivel de paquetes de automatización, no en las colas."
      },
      {
        "text": "Un contenedor para almacenar y gestionar ítems de transacción que deben ser procesados por los robots.",
        "isCorrect": true,
        "rationale": "Las colas actúan como un búfer que desacopla la producción de ítems de trabajo de su consumo, permitiendo que múltiples robots trabajen en paralelo sobre una misma carga de trabajo."
      },
      {
        "text": "El calendario de programación que indica cuándo debe ejecutarse cada robot.",
        "isCorrect": false,
        "rationale": "La programación de robots se gestiona mediante 'Triggers' (disparadores), no a través de las colas."
      }
    ],
    "hint": "Imagina una línea de cajas en un supermercado. Los clientes son los ítems de trabajo y los cajeros son los robots. ¿Cómo se llama esa línea?"
  },
  {
    "guid": "10d51f4a-c63f-43e8-9608-182722cea2a1",
    "subjectId": "T30",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "¿Por qué se considera que adoptar metodologías ágiles es una buena práctica en el desarrollo de RPA?",
    "answerOptions": [
      {
        "text": "Porque garantiza que el robot no tendrá ningún error en producción.",
        "isCorrect": false,
        "rationale": "Ninguna metodología puede garantizar la ausencia total de errores, aunque las metodologías ágiles ayudan a detectarlos antes a través de ciclos cortos."
      },
      {
        "text": "Porque permite un desarrollo incremental, entregando valor rápidamente y adaptándose a los cambios.",
        "isCorrect": true,
        "rationale": "El enfoque ágil de construir y entregar la automatización en pequeñas partes funcionales permite obtener feedback temprano y ajustar el desarrollo a las necesidades reales del negocio."
      },
      {
        "text": "Porque elimina la necesidad de documentar los procesos automatizados.",
        "isCorrect": false,
        "rationale": "Las metodologías ágiles valoran el software funcional sobre la documentación exhaustiva, pero no eliminan la necesidad de una documentación clara y suficiente."
      },
      {
        "text": "Porque es la única metodología compatible con el desarrollo en UiPath Studio.",
        "isCorrect": false,
        "rationale": "UiPath Studio es una herramienta flexible que puede ser utilizada con diferentes metodologías de desarrollo, como cascada o ágil."
      }
    ],
    "hint": "Piensa en una forma de trabajar que evite un gran proyecto de un año y, en su lugar, se enfoque en pequeñas entregas cada pocas semanas."
  },
  {
    "guid": "69e8e83d-0503-4531-922a-38cea9596360",
    "subjectId": "T30",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 2,
    "question": "Un 'Test Robot' y un 'Non-Production Robot' se usan en entornos de preproducción. ¿Cuál es la principal diferencia funcional entre ellos según la documentación?",
    "answerOptions": [
      {
        "text": "No hay ninguna diferencia, son dos nombres para el mismo tipo de robot.",
        "isCorrect": false,
        "rationale": "Aunque ambos se usan en preproducción, UiPath los diferencia con propósitos específicos."
      },
      {
        "text": "El Test Robot está diseñado específicamente para validar flujos y QA, mientras que el Non-Production es un robot genérico para desarrollo.",
        "isCorrect": true,
        "rationale": "Esta es la distinción clave: los Test Robots son para la fase de pruebas formales y QA, mientras que los Non-Production se usan de manera más general durante el desarrollo y la experimentación."
      },
      {
        "text": "El Test Robot solo puede ejecutar procesos atendidos y el Non-Production solo desatendidos.",
        "isCorrect": false,
        "rationale": "Ambos tipos de robot pueden simular tanto ejecuciones atendidas como desatendidas, dependiendo de lo que se necesite probar."
      },
      {
        "text": "El Non-Production Robot es más caro que el Test Robot.",
        "isCorrect": false,
        "rationale": "El texto indica que ambos tienen licencias reducidas para entornos de no producción, sin establecer una diferencia de coste entre ellos."
      }
    ],
    "hint": "Considera las distintas fases del ciclo de vida del software: desarrollo y pruebas (QA). ¿Cómo podría UiPath especializar sus robots para cada una de estas fases?"
  },
  {
    "guid": "8fe119b3-1544-4aab-865f-fe150d94aa9e",
    "subjectId": "T30",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "En el contexto de la arquitectura de UiPath, ¿cuál es la función principal de los 'Assets' dentro del Orchestrator?",
    "answerOptions": [
      {
        "text": "Almacenar de forma segura credenciales y variables que los robots utilizan en tiempo de ejecución.",
        "isCorrect": true,
        "rationale": "Los Assets están diseñados para gestionar de manera centralizada y segura la información sensible o configurable, como contraseñas o URLs, separándola del código del proceso."
      },
      {
        "text": "Gestionar la cola de transacciones (Queues) que deben ser procesadas por los robots.",
        "isCorrect": false,
        "rationale": "Aunque es una función clave del Orchestrator, la gestión de colas se realiza en una sección específica y distinta a la de los Assets."
      },
      {
        "text": "Contener los paquetes de automatización publicados desde UiPath Studio.",
        "isCorrect": false,
        "rationale": "Los paquetes de automatización se gestionan en la sección de 'Packages' y se despliegan como 'Processes', no se almacenan como Assets."
      },
      {
        "text": "Definir los calendarios y disparadores (Triggers) que inician la ejecución de los robots Unattended.",
        "isCorrect": false,
        "rationale": "La programación de ejecuciones se configura mediante Triggers, que es una funcionalidad separada de la gestión de credenciales y variables en los Assets."
      }
    ],
    "hint": "Piensa en cómo se maneja la información sensible que un robot necesita para acceder a otras aplicaciones sin exponerla en el código."
  },
  {
    "guid": "baaa169a-b181-48d3-be0f-cd7898598a66",
    "subjectId": "T30",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "Un robot que procesa expedientes falla recurrentemente cada vez que se actualiza la interfaz de la aplicación de gestión. Según el marco de ITIL, ¿qué proceso se debería iniciar para analizar la causa raíz y proponer una solución definitiva?",
    "answerOptions": [
      {
        "text": "Gestión de Incidentes",
        "isCorrect": false,
        "rationale": "Este proceso se centra en restaurar el servicio lo más rápido posible tras un fallo, pero no en investigar la causa subyacente de fallos repetitivos."
      },
      {
        "text": "Gestión de Problemas",
        "isCorrect": true,
        "rationale": "Este proceso se encarga de investigar la causa raíz de incidentes recurrentes para encontrar una solución permanente y evitar que vuelvan a ocurrir."
      },
      {
        "text": "Gestión del Catálogo de Servicios",
        "isCorrect": false,
        "rationale": "Este proceso se ocupa de definir y mantener la información sobre los servicios disponibles, no de resolver fallos técnicos recurrentes."
      },
      {
        "text": "Gestión de la Capacidad",
        "isCorrect": false,
        "rationale": "Este proceso asegura que la infraestructura de TI tenga los recursos necesarios para cumplir con los SLAs, lo cual no está directamente relacionado con fallos por cambios en una UI."
      }
    ],
    "hint": "Busca el proceso de ITIL que va más allá de la solución inmediata de un fallo y se enfoca en el 'porqué' de su repetición."
  },
  {
    "guid": "237d0d9f-ba4c-44ae-a32f-7046460f1bcf",
    "subjectId": "T30",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "¿Cuál es una diferencia fundamental entre RPA (Robotic Process Automation) y BPA (Business Process Automation)?",
    "answerOptions": [
      {
        "text": "RPA trabaja sobre la capa de interfaz de usuario (UI) de las aplicaciones existentes, mientras que BPA a menudo requiere cambios profundos e integraciones a nivel de API.",
        "isCorrect": true,
        "rationale": "RPA actúa como un usuario humano, interactuando con las interfaces existentes sin modificar los sistemas subyacentes, a diferencia de BPA que se integra a un nivel más profundo del proceso de negocio."
      },
      {
        "text": "RPA utiliza inteligencia artificial para la toma de decisiones, mientras que BPA se basa exclusivamente en reglas predefinidas.",
        "isCorrect": false,
        "rationale": "Esta afirmación invierte los conceptos; la RPA tradicional es puramente basada en reglas, y es la IA la que le añade capacidades cognitivas."
      },
      {
        "text": "RPA solo es aplicable a tareas de 'back-office', mientras que BPA se puede utilizar en cualquier tipo de proceso empresarial.",
        "isCorrect": false,
        "rationale": "Aunque la RPA se originó en tareas de back-office, su aplicación se ha extendido a muchos otros ámbitos, por lo que esta no es una diferencia fundamental."
      },
      {
        "text": "RPA es una tecnología de bajo código (Low-Code), mientras que BPA siempre requiere programación avanzada en lenguajes como .NET o Python.",
        "isCorrect": false,
        "rationale": "Tanto las plataformas de RPA como las de BPA pueden tener componentes de bajo código o requerir programación, por lo que esta no es una distinción clave."
      }
    ],
    "hint": "Considera a qué nivel de los sistemas informáticos opera cada tipo de automatización."
  },
  {
    "guid": "29215701-c017-4ac2-ae97-b794759115bd",
    "subjectId": "T30",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "Una administración pública desea permitir que sus departamentos desarrollen automatizaciones sencillas con agilidad, pero quiere mantener un control centralizado estricto sobre la seguridad, los estándares y la gestión de los procesos más críticos. ¿Qué modelo de Centro de Excelencia (CoE) es el más adecuado?",
    "answerOptions": [
      {
        "text": "Centralizado",
        "isCorrect": false,
        "rationale": "Este modelo ofrece máximo control pero limitaría la agilidad de los departamentos para crear sus propias automatizaciones."
      },
      {
        "text": "Federado",
        "isCorrect": false,
        "rationale": "Este modelo da más autonomía a los departamentos, pero el control del CoE es más de supervisión que de gestión directa de procesos críticos."
      },
      {
        "text": "Híbrido",
        "isCorrect": true,
        "rationale": "Este modelo combina el control centralizado del CoE para procesos críticos y estándares, con la capacidad federada de los departamentos para desarrollar automatizaciones menos críticas bajo supervisión."
      },
      {
        "text": "Shadow IT",
        "isCorrect": false,
        "rationale": "Esto no es un modelo de CoE, sino una situación no gobernada que un CoE busca precisamente evitar, donde se crean bots sin control ni estándares."
      }
    ],
    "hint": "Busca el modelo que equilibra la autonomía departamental con un control riguroso desde un equipo central."
  },
  {
    "guid": "c7d10056-f3ac-4f70-903c-188067bc4f54",
    "subjectId": "T30",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "¿Cuál de las siguientes acciones representa la mejor aplicación del Principio de Mínimo Privilegio (PoLP) en la gestión de un robot de UiPath?",
    "answerOptions": [
      {
        "text": "Integrar UiPath Orchestrator con Active Directory para validar a los desarrolladores.",
        "isCorrect": false,
        "rationale": "Esto es una buena práctica de autenticación de usuarios, pero no describe los permisos que se le otorgan al propio robot para realizar su tarea."
      },
      {
        "text": "Asignar a un robot que extrae datos de una aplicación de RRHH únicamente permisos de lectura sobre las tablas específicas que necesita.",
        "isCorrect": true,
        "rationale": "Esta acción limita los permisos del robot estrictamente a lo necesario para ejecutar su proceso, evitando accesos o modificaciones no autorizadas."
      },
      {
        "text": "Utilizar la integración con CyberArk para que todas las credenciales de los robots se gestionen en un vault externo.",
        "isCorrect": false,
        "rationale": "Esta es una excelente práctica para la gestión segura de credenciales, pero no define el nivel de privilegio que esas credenciales otorgan."
      },
      {
        "text": "Crear un rol de 'Operador RPA' en Orchestrator para que el equipo de soporte pueda monitorizar las ejecuciones.",
        "isCorrect": false,
        "rationale": "Esto aplica el principio de mínimo privilegio a los usuarios humanos que gestionan la plataforma, no a las credenciales y permisos del robot en sí."
      }
    ],
    "hint": "Este principio de seguridad se enfoca en restringir los derechos de acceso de una cuenta (en este caso, la del robot) a lo estrictamente necesario."
  },
  {
    "guid": "7a214a35-05db-4032-b3b9-b5ae44b5bbbf",
    "subjectId": "T30",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "¿En qué situación sería más apropiado el uso de un Robot Atendido (Attended) en lugar de uno No Atendido (Unattended)?",
    "answerOptions": [
      {
        "text": "Para procesar durante la noche miles de solicitudes recibidas en un portal web.",
        "isCorrect": false,
        "rationale": "Este es un caso de uso clásico para robots no atendidos, ya que es un proceso masivo, programado y sin interacción humana."
      },
      {
        "text": "Un empleado necesita extraer y consolidar datos de varias aplicaciones en tiempo real para responder a una consulta de un ciudadano.",
        "isCorrect": true,
        "rationale": "El robot actúa como un asistente para el empleado, ejecutándose bajo su demanda para agilizar una tarea que requiere supervisión humana."
      },
      {
        "text": "Para ejecutar una conciliación contable automática cada día a las 5 de la mañana.",
        "isCorrect": false,
        "rationale": "Esta tarea es programada, se ejecuta sin intervención humana y fuera del horario laboral, un escenario ideal para un robot no atendido."
      },
      {
        "text": "Para validar el funcionamiento de un proceso de automatización en un entorno de preproducción.",
        "isCorrect": false,
        "rationale": "Para esta finalidad existen licencias específicas como los Test Robots o Non-Production Robots, diseñados para entornos de QA."
      }
    ],
    "hint": "Considera qué tipo de robot está diseñado para colaborar directamente con un usuario humano en su estación de trabajo."
  },
  {
    "guid": "b04b3b80-e4cc-4e76-abfb-b1f30e1447a1",
    "subjectId": "T30",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "Dentro de las buenas prácticas para la implantación de RPA, ¿cuál es el propósito principal de establecer un pipeline de procesos candidatos?",
    "answerOptions": [
      {
        "text": "Garantizar que todos los desarrolladores utilicen las mismas plantillas de código y estándares de nomenclatura.",
        "isCorrect": false,
        "rationale": "Esto corresponde a los estándares de desarrollo definidos por el CoE, no a la gestión del pipeline de automatización."
      },
      {
        "text": "Asegurar que los robots se ejecuten en una infraestructura escalable, ya sea en la nube o en local.",
        "isCorrect": false,
        "rationale": "Esto se refiere a la arquitectura técnica y la gestión de capacidad, no a la selección y priorización de procesos a automatizar."
      },
      {
        "text": "Tener un catálogo de posibles automatizaciones, evaluarlas según criterios como el ROI o el impacto, y priorizar su desarrollo.",
        "isCorrect": true,
        "rationale": "Un pipeline permite una gestión ordenada de la demanda, asegurando que los recursos se dediquen a las automatizaciones que aportan más valor a la organización."
      },
      {
        "text": "Integrar la monitorización de los robots con herramientas de SIEM para una auditoría de seguridad completa.",
        "isCorrect": false,
        "rationale": "Esta es una buena práctica de seguridad y operación, pero no está relacionada con el proceso inicial de identificación y selección de automatizaciones."
      }
    ],
    "hint": "Piensa en cómo una organización decide qué automatizar primero de entre una larga lista de posibilidades."
  },
  {
    "guid": "109ce1b7-5694-441a-a3a2-800a82770def",
    "subjectId": "T30",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "Al aplicar la Gestión de Cambios de ITIL a un servicio de RPA, ¿qué situación requeriría la aprobación de un CAB (Change Advisory Board)?",
    "answerOptions": [
      {
        "text": "Un robot falla al procesar una transacción debido a datos de entrada incorrectos.",
        "isCorrect": false,
        "rationale": "Esto es un incidente operativo que se gestionaría a través de la Gestión de Incidentes, no un cambio en el servicio."
      },
      {
        "text": "Se necesita aumentar el número de robots durante la campaña de la renta para manejar el pico de trabajo.",
        "isCorrect": false,
        "rationale": "Esto corresponde a la Gestión de Capacidad y puede ser una operación estándar que no necesite pasar por un CAB."
      },
      {
        "text": "Se va a desplegar una nueva versión de un proceso robotizado en el entorno de producción para adaptarse a una actualización del ERP corporativo.",
        "isCorrect": true,
        "rationale": "La modificación de un proceso en producción es un cambio que debe ser evaluado por su impacto, riesgo y beneficio, que es la función del CAB."
      },
      {
        "text": "Un desarrollador necesita acceso al entorno de preproducción para probar un nuevo flujo de trabajo.",
        "isCorrect": false,
        "rationale": "Esto es una solicitud de servicio o de acceso estándar, gestionada a través de los procedimientos operativos habituales."
      }
    ],
    "hint": "La Gestión de Cambios se ocupa de controlar las modificaciones en los servicios de TI para minimizar el riesgo. ¿Cuál de estas opciones es una modificación controlada?"
  },
  {
    "guid": "de651bad-84fd-4acd-828f-30372cbbd1f8",
    "subjectId": "T30",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "Según el material, UiPath puede integrarse con tecnologías de IA para lograr la 'Intelligent Automation'. ¿Cuál de las siguientes es una capacidad que la IA aporta a un proceso RPA tradicional basado en reglas?",
    "answerOptions": [
      {
        "text": "La capacidad de ejecutar un proceso 24/7 en un servidor sin supervisión humana.",
        "isCorrect": false,
        "rationale": "Esta es una característica inherente de los robots Unattended de RPA, y no requiere necesariamente de inteligencia artificial."
      },
      {
        "text": "La capacidad de interpretar y extraer datos de documentos no estructurados, como facturas en PDF o correos electrónicos.",
        "isCorrect": true,
        "rationale": "Esta capacidad cognitiva, a menudo mediante OCR y NLP (Procesamiento del Lenguaje Natural), es una aportación clave de la IA que va más allá de la RPA basada en reglas."
      },
      {
        "text": "La capacidad de registrar las acciones de un usuario para crear un borrador inicial del flujo de automatización.",
        "isCorrect": false,
        "rationale": "Esta función de 'grabación' es una característica estándar de herramientas como UiPath Studio y no depende de la inteligencia artificial."
      },
      {
        "text": "La capacidad de integrarse con Active Directory para la gestión de usuarios y roles (RBAC).",
        "isCorrect": false,
        "rationale": "Esta es una función de seguridad y arquitectura de la plataforma, no una capacidad cognitiva aportada por la IA."
      }
    ],
    "hint": "Considera qué tipo de tarea requiere 'entender' información en lugar de simplemente seguir pasos predefinidos en una interfaz."
  },
  {
    "guid": "34cefc80-a3a0-4374-91ea-b0e47a202784",
    "subjectId": "T30",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "¿Cuál es uno de los principales riesgos asociados a una gobernanza deficiente en un programa de RPA?",
    "answerOptions": [
      {
        "text": "La aparición de 'Shadow IT', donde los departamentos crean bots no controlados, duplicando esfuerzos y creando riesgos de seguridad.",
        "isCorrect": true,
        "rationale": "Sin un CoE y políticas claras, los equipos pueden crear automatizaciones por su cuenta, sin seguir estándares de seguridad, reutilización o documentación."
      },
      {
        "text": "La necesidad de utilizar metodologías ágiles para el desarrollo de los robots.",
        "isCorrect": false,
        "rationale": "El uso de metodologías ágiles es una buena práctica recomendada por una buena gobernanza, no un riesgo derivado de su ausencia."
      },
      {
        "text": "La imposibilidad de calcular el ROI de las automatizaciones implementadas.",
        "isCorrect": false,
        "rationale": "Aunque una gobernanza deficiente puede dificultar el cálculo del ROI, el riesgo principal es más operativo y de seguridad que puramente financiero."
      },
      {
        "text": "La fragilidad de los robots ante cambios frecuentes en las interfaces de usuario de las aplicaciones.",
        "isCorrect": false,
        "rationale": "Esta fragilidad es un riesgo técnico inherente a la RPA de UI, que una buena gobernanza ayuda a mitigar con una correcta gestión de cambios, pero no es causado por la falta de gobernanza."
      }
    ],
    "hint": "Piensa en lo que podría ocurrir si cada equipo de una organización empieza a crear automatizaciones sin ninguna supervisión o estándar común."
  },
  {
    "guid": "0b42ca52-985a-4908-982d-947a5296cb03",
    "subjectId": "T30",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "En el ciclo de vida de un servicio RPA, ¿en qué fase se utiliza principalmente UiPath Studio?",
    "answerOptions": [
      {
        "text": "En la fase de Identificación de procesos candidatos.",
        "isCorrect": false,
        "rationale": "Esta fase es conceptual y de análisis de negocio, realizada por analistas de negocio, y no requiere la herramienta de desarrollo."
      },
      {
        "text": "En la fase de Desarrollo.",
        "isCorrect": true,
        "rationale": "UiPath Studio es el IDE (Entorno de Desarrollo Integrado) visual donde los desarrolladores diseñan, construyen y depuran los flujos de automatización."
      },
      {
        "text": "En la fase de Ejecución y operación.",
        "isCorrect": false,
        "rationale": "La ejecución y monitorización de los robots se gestiona desde UiPath Orchestrator y se ejecuta a través de los Robots, no desde Studio."
      },
      {
        "text": "En la fase de Millora contínua (Mejora continua).",
        "isCorrect": false,
        "rationale": "Aunque los resultados de esta fase pueden llevar a modificaciones que se realizan en Studio, la fase en sí se basa en el análisis de KPIs y métricas del Orchestrator."
      }
    ],
    "hint": "Identifica cuál de los componentes principales de la plataforma UiPath es la herramienta de diseño y construcción de los robots."
  },
  {
    "guid": "6897cb9c-ab81-4ac7-9998-0ffee53ce230",
    "subjectId": "T30",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 3,
    "question": "Un robot Unattended debe procesar datos personales para generar notificaciones electrónicas masivas. Para cumplir con normativas como el RGPD y el ENS, ¿cuál de las siguientes medidas de seguridad es crítica?",
    "answerOptions": [
      {
        "text": "Utilizar la interfaz de UiPath Assistant para que un usuario pueda lanzar el proceso manualmente.",
        "isCorrect": false,
        "rationale": "Esta acción corresponde a un robot Atendido y no está directamente relacionada con la protección de datos en un proceso masivo y desatendido."
      },
      {
        "text": "Personalizar la interfaz del UiPath Assistant con el branding de la organización.",
        "isCorrect": false,
        "rationale": "La personalización visual es una cuestión de usabilidad y marca, no una medida de seguridad para la protección de datos."
      },
      {
        "text": "Asegurar que los logs de ejecución sean completos para la trazabilidad y gestionar las credenciales de acceso a los sistemas de forma segura mediante Orchestrator Assets o un vault.",
        "isCorrect": true,
        "rationale": "La trazabilidad (saber qué hizo el robot con los datos) y la gestión segura de credenciales son pilares fundamentales para cumplir con normativas de seguridad y protección de datos."
      },
      {
        "text": "Desarrollar el proceso utilizando metodologías ágiles para poder adaptarlo rápidamente a cambios normativos.",
        "isCorrect": false,
        "rationale": "Aunque la agilidad es beneficiosa, no es en sí misma una medida de seguridad, sino una metodología de desarrollo."
      }
    ],
    "hint": "Piensa en dos aspectos clave de la seguridad de la información: saber quién hizo qué y proteger las 'llaves' que dan acceso a los datos."
  },
  {
    "guid": "a1b2c3d4-5e6f-4a7b-9c01-111213141501",
    "subjectId": "T30",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "En un entorn corporatiu amb UiPath Orchestrator, quina és la funció principal de l'Orchestrator en la gestió de serveis RPA?",
    "answerOptions": [
      {
        "text": "Centralitzar el desplegament, execució, monitorització i govern dels robots",
        "isCorrect": true,
        "rationale": "Orchestrator és el component clau de govern i gestió centralitzada d'UiPath."
      },
      {
        "text": "Dissenyar fluxos d'automatització mitjançant activitats visuals",
        "isCorrect": false,
        "rationale": "Aquesta funció correspon principalment a UiPath Studio."
      },
      {
        "text": "Executar robots de manera autònoma sense dependències externes",
        "isCorrect": false,
        "rationale": "Els robots necessiten Orchestrator per a la gestió centralitzada en entorns corporatius."
      },
      {
        "text": "Garantir la seguretat física dels servidors RPA",
        "isCorrect": false,
        "rationale": "La seguretat física no és una funció pròpia d'Orchestrator."
      }
    ]
  },
  {
    "guid": "b2c3d4e5-6f7a-4b8c-9d02-212223242502",
    "subjectId": "T30",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Quina diferència és MÉS rellevant, a nivell de gestió del servei, entre robots Attended i Unattended a UiPath?",
    "answerOptions": [
      {
        "text": "Els Unattended poden executar processos sense intervenció humana i ser orquestrats per Orchestrator",
        "isCorrect": true,
        "rationale": "Aquesta diferència és clau per a l'automatització de serveis corporatius."
      },
      {
        "text": "Els Attended tenen millor rendiment que els Unattended",
        "isCorrect": false,
        "rationale": "El rendiment no depèn del tipus de robot sinó del disseny del procés."
      },
      {
        "text": "Els Unattended només poden executar-se en entorns cloud",
        "isCorrect": false,
        "rationale": "Poden executar-se tant on‑prem com al núvol."
      },
      {
        "text": "Els Attended no poden accedir a sistemes corporatius",
        "isCorrect": false,
        "rationale": "Poden accedir-hi, però amb limitacions d'orquestració."
      }
    ]
  },
  {
    "guid": "c3d4e5f6-7a8b-4c9d-9e03-313233343503",
    "subjectId": "T30",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "En la gestió de credencials a UiPath, quin mecanisme és el MÉS adequat en un entorn d'administració pública?",
    "answerOptions": [
      {
        "text": "L'ús de l'Asset tipus Credential integrat amb un vault corporatiu",
        "isCorrect": true,
        "rationale": "Permet una gestió segura, auditada i alineada amb bones pràctiques."
      },
      {
        "text": "Variables locals en els workflows",
        "isCorrect": false,
        "rationale": "No és una pràctica segura ni governable."
      },
      {
        "text": "Fitxers de configuració en text pla",
        "isCorrect": false,
        "rationale": "Exposa credencials i incompleix requisits de seguretat."
      },
      {
        "text": "Introducció manual per part de l'usuari",
        "isCorrect": false,
        "rationale": "No és escalable ni adequada per a robots Unattended."
      }
    ]
  },
  {
    "guid": "d4e5f6a7-8b9c-4d0e-9f04-414243444504",
    "subjectId": "T30",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Quina pràctica és clau per garantir l'escalabilitat dels serveis RPA gestionats amb UiPath?",
    "answerOptions": [
      {
        "text": "Dissenyar processos desacoblats, reutilitzables i orientats a excepcions",
        "isCorrect": true,
        "rationale": "L'arquitectura del procés és clau per escalar el servei."
      },
      {
        "text": "Incrementar el nombre de robots sense revisar els processos",
        "isCorrect": false,
        "rationale": "Escalar robots sense redissenyar processos genera ineficiències."
      },
      {
        "text": "Centralitzar tota la lògica en un únic workflow",
        "isCorrect": false,
        "rationale": "Això dificulta el manteniment i l'escalabilitat."
      },
      {
        "text": "Evitar la gestió d'excepcions",
        "isCorrect": false,
        "rationale": "La gestió d'excepcions és essencial en entorns reals."
      }
    ]
  },
  {
    "guid": "e5f6a7b8-9c0d-4e1f-9025-515253545505",
    "subjectId": "T30",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "En un model de governança RPA, quin indicador (KPI) és MÉS adequat per avaluar la qualitat del servei?",
    "answerOptions": [
      {
        "text": "Percentatge d'execucions exitoses amb gestió correcta d'excepcions",
        "isCorrect": true,
        "rationale": "Reflecteix estabilitat i maduresa del servei RPA."
      },
      {
        "text": "Nombre total de robots desplegats",
        "isCorrect": false,
        "rationale": "La quantitat no garanteix qualitat."
      },
      {
        "text": "Línies de codi dels workflows",
        "isCorrect": false,
        "rationale": "No és un indicador de qualitat del servei."
      },
      {
        "text": "Temps de desenvolupament inicial",
        "isCorrect": false,
        "rationale": "No mesura el funcionament continuat del servei."
      }
    ]
  },
  {
    "guid": "f101a2b3-c4d5-4e6f-9011-616263646601",
    "subjectId": "T30",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "En un entorn UiPath amb diversos processos crítics, quina és la configuració MÉS adequada d'Orchestrator per garantir continuïtat del servei?",
    "answerOptions": [
      {
        "text": "Definir cues separades per procés, amb gestió de prioritats i mecanismes de reintent",
        "isCorrect": true,
        "rationale": "Permet aïllar fallades, prioritzar càrregues i millorar la resiliència del servei."
      },
      {
        "text": "Centralitzar totes les transaccions en una única cua global",
        "isCorrect": false,
        "rationale": "Pot simplificar la gestió però incrementa el risc d'impacte transversal."
      },
      {
        "text": "Executar tots els processos en un únic robot Unattended",
        "isCorrect": false,
        "rationale": "Genera un punt únic de fallada."
      },
      {
        "text": "Programar les execucions manualment segons disponibilitat",
        "isCorrect": false,
        "rationale": "No és escalable ni garanteix continuïtat."
      }
    ]
  },
  {
    "guid": "f202b3c4-d5e6-4f70-9122-717273747602",
    "subjectId": "T30",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Quina és la pràctica MÉS adequada per gestionar versions de processos RPA en producció amb UiPath?",
    "answerOptions": [
      {
        "text": "Utilitzar paquets versionats, entorns separats i control de desplegament via Orchestrator",
        "isCorrect": true,
        "rationale": "És la pràctica recomanada per garantir control i traçabilitat."
      },
      {
        "text": "Sobreescriure directament el procés existent en producció",
        "isCorrect": false,
        "rationale": "Incrementa el risc operatiu i dificulta la reversió."
      },
      {
        "text": "Mantenir una única versió del workflow",
        "isCorrect": false,
        "rationale": "No permet gestió controlada de canvis."
      },
      {
        "text": "Desplegar canvis directament des de Studio",
        "isCorrect": false,
        "rationale": "No és adequat en entorns governats."
      }
    ]
  },
  {
    "guid": "f303c4d5-e6f7-4081-9233-818283848603",
    "subjectId": "T30",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "En la gestió operativa del servei RPA, quin és el risc MÉS rellevant de no gestionar adequadament les excepcions?",
    "answerOptions": [
      {
        "text": "Generar interrupcions silencioses del servei amb impacte en processos de negoci",
        "isCorrect": true,
        "rationale": "Les excepcions no gestionades poden aturar processos sense detecció immediata."
      },
      {
        "text": "Incrementar lleugerament el temps d'execució",
        "isCorrect": false,
        "rationale": "No és el risc principal."
      },
      {
        "text": "Reduir la reutilització de components",
        "isCorrect": false,
        "rationale": "És un efecte secundari, no el risc clau."
      },
      {
        "text": "Augmentar el nombre de robots necessaris",
        "isCorrect": false,
        "rationale": "No és una conseqüència directa."
      }
    ]
  },
  {
    "guid": "f404d5e6-f708-4a92-9344-919293949604",
    "subjectId": "T30",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Quina funcionalitat d'UiPath facilita MÉS la supervisió del compliment d'SLA en serveis RPA?",
    "answerOptions": [
      {
        "text": "Dashboards i alertes d'Orchestrator basats en estats i resultats d'execució",
        "isCorrect": true,
        "rationale": "Permeten monitoritzar temps, errors i volum de treball."
      },
      {
        "text": "Logs locals dels robots",
        "isCorrect": false,
        "rationale": "Són necessaris però no suficients per a visió de servei."
      },
      {
        "text": "Anotacions manuals dels operadors",
        "isCorrect": false,
        "rationale": "No és fiable ni automatitzat."
      },
      {
        "text": "Revisió periòdica del codi",
        "isCorrect": false,
        "rationale": "No mesura el compliment operatiu d'SLA."
      }
    ]
  },
  {
    "guid": "f505e6f7-0819-4b03-9455-a1a2a3a4a605",
    "subjectId": "T30",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "En un context d'administració pública, quin aspecte és MÉS crític a l'hora de definir un catàleg de serveis RPA?",
    "answerOptions": [
      {
        "text": "Establir criteris clars de priorització, impacte i responsabilitats del servei",
        "isCorrect": true,
        "rationale": "És essencial per garantir transparència i alineació amb el servei públic."
      },
      {
        "text": "Maximitzar el nombre de processos automatitzats",
        "isCorrect": false,
        "rationale": "La quantitat no garanteix valor públic."
      },
      {
        "text": "Reduir al mínim la documentació",
        "isCorrect": false,
        "rationale": "La documentació és clau en entorns públics."
      },
      {
        "text": "Delegar la gestió del catàleg al proveïdor",
        "isCorrect": false,
        "rationale": "La responsabilitat del servei ha de ser interna."
      }
    ]
  }
]
