[
    {
        "guid": "45fd4493-bee0-41c0-a86a-8240ea52f489",
        "subjectId": "T64",
        "difficulty": 2,
        "origin": "OPOS19_preguntes_especific.pdf",
        "type": "test",
        "question": "35. Quines de les següents afirmacions correspon al projecte Sentilo, premi Open Awards 2016, com a plataforma més innovadora en software lliure i a data d'avui adoptada per varies ciutats?",
        "answerOptions": [
            {
                "text": "A. És una plataforma de participació digital i democràtica que vol donar la veu a la ciutadania perquè decideixi sobre el futur del seu entorn.",
                "isCorrect": false,
                "rationale": "Sentilo no és una plataforma de participació ciutadana sinó de sensors i dades urbanes."
            },
            {
                "text": "B. És una plataforma per a gestionar millor les dades de la ciutat, tenir controls de qualitat, privacitat i seguretat més efectius.",
                "isCorrect": false,
                "rationale": "Tot i que gestiona dades de ciutat, aquesta no és la seva definició principal segons la UNE178104."
            },
            {
                "text": "C. És una plataforma que recull informació de sensors actius repartits per la ciutat, recopila i comparteix dades en temps real.",
                "isCorrect": true,
                "rationale": "Sentilo és una plataforma oberta basada en sensors que opera a la capa d’adquisició segons la norma UNE178104."
            },
            {
                "text": "D. És una plataforma de visualització de dades que explica l’estat de la ciutat en temps real per facilitar el monitoratge i seguiment de polítiques públiques.",
                "isCorrect": false,
                "rationale": "Aquesta definició descriu més aviat una eina d’analítica o de visualització de dades, no el rol tècnic de Sentilo."
            }
        ],
        "hint": "Pensa en el rol tècnic que juga Sentilo dins de l’arquitectura d’una Smart City segons la UNE178104."
    },
    {
        "guid": "ef42e82e-5328-4632-8c5d-6f884b14d91e",
        "subjectId": "T64",
        "difficulty": 3,
        "origin": "OPOS21_preguntes_especific.pdf",
        "type": "test",
        "question": "52. Atenent a la visió de capes proposada per la norma UNE178104, sobre interoperabilitat de plataformes de ciutats intel·ligents, en informació pública, a l’hora d’integrar serveis en un entorn urbà de ciutats intel·ligents, Sentilo: (Indiqueu quina afirmació és CORRECTA)",
        "answerOptions": [
            {
                "text": "A. S’integra a la capa d’OpenData.",
                "isCorrect": false,
                "rationale": "L’Open Data és una capa superior, relacionada amb la publicació de dades, no amb la captació."
            },
            {
                "text": "B. Forma part d’una capa baixa, coneguda també com a capa d’adquisició.",
                "isCorrect": true,
                "rationale": "Segons la UNE178104, Sentilo actua a la capa d’adquisició de dades (recollida i sensors)."
            },
            {
                "text": "C. Actua com a interfície entre la capa d’OpenData i la de coneixement.",
                "isCorrect": false,
                "rationale": "Aquest paper correspon a la capa d’interoperabilitat o d’integració, no a Sentilo."
            },
            {
                "text": "D. Forma part de la semàntica de ciutat.",
                "isCorrect": false,
                "rationale": "La semàntica de ciutat defineix models de dades i ontologies, no plataformes d’adquisició com Sentilo."
            }
        ],
        "hint": "Recorda les capes de la UNE178104: adquisició → interoperabilitat → serveis → open data → coneixement."
    },
    {
        "guid": "3aa7b4f7-0449-4543-9cf2-cffbdf41bca9",
        "subjectId": "T64",
        "difficulty": 1,
        "origin": "OPOS19_preguntes_especific.pdf",
        "type": "test",
        "question": "53. En una aplicació smart cities es pretén primer captar les dades del desplegament de sensorització en la trama urbana, després manegar un volum de dades generades de l’ordre de magnitud de Terabytes per després obtenir informació rellevant per a la presa de decisions. Quina seqüència de paradigmes tecnològics es fa servir?",
        "answerOptions": [
            {
                "text": "A. BI – ERP – IoT.",
                "isCorrect": false,
                "rationale": "L’ordre és incorrecte, primer s’aplica la captura amb IoT, després l’anàlisi amb Big Data i finalment la intel·ligència amb BI."
            },
            {
                "text": "B. IoT – Big Data – BI.",
                "isCorrect": true,
                "rationale": "És la seqüència lògica en les Smart Cities: sensors (IoT), anàlisi massiva (Big Data), i explotació de la informació (BI)."
            },
            {
                "text": "C. CRM – ERP – BPM.",
                "isCorrect": false,
                "rationale": "Són eines de gestió empresarial, no relacionades amb l’arquitectura Smart City."
            },
            {
                "text": "D. BI – CRM – GIS.",
                "isCorrect": false,
                "rationale": "GIS pot ser part de la representació de dades, però no segueix la seqüència funcional de captura-anàlisi-explotació."
            }
        ],
        "hint": "Segueix el flux natural: sensors → dades massives → informació útil per a la decisió."
    }
]