[
  {
    "guid": "e9b1a8c3-2f42-43a1-bb8b-11fd2d0f3348",
    "subjectId": "T66",
    "difficulty": 2,
    "origin": "OPOS19_preguntes_practic.pdf",
    "type": "oposXX",
    "question": "El RGPD (Reglament General de Protecció de Dades), preceptua la directriu privacy by design o privacitat des del disseny del sistema d’informació i regula la seva aplicació mitjançant una Avaluació d’Impacte Relativa a la Protecció de Dades (EIPD en castellà). En aquest projecte es decideix fer una EIPD per al Lot 2, tot considerant que es tractaran dades personals dins dels supòsits establerts pel RGPD. Quan s’hauria d’aplicar aquesta avaluació?",
    "answerOptions": [
      {
        "text": "A. A l’inici de la posada en producció del sistema d’informació tot copsant la qualitat i quantitat de les dades de caràcter personal recollides.",
        "isCorrect": false,
        "rationale": "Incorrecte. S’ha de fer abans del tractament, no un cop ja en producció."
      },
      {
        "text": "B. Abans del tractament de dades en producció, amb caràcter d’auditoria prèvia.",
        "isCorrect": true,
        "rationale": "Correcte. El RGPD estableix que l’avaluació d’impacte s’ha de fer abans de començar el tractament."
      },
      {
        "text": "C. Transcorregut el primer any d’explotació del sistema d’informació un cop es tingui prou dades significatives.",
        "isCorrect": false,
        "rationale": "Incorrecte. L’avaluació ha de ser prèvia al tractament, no posterior."
      },
      {
        "text": "D. Coincidint amb l’auditoria d’acompliment de l’Esquema Nacional de Seguretat (ENS) cada dos o tres anys.",
        "isCorrect": false,
        "rationale": "Incorrecte. L’EIPD és independent de l’auditoria ENS."
      }
    ],
    "hint": "Recorda: el principi de privacitat des del disseny exigeix fer l’avaluació abans d’iniciar el tractament."
  },
  {
    "guid": "b4ad26e4-9736-4e68-aad0-f8d8e06e2731",
    "subjectId": "T66",
    "difficulty": 2,
    "origin": "OPOS21_preguntes_especific.pdf",
    "type": "oposXX",
    "question": "En el context del Reglament (UE) 2016/679 del Parlament Europeu i del Consell de 27 d'abril de 2016, relatiu a la protecció de les persones físiques pel que fa al tractament de dades personals i a la lliure circulació d'aquestes dades (RGPD), el dret de supressió o “dret a l’oblit”:",
    "answerOptions": [
      {
        "text": "A. És una visió parcial de les dades personals que dona rellevància a determinades dades.",
        "isCorrect": false,
        "rationale": "Incorrecte. No es tracta d’una classificació de dades."
      },
      {
        "text": "B. És una facultat potestativa que té la persona interessada per la qual aquesta pot eludir certes responsabilitats passat cert període temps.",
        "isCorrect": false,
        "rationale": "Incorrecte. No permet eludir responsabilitats legals."
      },
      {
        "text": "C. És un dels drets de la persona interessada que permet la supressió de dades personals en determinades circumstàncies.",
        "isCorrect": true,
        "rationale": "Correcte. És el dret de supressió reconegut pel RGPD."
      },
      {
        "text": "D. El RGPD no fa cap menció sobre aquest aspecte.",
        "isCorrect": false,
        "rationale": "Incorrecte. El dret de supressió està explícitament recollit al RGPD."
      }
    ],
    "hint": "El dret a l’oblit és un dels drets ARCO-POL reconeguts pel RGPD."
  },
  {
    "guid": "f22e1cf7-1a83-4805-9d7d-81a83740c437",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "OPOS21_preguntes_especific.pdf",
    "type": "oposXX",
    "question": "El Reglament (UE) 2016/679 del Parlament Europeu i del Consell de 27 d'abril del 2016, relatiu a la protecció de les persones físiques pel que fa al tractament de dades personals i a la lliure circulació d'aquestes dades (RGPD), defineix fitxer com:",
    "answerOptions": [
      {
        "text": "A. Qualsevol conjunt estructurat de dades accessibles d’acord amb criteris determinats, ja sigui centralitzat, descentralitzat o repartit de forma funcional o geogràfica.",
        "isCorrect": false,
        "rationale": "Incorrecte. Falta especificar que són dades personals."
      },
      {
        "text": "B. Qualsevol conjunt estructurat de dades personals accessibles d’acord amb criteris determinats, ja sigui centralitzat, descentralitzat o repartit de forma funcional o geogràfica.",
        "isCorrect": true,
        "rationale": "Correcte. És la definició literal de fitxer segons el RGPD."
      },
      {
        "text": "C. Qualsevol conjunt de registres degudament tipificats i agrupats per a la seva posterior explotació.",
        "isCorrect": false,
        "rationale": "Incorrecte. Aquesta definició no apareix al RGPD."
      },
      {
        "text": "D. Qualsevol conjunt de registres susceptible de ser incorporat a bases de dades interoperables entre elles i independentment dels sistemes que l’operen.",
        "isCorrect": false,
        "rationale": "Incorrecte. No és una definició reconeguda al reglament."
      }
    ],
    "hint": "Només és fitxer RGPD si conté dades personals."
  },
  {
    "guid": "01cda69f-7df9-4f2c-bd7d-5fa84e7cc35a",
    "subjectId": "T66",
    "difficulty": 2,
    "origin": "OPOS23_preguntes_especific.pdf",
    "type": "oposXX",
    "question": "En relació a les autoritats de control de protecció de dades, què estableix el Reglament General de Protecció de Dades (RGPD)?",
    "answerOptions": [
      {
        "text": "A. El RGPD estableix com a voluntari l’establiment d’autoritats de control.",
        "isCorrect": false,
        "rationale": "Incorrecte. No és opcional, és obligatori."
      },
      {
        "text": "B. El RGPD obliga als estats membres a establir una única autoritat de control, quedant prohibida l’existència de més d’una.",
        "isCorrect": false,
        "rationale": "Incorrecte. Pot haver-hi més d’una autoritat per estat membre."
      },
      {
        "text": "C. El RGPD no regula les autoritats de control, les autoritats de control només queden regulades en les lleis de cada estat membre, en el cas d’España en la Llei Orgànica 3/2018, de 5 de desembre.",
        "isCorrect": false,
        "rationale": "Incorrecte. El RGPD sí que regula explícitament les autoritats de control."
      },
      {
        "text": "D. El RGPD determina que, cada estat membre, establirà una o vàries autoritats de control independents.",
        "isCorrect": true,
        "rationale": "Correcte. L’article 51 RGPD estableix autoritats de control independents per cada estat membre."
      }
    ],
    "hint": "El RGPD preveu autoritats de control independents, no necessàriament úniques."
  },



  {
    "guid": "a7dbeec1-8d12-4d2f-8a59-6b3b03a34c84",
    "subjectId": "T66",
    "difficulty": 3,
    "origin": "OPOS23_preguntes_practic.pdf",
    "type": "oposXX",
    "question": "L’Ajuntament contracta una empresa externa per gestionar els servidors de còpies de seguretat on s’emmagatzemen dades personals dels ciutadans. Segons el Reglament (UE) 2016/679 (RGPD), aquesta empresa externa és considerada:",
    "answerOptions": [
      {
        "text": "A. Responsable del tractament, perquè decideix els mitjans tècnics.",
        "isCorrect": false,
        "rationale": "Incorrecte. Decideix mitjans tècnics, però actua per compte de l’Ajuntament."
      },
      {
        "text": "B. Encarregada del tractament, perquè tracta dades personals per compte del responsable.",
        "isCorrect": true,
        "rationale": "Correcte. L’article 4.8 RGPD defineix l’encarregat com qui tracta dades per compte del responsable."
      },
      {
        "text": "C. Corresponsable del tractament, ja que comparteix la responsabilitat de protecció de dades amb el client.",
        "isCorrect": false,
        "rationale": "Incorrecte. No pren decisions conjuntes sobre la finalitat ni mitjans essencials."
      },
      {
        "text": "D. Delegat de Protecció de Dades, ja que actua en representació de l’Ajuntament.",
        "isCorrect": false,
        "rationale": "Incorrecte. El DPD és una figura assessora i independent, no una empresa proveïdora."
      }
    ],
    "hint": "Recorda: l’Ajuntament és el responsable i l’empresa externa és l’encarregada del tractament."
  },
  {
    "guid": "d8c012ce-83cb-4f69-9883-02edb41280a7",
    "subjectId": "T66",
    "difficulty": 2,
    "origin": "OPOS23_preguntes_practic.pdf",
    "type": "oposXX",
    "question": "Segons el Reglament General de Protecció de Dades (RGPD), quin dels següents elements és OBLIGATORI en un contracte entre un responsable i un encarregat del tractament?",
    "answerOptions": [
      {
        "text": "A. El nom i cognoms de totes les persones que tindran accés a les dades.",
        "isCorrect": false,
        "rationale": "Incorrecte. El contracte no requereix identificar cada persona individualment."
      },
      {
        "text": "B. Les instruccions documentades del responsable sobre el tractament de dades.",
        "isCorrect": true,
        "rationale": "Correcte. L’article 28 RGPD estableix que l’encarregat només pot tractar dades segons les instruccions documentades del responsable."
      },
      {
        "text": "C. La garantia que les dades es conservaran durant un període mínim de deu anys.",
        "isCorrect": false,
        "rationale": "Incorrecte. El RGPD no fixa cap termini de conservació concret."
      },
      {
        "text": "D. La signatura del Delegat de Protecció de Dades com a testimoni de compliment.",
        "isCorrect": false,
        "rationale": "Incorrecte. El DPD no forma part necessària del contracte."
      }
    ],
    "hint": "El contracte ha de deixar clar que l’encarregat només tracta dades seguint instruccions del responsable."
  },
  {
    "guid": "e3d94019-d8a0-4a5a-b62c-0e8b7e55fa33",
    "subjectId": "T66",
    "difficulty": 3,
    "origin": "OPOS21_preguntes_practic.pdf",
    "type": "oposXX",
    "question": "Un Departament municipal ha subcontractat una empresa perquè desenvolupi una aplicació mòbil que reculli informació de persones usuàries. Durant les proves, es detecta que la versió beta envia dades personals a un servidor extern situat als Estats Units. Quina mesura és correcta segons el RGPD?",
    "answerOptions": [
      {
        "text": "A. No hi ha problema, sempre que la transferència es faci amb protocols segurs com HTTPS.",
        "isCorrect": false,
        "rationale": "Incorrecte. La seguretat tècnica no substitueix el compliment de les garanties legals per transferències internacionals."
      },
      {
        "text": "B. Es pot fer la transferència si el servidor està dins d’un país amb decisió d’adequació de la Comissió Europea.",
        "isCorrect": true,
        "rationale": "Correcte. Només es poden transferir dades fora de la UE si el país garanteix un nivell adequat de protecció o hi ha clàusules tipus."
      },
      {
        "text": "C. L’Ajuntament no és responsable perquè el desenvolupament està subcontractat.",
        "isCorrect": false,
        "rationale": "Incorrecte. El responsable del tractament segueix sent l’Ajuntament."
      },
      {
        "text": "D. Cal autorització expressa del Delegat de Protecció de Dades abans de qualsevol prova de software.",
        "isCorrect": false,
        "rationale": "Incorrecte. El DPD assessora, però no autoritza tractaments."
      }
    ],
    "hint": "Les transferències internacionals de dades només són vàlides si el país té una decisió d’adequació o garanties adequades."
  },
  {
    "guid": "b7ef46e2-bd60-42b1-99f9-38fd7d93caa1",
    "subjectId": "T66",
    "difficulty": 2,
    "origin": "OPOS23_preguntes_practic.pdf",
    "type": "oposXX",
    "question": "Durant la implantació d’un nou sistema d’informació, sorgeix un incident de seguretat en què es filtren dades personals. Segons el RGPD, en quin termini s’ha de notificar aquesta violació a l’autoritat competent?",
    "answerOptions": [
      {
        "text": "A. En un termini màxim de 24 hores des del coneixement dels fets.",
        "isCorrect": false,
        "rationale": "Incorrecte. El termini és de 72 hores, no de 24."
      },
      {
        "text": "B. En un termini màxim de 72 hores des del moment en què es té coneixement de la violació.",
        "isCorrect": true,
        "rationale": "Correcte. L’article 33 RGPD estableix el termini màxim de 72 hores per notificar l’autoritat de control."
      },
      {
        "text": "C. En un termini màxim de 7 dies laborables.",
        "isCorrect": false,
        "rationale": "Incorrecte. El RGPD no preveu terminis setmanals."
      },
      {
        "text": "D. Només cal notificar si l’incident ha afectat més de mil persones.",
        "isCorrect": false,
        "rationale": "Incorrecte. No hi ha un llindar numèric; depèn del risc per als drets i llibertats dels afectats."
      }
    ],
    "hint": "Les violacions de seguretat s’han de notificar a l’autoritat competent dins les 72 hores."
  },




  {
    "guid": "b8e13e02-42cd-4f45-8b1b-b5b7c62a3a33",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Quin és l’objectiu principal del Reglament (UE) 2016/679, conegut com a RGPD?",
    "answerOptions": [
      {
        "text": "A. Regular el comerç electrònic dins de la Unió Europea.",
        "isCorrect": false,
        "rationale": "Incorrecte. El RGPD no tracta qüestions comercials sinó de protecció de dades."
      },
      {
        "text": "B. Garantir la protecció de les persones físiques pel que fa al tractament de dades personals i a la lliure circulació d’aquestes dades.",
        "isCorrect": true,
        "rationale": "Correcte. És l’objectiu central del RGPD segons l’article 1."
      },
      {
        "text": "C. Regular el tractament de dades dels estats membres en matèria de seguretat nacional.",
        "isCorrect": false,
        "rationale": "Incorrecte. El RGPD no s’aplica a activitats de seguretat nacional."
      },
      {
        "text": "D. Garantir la interoperabilitat dels sistemes d’informació públics.",
        "isCorrect": false,
        "rationale": "Incorrecte. El RGPD no regula la interoperabilitat sinó la privacitat."
      }
    ],
    "hint": "L’article 1 del RGPD defineix clarament el seu doble objectiu: protecció i lliure circulació de dades."
  },
  {
    "guid": "c6e8de76-91e2-48d8-9b5e-3ac6e98959e8",
    "subjectId": "T66",
    "difficulty": 2,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Segons el RGPD, quan és lícit el tractament de dades personals?",
    "answerOptions": [
      {
        "text": "A. Quan l’usuari ha donat consentiment explícit o tàcit.",
        "isCorrect": false,
        "rationale": "Incorrecte. El consentiment tàcit no és vàlid segons el RGPD."
      },
      {
        "text": "B. Quan existeix almenys una de les bases legals previstes al Reglament.",
        "isCorrect": true,
        "rationale": "Correcte. L’article 6 RGPD estableix sis bases legals per a la licitud del tractament."
      },
      {
        "text": "C. Només quan s’hagi autoritzat per l’Agència Espanyola de Protecció de Dades.",
        "isCorrect": false,
        "rationale": "Incorrecte. L’autorització de l’AEPD no és requisit general."
      },
      {
        "text": "D. Quan les dades es recullen de fonts accessibles al públic.",
        "isCorrect": false,
        "rationale": "Incorrecte. Les fonts públiques no legitimen per si soles el tractament."
      }
    ],
    "hint": "El RGPD reconeix sis bases jurídiques de tractament: consentiment, contracte, obligació legal, interès vital, interès públic i interès legítim."
  },
  {
    "guid": "fc26a45e-7d67-43ab-a7a5-01749722e67e",
    "subjectId": "T66",
    "difficulty": 2,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "El principi de minimització de dades estableix que:",
    "answerOptions": [
      {
        "text": "A. Només es poden recollir les dades adequades, pertinents i limitades al necessari en relació amb les finalitats del tractament.",
        "isCorrect": true,
        "rationale": "Correcte. Això defineix literalment el principi de minimització segons l’article 5.1.c del RGPD."
      },
      {
        "text": "B. Cal conservar totes les dades possibles per garantir la traçabilitat de l’activitat.",
        "isCorrect": false,
        "rationale": "Incorrecte. Contradiu el principi de minimització."
      },
      {
        "text": "C. Les dades s’han de recollir en el major nombre possible de fonts per garantir la seva fiabilitat.",
        "isCorrect": false,
        "rationale": "Incorrecte. No es tracta de quantitat sinó de necessitat."
      },
      {
        "text": "D. Només poden tractar-se dades anonimitzades.",
        "isCorrect": false,
        "rationale": "Incorrecte. El principi de minimització no exigeix anonimització."
      }
    ],
    "hint": "Minimització significa tractar només les dades estrictament necessàries."
  },
  {
    "guid": "3c46e2cf-0b98-4aa8-b60a-913b2f52a61d",
    "subjectId": "T66",
    "difficulty": 3,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "En quin cas és obligatori designar un Delegat de Protecció de Dades (DPD)?",
    "answerOptions": [
      {
        "text": "A. Sempre que una empresa faci servir fitxers electrònics amb dades personals.",
        "isCorrect": false,
        "rationale": "Incorrecte. No és obligatori per a qualsevol tractament."
      },
      {
        "text": "B. Quan el responsable o l’encarregat sigui una autoritat o organisme públic.",
        "isCorrect": true,
        "rationale": "Correcte. L’article 37 RGPD estableix l’obligatorietat per a les autoritats públiques."
      },
      {
        "text": "C. Només quan el volum de dades superi els 10.000 registres.",
        "isCorrect": false,
        "rationale": "Incorrecte. El volum no és el criteri determinant."
      },
      {
        "text": "D. Quan el tractament impliqui dades de menors d’edat, sempre.",
        "isCorrect": false,
        "rationale": "Incorrecte. No és automàtic, depèn de la naturalesa i escala del tractament."
      }
    ],
    "hint": "Les administracions públiques tenen l’obligació de designar un DPD."
  },
  {
    "guid": "c11cb4a0-15d2-4c71-8105-25c377e2cb91",
    "subjectId": "T66",
    "difficulty": 3,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Segons el RGPD, en quin termini s’ha de notificar una violació de seguretat a l’autoritat de control competent?",
    "answerOptions": [
      {
        "text": "A. En un termini màxim de 24 hores des que s’ha produït la incidència.",
        "isCorrect": false,
        "rationale": "Incorrecte. El termini és de 72 hores."
      },
      {
        "text": "B. En un termini màxim de 72 hores des que el responsable en té coneixement.",
        "isCorrect": true,
        "rationale": "Correcte. Article 33 RGPD: notificació a l’autoritat en 72 hores."
      },
      {
        "text": "C. En un termini màxim de 7 dies naturals.",
        "isCorrect": false,
        "rationale": "Incorrecte. El reglament no estableix terminis setmanals."
      },
      {
        "text": "D. No hi ha cap termini específic, depèn del risc de la bretxa.",
        "isCorrect": false,
        "rationale": "Incorrecte. El termini de 72 hores és fix."
      }
    ],
    "hint": "El compte enrere comença en el moment en què el responsable té coneixement de la bretxa."
  },
  {
    "guid": "b1d75a88-4a3b-4f23-b583-4e6727a0d6b2",
    "subjectId": "T66",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Quina afirmació sobre les transferències internacionals de dades és correcta segons el RGPD?",
    "answerOptions": [
      {
        "text": "A. Es poden fer lliurement a qualsevol país si les dades estan xifrades.",
        "isCorrect": false,
        "rationale": "Incorrecte. El xifrat no substitueix les garanties legals."
      },
      {
        "text": "B. Només es poden fer si la Comissió Europea ha dictat una decisió d’adequació o s’apliquen garanties adequades.",
        "isCorrect": true,
        "rationale": "Correcte. Articles 45 i 46 RGPD defineixen aquests mecanismes."
      },
      {
        "text": "C. Es poden fer sempre que hi hagi consentiment oral de la persona interessada.",
        "isCorrect": false,
        "rationale": "Incorrecte. El consentiment ha de ser explícit i informat, i no és l’única via."
      },
      {
        "text": "D. No es poden fer sota cap circumstància.",
        "isCorrect": false,
        "rationale": "Incorrecte. El RGPD les permet amb garanties adequades."
      }
    ],
    "hint": "Les decisions d’adequació o clàusules tipus permeten transferències internacionals legals."
  },
  {
    "guid": "e5f8344a-3e83-47e8-8613-42b981d54147",
    "subjectId": "T66",
    "difficulty": 2,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Quin és el principi que obliga el responsable del tractament a poder demostrar el compliment del RGPD?",
    "answerOptions": [
      {
        "text": "A. Principi de transparència.",
        "isCorrect": false,
        "rationale": "Incorrecte. La transparència fa referència a la informació a l’interessat."
      },
      {
        "text": "B. Principi de responsabilitat proactiva.",
        "isCorrect": true,
        "rationale": "Correcte. El responsable ha de poder demostrar el compliment davant l’autoritat de control."
      },
      {
        "text": "C. Principi d’exactitud.",
        "isCorrect": false,
        "rationale": "Incorrecte. L’exactitud s’aplica a la qualitat de les dades, no al compliment."
      },
      {
        "text": "D. Principi de proporcionalitat.",
        "isCorrect": false,
        "rationale": "Incorrecte. Aquest principi no figura expressament al RGPD."
      }
    ],
    "hint": "La responsabilitat proactiva implica documentar i evidenciar el compliment del RGPD."
  },



  {
    "guid": "29a4d6d5-892b-4408-8b25-3faefb93b224",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Quina d’aquestes dades NO es considera dada personal segons el RGPD?",
    "answerOptions": [
      {
        "text": "A. L’adreça IP d’un ordinador particular.",
        "isCorrect": false,
        "rationale": "Incorrecte. Una IP pot identificar una persona física i és dada personal."
      },
      {
        "text": "B. El número de DNI d’una persona.",
        "isCorrect": false,
        "rationale": "Incorrecte. És clarament una dada personal identificativa."
      },
      {
        "text": "C. Les dades estadístiques anonimitzades de trànsit viari sense identificadors individuals.",
        "isCorrect": true,
        "rationale": "Correcte. Si no permeten identificar cap persona, no són dades personals."
      },
      {
        "text": "D. L’adreça de correu electrònic laboral d’un empleat públic.",
        "isCorrect": false,
        "rationale": "Incorrecte. És una dada personal vinculada a una persona física."
      }
    ],
    "hint": "Només les dades completament anonimitzades deixen de ser personals."
  },
  {
    "guid": "bc5d3ef6-7cbe-4ad3-b25d-5a97e1f62c3b",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Quin dels següents drets reconeix expressament el RGPD?",
    "answerOptions": [
      {
        "text": "A. Dret a la transparència tributària.",
        "isCorrect": false,
        "rationale": "Incorrecte. No forma part dels drets de protecció de dades."
      },
      {
        "text": "B. Dret a la portabilitat de les dades.",
        "isCorrect": true,
        "rationale": "Correcte. És un dels drets nous incorporats pel RGPD."
      },
      {
        "text": "C. Dret a la propietat digital.",
        "isCorrect": false,
        "rationale": "Incorrecte. No és un dret reconegut al RGPD."
      },
      {
        "text": "D. Dret a la desconnexió digital.",
        "isCorrect": false,
        "rationale": "Incorrecte. Aquest dret s’inclou a la LOPDGDD, no al RGPD."
      }
    ],
    "hint": "El RGPD introdueix nous drets com portabilitat i limitació del tractament."
  },
  {
    "guid": "14a7d65d-61e5-46e3-8095-4e256bdb7b5d",
    "subjectId": "T66",
    "difficulty": 2,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Quina de les següents afirmacions sobre el consentiment és correcta segons el RGPD?",
    "answerOptions": [
      {
        "text": "A. El consentiment tàcit és vàlid si l’usuari no s’hi oposa explícitament.",
        "isCorrect": false,
        "rationale": "Incorrecte. El consentiment ha de ser inequívoc i explícit."
      },
      {
        "text": "B. El consentiment pot retirar-se en qualsevol moment sense efectes retroactius.",
        "isCorrect": true,
        "rationale": "Correcte. El RGPD reconeix el dret a retirar el consentiment en qualsevol moment."
      },
      {
        "text": "C. El consentiment només és vàlid si es formalitza per escrit davant notari.",
        "isCorrect": false,
        "rationale": "Incorrecte. No cal formalitat notarial; pot ser electrònic o verbal, si és verificable."
      },
      {
        "text": "D. El consentiment només és necessari per a dades sensibles.",
        "isCorrect": false,
        "rationale": "Incorrecte. També s’aplica a dades ordinàries si no hi ha una altra base legal."
      }
    ],
    "hint": "El consentiment ha de ser lliure, informat, específic i inequívoc."
  },
  {
    "guid": "9c4de6b7-d5b0-4c3a-9e12-d3f47f4e9a12",
    "subjectId": "T66",
    "difficulty": 3,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Quin dels següents tractaments requereix una Avaluació d’Impacte relativa a la Protecció de Dades (EIPD)?",
    "answerOptions": [
      {
        "text": "A. Un sistema de gestió de nòmines amb accés restringit al personal de Recursos Humans.",
        "isCorrect": false,
        "rationale": "Incorrecte. És un tractament habitual amb risc limitat."
      },
      {
        "text": "B. Un sistema de reconeixement facial per controlar accessos a edificis municipals.",
        "isCorrect": true,
        "rationale": "Correcte. Implica vigilància sistemàtica i dades biomètriques, considerades de risc alt."
      },
      {
        "text": "C. L’enviament d’un butlletí informatiu a ciutadans subscrits.",
        "isCorrect": false,
        "rationale": "Incorrecte. No presenta un risc elevat per als drets fonamentals."
      },
      {
        "text": "D. El registre intern d’incidències informàtiques sense dades personals.",
        "isCorrect": false,
        "rationale": "Incorrecte. No hi ha tractament de dades personals."
      }
    ],
    "hint": "L’article 35 RGPD obliga a fer EIPD en tractaments amb alt risc (biometria, vigilància, perfilatge...)."
  },
  {
    "guid": "cba2a167-2339-4d34-bf55-3d95f1554162",
    "subjectId": "T66",
    "difficulty": 3,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Quina diferència principal hi ha entre anonimització i pseudonimització segons el RGPD?",
    "answerOptions": [
      {
        "text": "A. Cap diferència: tots dos processos eliminen la identitat de l’usuari de manera permanent.",
        "isCorrect": false,
        "rationale": "Incorrecte. Només l’anonimització és irreversible."
      },
      {
        "text": "B. La pseudonimització substitueix identificadors per codis, però permet revertir el procés amb informació addicional.",
        "isCorrect": true,
        "rationale": "Correcte. És una mesura de seguretat, però les dades continuen essent personals."
      },
      {
        "text": "C. L’anonimització és un procediment provisional fins que s’aprovi el tractament.",
        "isCorrect": false,
        "rationale": "Incorrecte. L’anonimització és definitiva i irreversible."
      },
      {
        "text": "D. Només la pseudonimització està permesa pel RGPD.",
        "isCorrect": false,
        "rationale": "Incorrecte. Tots dos processos són reconeguts segons el context del tractament."
      }
    ],
    "hint": "Anonimització = irreversible. Pseudonimització = reversible amb informació addicional."
  },
  {
    "guid": "19eb4d4b-b520-4a17-8155-7d420c372813",
    "subjectId": "T66",
    "difficulty": 2,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Quina de les següents opcions és funció del Delegat de Protecció de Dades (DPD)?",
    "answerOptions": [
      {
        "text": "A. Autoritzar tots els tractaments de dades personals.",
        "isCorrect": false,
        "rationale": "Incorrecte. El DPD no autoritza tractaments, només assessora."
      },
      {
        "text": "B. Supervisar el compliment del RGPD i cooperar amb l’autoritat de control.",
        "isCorrect": true,
        "rationale": "Correcte. És una de les funcions essencials segons l’article 39 RGPD."
      },
      {
        "text": "C. Imposar sancions internes a l’entitat.",
        "isCorrect": false,
        "rationale": "Incorrecte. No té poder sancionador."
      },
      {
        "text": "D. Determinar la base legal de cada tractament.",
        "isCorrect": false,
        "rationale": "Incorrecte. Això correspon al responsable del tractament."
      }
    ],
    "hint": "El DPD actua com a figura independent d’assessorament i supervisió."
  },
  {
    "guid": "c7b4e2a4-f4e5-4c35-9f1b-3b66c52d39d2",
    "subjectId": "T66",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Quina afirmació sobre les sancions del RGPD és correcta?",
    "answerOptions": [
      {
        "text": "A. Les infraccions molt greus poden sancionar-se fins a 20 milions d’euros o el 4% del volum de negoci anual global.",
        "isCorrect": true,
        "rationale": "Correcte. Article 83 RGPD: límit màxim per a infraccions molt greus."
      },
      {
        "text": "B. Les administracions públiques poden ser sancionades amb multa econòmica de fins a 10 milions d’euros.",
        "isCorrect": false,
        "rationale": "Incorrecte. Les AAPP no reben multes, sinó advertiments o mesures correctores."
      },
      {
        "text": "C. El RGPD no preveu sancions, només recomanacions i advertiments.",
        "isCorrect": false,
        "rationale": "Incorrecte. El règim sancionador és un dels aspectes centrals del RGPD."
      },
      {
        "text": "D. Només es pot sancionar per incompliments de seguretat tècnica, no per vulnerar drets.",
        "isCorrect": false,
        "rationale": "Incorrecte. Les sancions cobreixen qualsevol infracció del reglament."
      }
    ],
    "hint": "El RGPD pot sancionar fins a 20 milions d’euros o el 4% del volum global."
  },


  {
    "guid": "8b29d127-2434-4f4f-9f6a-92e3ff47f4c9",
    "subjectId": "T66",
    "difficulty": 2,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Segons el RGPD, quin dels següents supòsits queda exclòs del seu àmbit d’aplicació?",
    "answerOptions": [
      {
        "text": "A. Tractament de dades personals per part d’una empresa privada.",
        "isCorrect": false,
        "rationale": "Incorrecte. El RGPD s’aplica plenament al sector privat."
      },
      {
        "text": "B. Tractament de dades per a ús exclusivament personal o domèstic.",
        "isCorrect": true,
        "rationale": "Correcte. Les activitats domèstiques queden fora de l’àmbit del RGPD."
      },
      {
        "text": "C. Tractament de dades per part d’una administració pública.",
        "isCorrect": false,
        "rationale": "Incorrecte. Les AAPP estan sotmeses al RGPD."
      },
      {
        "text": "D. Tractament de dades per part de proveïdors europeus subcontractats.",
        "isCorrect": false,
        "rationale": "Incorrecte. També queden dins de l’àmbit del RGPD."
      }
    ],
    "hint": "El RGPD no s’aplica a activitats domèstiques o personals sense caràcter professional."
  },
  {
    "guid": "e129c32f-dc28-4eb6-b3e8-2cd332a7b3ce",
    "subjectId": "T66",
    "difficulty": 3,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Quan s’han de comunicar les violacions de seguretat a les persones afectades segons el RGPD?",
    "answerOptions": [
      {
        "text": "A. Sempre, independentment del risc.",
        "isCorrect": false,
        "rationale": "Incorrecte. Només quan la violació comporta un alt risc per als drets i llibertats."
      },
      {
        "text": "B. Només si hi ha hagut accés il·legal a dades de salut.",
        "isCorrect": false,
        "rationale": "Incorrecte. També pot ser necessari en altres categories de dades si hi ha alt risc."
      },
      {
        "text": "C. Quan la violació pugui comportar un alt risc per als drets i llibertats de les persones físiques.",
        "isCorrect": true,
        "rationale": "Correcte. Article 34 RGPD: comunicació obligatòria si hi ha alt risc."
      },
      {
        "text": "D. Només si així ho ordena l’AEPD després de la investigació.",
        "isCorrect": false,
        "rationale": "Incorrecte. L’obligació és immediata per part del responsable, sense esperar ordre."
      }
    ],
    "hint": "Només es comunica als afectats quan hi ha alt risc per als seus drets i llibertats."
  },
  {
    "guid": "c11c99c7-62e1-4878-9233-60c7f2c23e5e",
    "subjectId": "T66",
    "difficulty": 2,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Quina d’aquestes afirmacions és correcta sobre les autoritats de control segons el RGPD?",
    "answerOptions": [
      {
        "text": "A. Han de dependre jeràrquicament del Ministeri d’Interior de cada estat.",
        "isCorrect": false,
        "rationale": "Incorrecte. Han de ser totalment independents."
      },
      {
        "text": "B. Cada estat membre ha d’establir almenys una autoritat de control independent.",
        "isCorrect": true,
        "rationale": "Correcte. Article 51 RGPD: cada estat tindrà una o més autoritats independents."
      },
      {
        "text": "C. L’Agència Espanyola de Protecció de Dades depèn orgànicament del Consell de Ministres.",
        "isCorrect": false,
        "rationale": "Incorrecte. És un organisme públic independent."
      },
      {
        "text": "D. Les autoritats de control només poden actuar davant denúncies individuals.",
        "isCorrect": false,
        "rationale": "Incorrecte. També poden actuar d’ofici."
      }
    ],
    "hint": "Les autoritats de control són independents i supervisen l’aplicació del RGPD."
  },
  {
    "guid": "2bca7fcd-8f5b-480b-9b07-42e938d5da7f",
    "subjectId": "T66",
    "difficulty": 3,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Segons el RGPD, qui és responsable de garantir i demostrar el compliment de la normativa?",
    "answerOptions": [
      {
        "text": "A. El Delegat de Protecció de Dades.",
        "isCorrect": false,
        "rationale": "Incorrecte. El DPD assessora i supervisa, però no és responsable del compliment."
      },
      {
        "text": "B. L’Agència Espanyola de Protecció de Dades.",
        "isCorrect": false,
        "rationale": "Incorrecte. L’AEPD controla i sanciona, però no és el responsable."
      },
      {
        "text": "C. El responsable del tractament.",
        "isCorrect": true,
        "rationale": "Correcte. És qui determina finalitat i mitjans del tractament i ha de demostrar compliment (accountability)."
      },
      {
        "text": "D. El prestador del servei cloud on s’allotgen les dades.",
        "isCorrect": false,
        "rationale": "Incorrecte. És encarregat, no responsable."
      }
    ],
    "hint": "La responsabilitat proactiva recau en el responsable del tractament."
  },
  {
    "guid": "3a8c6a29-f414-4aa5-b604-b17474c4a6e8",
    "subjectId": "T66",
    "difficulty": 2,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Quina de les següents opcions descriu millor el concepte de 'privacitat des del disseny' (privacy by design)?",
    "answerOptions": [
      {
        "text": "A. Afegir funcionalitats de seguretat al final del desenvolupament d’un sistema.",
        "isCorrect": false,
        "rationale": "Incorrecte. Les mesures s’han d’incorporar des de l’inici."
      },
      {
        "text": "B. Considerar la protecció de dades personals com un element essencial des de la fase de disseny d’un projecte o sistema.",
        "isCorrect": true,
        "rationale": "Correcte. Article 25 RGPD: protecció de dades des del disseny i per defecte."
      },
      {
        "text": "C. Limitar l’accés als sistemes únicament a personal tècnic especialitzat.",
        "isCorrect": false,
        "rationale": "Incorrecte. És una mesura de seguretat, no de disseny."
      },
      {
        "text": "D. Evitar la necessitat de consentiment per defecte en els projectes públics.",
        "isCorrect": false,
        "rationale": "Incorrecte. No té relació amb el principi de disseny."
      }
    ],
    "hint": "La privacitat ha de formar part del disseny inicial de qualsevol sistema."
  },
  {
    "guid": "6d9398c5-bf84-4d27-b62e-fc190f51a83f",
    "subjectId": "T66",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "Segons la Llei Orgànica 3/2018 (LOPDGDD), quin és l’edat mínima per prestar consentiment vàlid en el tractament de dades personals?",
    "answerOptions": [
      {
        "text": "A. 13 anys.",
        "isCorrect": false,
        "rationale": "Incorrecte. L’antiga LOPD de 1999 establia 14 anys, i el RGPD deixa marge als estats."
      },
      {
        "text": "B. 14 anys.",
        "isCorrect": true,
        "rationale": "Correcte. L’article 7 de la LOPDGDD fixa el consentiment vàlid a partir dels 14 anys."
      },
      {
        "text": "C. 16 anys.",
        "isCorrect": false,
        "rationale": "Incorrecte. És el límit màxim permès pel RGPD, però Espanya va establir 14 anys."
      },
      {
        "text": "D. 18 anys.",
        "isCorrect": false,
        "rationale": "Incorrecte. No cal majoria d’edat per consentir tractament de dades."
      }
    ],
    "hint": "A Espanya, la LOPDGDD fixa el consentiment vàlid a partir dels 14 anys."
  },
  {
    "guid": "7a72ad4a-b60e-4f07-9a06-16c7d82f17d8",
    "subjectId": "T66",
    "difficulty": 3,
    "origin": "OPOS24_gpt",
    "type": "test",
    "question": "En el context del RGPD, què significa el principi de 'limitació de la finalitat'?",
    "answerOptions": [
      {
        "text": "A. Les dades personals només poden ser utilitzades per a les finalitats específiques, explícites i legítimes per a les quals van ser recollides.",
        "isCorrect": true,
        "rationale": "Correcte. Article 5.1.b RGPD defineix aquest principi."
      },
      {
        "text": "B. Les dades han de conservar-se durant el temps mínim establert legalment.",
        "isCorrect": false,
        "rationale": "Incorrecte. Això correspon al principi de limitació temporal."
      },
      {
        "text": "C. Les dades s’han d’eliminar immediatament després del seu ús inicial.",
        "isCorrect": false,
        "rationale": "Incorrecte. Només si ja no hi ha finalitat legítima."
      },
      {
        "text": "D. Les dades poden ser reutilitzades per a altres finalitats si el responsable ho considera d’interès general.",
        "isCorrect": false,
        "rationale": "Incorrecte. Cal nova base legal o consentiment."
      }
    ],
    "hint": "Només es poden tractar dades per a finalitats determinades i legítimes."
  },


  {
    "guid": "1c8fa62c-4573-48cd-a6b4-ff05a35af9e4",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "OPOS24_gpt",
    "type": "fillgap",
    "question": "El RGPD és un Reglament de la Unió Europea que garanteix la protecció de les persones físiques pel que fa al tractament de ________ i a la lliure circulació d’aquestes.",
    "answerOptions": [
      {
        "text": "dades personals",
        "isCorrect": true,
        "rationale": "El RGPD es centra exclusivament en la protecció de dades personals."
      },
      {
        "text": "informació pública",
        "isCorrect": false,
        "rationale": "El RGPD no regula la informació pública sinó la personal."
      },
      {
        "text": "documents administratius",
        "isCorrect": false,
        "rationale": "Els documents administratius es regulen per altres lleis com la 39/2015."
      },
      {
        "text": "dades anonimitzades",
        "isCorrect": false,
        "rationale": "Les dades anonimitzades queden fora de l’àmbit del RGPD."
      }
    ],
    "hint": "Pensa en allò que identifica o pot identificar una persona física."
  },
  {
    "guid": "57edcd3d-8a13-45c3-9cb9-ecb76d2e4f82",
    "subjectId": "T66",
    "difficulty": 2,
    "origin": "OPOS24_gpt",
    "type": "fillgap",
    "question": "El principi de ________ implica que el responsable del tractament ha de poder demostrar el compliment del RGPD davant l’autoritat competent.",
    "answerOptions": [
      {
        "text": "responsabilitat proactiva",
        "isCorrect": true,
        "rationale": "És el principi d’‘accountability’ que obliga a demostrar el compliment."
      },
      {
        "text": "transparència",
        "isCorrect": false,
        "rationale": "La transparència regula la informació a l’interessat, no el compliment."
      },
      {
        "text": "proporcionalitat",
        "isCorrect": false,
        "rationale": "Aquest principi no figura explícitament al RGPD."
      },
      {
        "text": "exactitud",
        "isCorrect": false,
        "rationale": "L’exactitud s’aplica a la qualitat de les dades, no al compliment normatiu."
      }
    ],
    "hint": "És el principi que exigeix poder demostrar amb evidències el compliment."
  },
  {
    "guid": "2b904ad9-0d5e-480c-a0e1-2e97d9188f72",
    "subjectId": "T66",
    "difficulty": 3,
    "origin": "OPOS24_gpt",
    "type": "fillgap",
    "question": "Segons el RGPD, el consentiment ha de ser ________, ________ i inequívoc per ser vàlid.",
    "answerOptions": [
      {
        "text": "lliure, específic",
        "isCorrect": true,
        "rationale": "Ha de ser lliure (sense coacció) i específic (per a una finalitat concreta)."
      },
      {
        "text": "tàcit, informat",
        "isCorrect": false,
        "rationale": "El consentiment tàcit no és vàlid segons el RGPD."
      },
      {
        "text": "automàtic, explícit",
        "isCorrect": false,
        "rationale": "No pot ser automàtic; ha de ser voluntari i informat."
      },
      {
        "text": "general, verbal",
        "isCorrect": false,
        "rationale": "No pot ser genèric ni oral sense registre verificable."
      }
    ],
    "hint": "Recorda: el consentiment ha de ser actiu i relacionat amb una finalitat concreta."
  },
  {
    "guid": "a4c19c38-b61e-4a77-9e10-85d16b2fd547",
    "subjectId": "T66",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "fillgap",
    "question": "L’Avaluació d’Impacte relativa a la Protecció de Dades (EIPD) és obligatòria quan el tractament pot comportar un ________ per als drets i llibertats de les persones físiques.",
    "answerOptions": [
      {
        "text": "alt risc",
        "isCorrect": true,
        "rationale": "L’article 35 RGPD estableix que cal una EIPD en tractaments amb alt risc."
      },
      {
        "text": "risc mitjà",
        "isCorrect": false,
        "rationale": "Només és obligatòria en casos d’alt risc."
      },
      {
        "text": "risc tècnic",
        "isCorrect": false,
        "rationale": "El risc es valora en termes de drets i llibertats, no tècnics."
      },
      {
        "text": "impacte econòmic",
        "isCorrect": false,
        "rationale": "El RGPD no es refereix a impactes econòmics sinó a drets personals."
      }
    ],
    "hint": "Aquest terme s’associa als tractaments de dades biomètriques o vigilància massiva."
  },
  {
    "guid": "6e0e01f3-70c1-4f3f-9d17-c8141db56a6d",
    "subjectId": "T66",
    "difficulty": 2,
    "origin": "OPOS24_gpt",
    "type": "fillgap",
    "question": "El DPD o Delegat de Protecció de Dades és una figura ________ que assessora i supervisa el compliment del RGPD dins l’organització.",
    "answerOptions": [
      {
        "text": "independent",
        "isCorrect": true,
        "rationale": "El DPD ha de ser independent i reportar al nivell jeràrquic més alt."
      },
      {
        "text": "subordinada",
        "isCorrect": false,
        "rationale": "No pot dependre jeràrquicament de les àrees que tracta."
      },
      {
        "text": "executiva",
        "isCorrect": false,
        "rationale": "No exerceix poder executiu ni decisori sobre el tractament."
      },
      {
        "text": "temporal",
        "isCorrect": false,
        "rationale": "La seva funció és continuada, no puntual."
      }
    ],
    "hint": "És una figura de supervisió, no de gestió directa del tractament."
  },
  {
    "guid": "e1eae3a7-5187-4e57-a230-9f82a8d3a45c",
    "subjectId": "T66",
    "difficulty": 3,
    "origin": "OPOS24_gpt",
    "type": "fillgap",
    "question": "El termini per notificar una violació de seguretat a l’autoritat competent és de ________ hores des del moment en què el responsable en té coneixement.",
    "answerOptions": [
      {
        "text": "72",
        "isCorrect": true,
        "rationale": "Article 33 RGPD: notificació dins de les 72 hores."
      },
      {
        "text": "24",
        "isCorrect": false,
        "rationale": "Incorrecte. El RGPD estableix 72 hores, no 24."
      },
      {
        "text": "48",
        "isCorrect": false,
        "rationale": "El termini correcte és superior: 72 hores."
      },
      {
        "text": "96",
        "isCorrect": false,
        "rationale": "El límit és de tres dies, no quatre."
      }
    ],
    "hint": "És el mateix termini que es demana a empreses i administracions públiques."
  },
  {
    "guid": "42f98718-7f4e-4b41-b5a4-d731671fb6e8",
    "subjectId": "T66",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "fillgap",
    "question": "Quan un tractament és realitzat conjuntament per dues o més entitats, aquestes són considerades ________ i han de determinar de manera transparent les seves respectives responsabilitats.",
    "answerOptions": [
      {
        "text": "corresponsables",
        "isCorrect": true,
        "rationale": "Article 26 RGPD: corresponsables del tractament comparteixen decisions."
      },
      {
        "text": "encarregades del tractament",
        "isCorrect": false,
        "rationale": "Les encarregades actuen per compte del responsable, no de manera conjunta."
      },
      {
        "text": "delegades",
        "isCorrect": false,
        "rationale": "No existeix la figura de 'delegat del tractament'."
      },
      {
        "text": "intermediàries",
        "isCorrect": false,
        "rationale": "No és un terme reconegut pel RGPD."
      }
    ],
    "hint": "Es tracta de situacions en què dues entitats decideixen conjuntament els fins i mitjans del tractament."
  },
  {
    "guid": "f6cb0ac7-62ff-4a5d-bc42-d6b86b9dd349",
    "subjectId": "T66",
    "difficulty": 2,
    "origin": "OPOS24_gpt",
    "type": "fillgap",
    "question": "Les sancions molt greus del RGPD poden arribar fins a ________ milions d’euros o el ________ % del volum de negoci global anual.",
    "answerOptions": [
      {
        "text": "20 / 4",
        "isCorrect": true,
        "rationale": "Article 83 RGPD: fins a 20 milions o el 4% del volum global."
      },
      {
        "text": "10 / 2",
        "isCorrect": false,
        "rationale": "Aquesta quantia correspon a infraccions greus, no molt greus."
      },
      {
        "text": "15 / 3",
        "isCorrect": false,
        "rationale": "No hi ha aquesta categoria intermèdia al RGPD."
      },
      {
        "text": "25 / 5",
        "isCorrect": false,
        "rationale": "El RGPD no contempla aquestes xifres."
      }
    ],
    "hint": "Recorda la parella 20 i 4: milions i percentatge màxim."
  },




  {
    "guid": "d0b98d14-2f4a-4bda-8aa1-9df5d6f60e8a",
    "subjectId": "T66",
    "difficulty": 2,
    "origin": "OPOS24_gpt",
    "type": "fillgap",
    "question": "El dret a la ________ permet a la persona sol·licitar que les seves dades siguin eliminades quan ja no siguin necessàries o quan retiri el seu consentiment.",
    "answerOptions": [
      {
        "text": "supressió",
        "isCorrect": true,
        "rationale": "És el dret a l’oblit o supressió, regulat a l’article 17 del RGPD."
      },
      {
        "text": "rectificació",
        "isCorrect": false,
        "rationale": "Aquest dret serveix per corregir dades incorrectes, no per eliminar-les."
      },
      {
        "text": "limitació",
        "isCorrect": false,
        "rationale": "La limitació restringeix temporalment l’ús, però no elimina les dades."
      },
      {
        "text": "oposició",
        "isCorrect": false,
        "rationale": "El dret d’oposició serveix per negar-se al tractament, no per suprimir."
      }
    ],
    "hint": "També es coneix com el dret a l’oblit."
  },
  {
    "guid": "9a6e16a3-c51a-44f5-9093-f1d73b8d1fa9",
    "subjectId": "T66",
    "difficulty": 3,
    "origin": "OPOS24_gpt",
    "type": "fillgap",
    "question": "Quan una persona demana que les seves dades es transmetin a un altre responsable, està exercint el dret de ________ de dades.",
    "answerOptions": [
      {
        "text": "portabilitat",
        "isCorrect": true,
        "rationale": "Permet traslladar les dades d’un responsable a un altre en format estructurat."
      },
      {
        "text": "transferència",
        "isCorrect": false,
        "rationale": "Les transferències internacionals són un concepte diferent."
      },
      {
        "text": "cessió",
        "isCorrect": false,
        "rationale": "La cessió no és un dret de la persona sinó una acció del responsable."
      },
      {
        "text": "moviment",
        "isCorrect": false,
        "rationale": "No és un terme reconegut al RGPD."
      }
    ],
    "hint": "És un dret nou incorporat pel RGPD per afavorir la llibertat digital."
  },
  {
    "guid": "7e78f3a7-40cf-4f44-8dc1-1a6f99a1cfb8",
    "subjectId": "T66",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "fillgap",
    "question": "Les dades personals s’han de tractar de manera ________ i ________, garantint la seguretat i confidencialitat segons l’article 5 del RGPD.",
    "answerOptions": [
      {
        "text": "lícita / transparent",
        "isCorrect": true,
        "rationale": "Aquests dos adjectius descriuen els principis bàsics del tractament segons l’article 5.1.a."
      },
      {
        "text": "pública / oberta",
        "isCorrect": false,
        "rationale": "Les dades no sempre han de ser públiques ni obertes."
      },
      {
        "text": "segura / confidencial",
        "isCorrect": false,
        "rationale": "Tot i ser requisits, no són els dos primers principis enumerats al RGPD."
      },
      {
        "text": "temporal / anònima",
        "isCorrect": false,
        "rationale": "El tractament pot ser permanent i no anònim; el RGPD no ho exigeix així."
      }
    ],
    "hint": "Són els dos primers principis del tractament segons l’article 5.1 del RGPD."
  },
  {
    "guid": "ab349b57-d835-4e87-9aef-879d53ac0f15",
    "subjectId": "T66",
    "difficulty": 3,
    "origin": "OPOS24_gpt",
    "type": "fillgap",
    "question": "El responsable del tractament ha de garantir que les dades personals siguin ________, és a dir, que es mantinguin actualitzades i sense errors.",
    "answerOptions": [
      {
        "text": "exactes",
        "isCorrect": true,
        "rationale": "L’exactitud és un principi fonamental segons l’article 5.1.d del RGPD."
      },
      {
        "text": "anonimitzades",
        "isCorrect": false,
        "rationale": "L’anonimització no sempre és obligatòria ni s’aplica a totes les dades."
      },
      {
        "text": "pseudonimitzades",
        "isCorrect": false,
        "rationale": "La pseudonimització és una mesura de seguretat, no un principi general."
      },
      {
        "text": "documentades",
        "isCorrect": false,
        "rationale": "El registre documental no substitueix l’exactitud."
      }
    ],
    "hint": "És el principi que assegura que les dades siguin correctes i actuals."
  },
  {
    "guid": "417cd270-6d7b-47f3-b080-f2d2d08bde5c",
    "subjectId": "T66",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "fillgap",
    "question": "Quan dues entitats decideixen conjuntament els fins i mitjans d’un tractament de dades, són considerades ________ segons l’article 26 del RGPD.",
    "answerOptions": [
      {
        "text": "corresponsables",
        "isCorrect": true,
        "rationale": "El RGPD defineix aquesta figura quan hi ha decisions conjuntes."
      },
      {
        "text": "encarregades",
        "isCorrect": false,
        "rationale": "L’encarregat actua per compte del responsable, no conjuntament."
      },
      {
        "text": "codisignants",
        "isCorrect": false,
        "rationale": "No és un terme reconegut pel RGPD."
      },
      {
        "text": "intervinents",
        "isCorrect": false,
        "rationale": "El terme no té base jurídica al reglament."
      }
    ],
    "hint": "És una situació comuna en projectes conjunts entre administracions."
  },
  {
    "guid": "cd46b8a4-ef1e-4a2a-8bcd-4bdeee6f2070",
    "subjectId": "T66",
    "difficulty": 2,
    "origin": "OPOS24_gpt",
    "type": "fillgap",
    "question": "Segons el RGPD, una dada es considera personal si pot identificar ________, directament o indirectament.",
    "answerOptions": [
      {
        "text": "una persona física",
        "isCorrect": true,
        "rationale": "El RGPD protegeix només les persones físiques identificades o identificables."
      },
      {
        "text": "una empresa",
        "isCorrect": false,
        "rationale": "Les persones jurídiques no estan emparades pel RGPD."
      },
      {
        "text": "un lloc geogràfic",
        "isCorrect": false,
        "rationale": "No és rellevant per la protecció de dades personals."
      },
      {
        "text": "una aplicació informàtica",
        "isCorrect": false,
        "rationale": "El RGPD no protegeix programes o entitats tècniques."
      }
    ],
    "hint": "Només s’aplica a individus humans vius, no a empreses o sistemes."
  },
  {
    "guid": "894c8b6b-9ab8-4dc6-bacb-b7bfc1fd61b5",
    "subjectId": "T66",
    "difficulty": 3,
    "origin": "OPOS24_gpt",
    "type": "fillgap",
    "question": "El principi de ________ estableix que les dades s’han de conservar només durant el temps necessari per a la finalitat per la qual es van recollir.",
    "answerOptions": [
      {
        "text": "limitació de la conservació",
        "isCorrect": true,
        "rationale": "L’article 5.1.e RGPD fixa aquest principi temporal."
      },
      {
        "text": "transparència",
        "isCorrect": false,
        "rationale": "La transparència no regula el temps de conservació."
      },
      {
        "text": "proporcionalitat",
        "isCorrect": false,
        "rationale": "Aquest principi no està explícitament al RGPD."
      },
      {
        "text": "interoperabilitat",
        "isCorrect": false,
        "rationale": "No és un principi de protecció de dades."
      }
    ],
    "hint": "Es tracta de conservar el mínim temps imprescindible per al propòsit original."
  },
  {
    "guid": "8f1798b4-9c92-44f9-b530-c6d546672c5d",
    "subjectId": "T66",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "fillgap",
    "question": "Una transferència internacional de dades només és lícita si el país receptor garanteix un nivell de protecció ________ segons la decisió de la Comissió Europea.",
    "answerOptions": [
      {
        "text": "adequat",
        "isCorrect": true,
        "rationale": "El nivell de protecció adequat és condició per a la transferència legal segons l’article 45."
      },
      {
        "text": "mínim",
        "isCorrect": false,
        "rationale": "No existeix la categoria 'mínim' al RGPD."
      },
      {
        "text": "bàsic",
        "isCorrect": false,
        "rationale": "El terme correcte és 'adequat'."
      },
      {
        "text": "estàndard",
        "isCorrect": false,
        "rationale": "Les clàusules poden ser estàndard, però el nivell ha de ser adequat."
      }
    ],
    "hint": "El terme clau és el que utilitza la Comissió per reconèixer països segurs."
  },




  {
    "guid": "5aa4e31f-91a4-4385-9022-8b8b0bfe4ed2",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "OPOS24_gpt",
    "type": "truefalse",
    "question": "El RGPD és aplicable únicament a les empreses privades que tractin dades personals.",
    "answerOptions": [
      {
        "text": "Cert",
        "isCorrect": false,
        "rationale": "Fals. El RGPD s’aplica tant a entitats públiques com privades que tractin dades personals."
      },
      {
        "text": "Fals",
        "isCorrect": true,
        "rationale": "Correcte. També afecta administracions públiques, professionals i associacions."
      }
    ],
    "hint": "El RGPD té un abast general, no només per empreses privades."
  },
  {
    "guid": "e7d89c7c-36b5-4e3a-8c78-6d82b16521d5",
    "subjectId": "T66",
    "difficulty": 2,
    "origin": "OPOS24_gpt",
    "type": "truefalse",
    "question": "El consentiment tàcit és vàlid segons el RGPD si l’interessat no manifesta oposició.",
    "answerOptions": [
      {
        "text": "Cert",
        "isCorrect": false,
        "rationale": "Fals. El consentiment ha de ser explícit, lliure i inequívoc. El silenci o la inacció no són suficients."
      },
      {
        "text": "Fals",
        "isCorrect": true,
        "rationale": "Correcte. El consentiment tàcit va ser eliminat com a opció vàlida amb el RGPD."
      }
    ],
    "hint": "El consentiment ha de ser actiu, no per omissió."
  },
  {
    "guid": "e9f4a879-7c2d-4a4d-93d0-4182b7c334a4",
    "subjectId": "T66",
    "difficulty": 2,
    "origin": "OPOS24_gpt",
    "type": "truefalse",
    "question": "Les dades anonimitzades continuen considerant-se dades personals segons el RGPD.",
    "answerOptions": [
      {
        "text": "Cert",
        "isCorrect": false,
        "rationale": "Fals. Si una dada ha estat anonimitzada de manera irreversible, ja no es considera dada personal."
      },
      {
        "text": "Fals",
        "isCorrect": true,
        "rationale": "Correcte. El RGPD no s’aplica a dades anonimitzades, però sí a les pseudonimitzades."
      }
    ],
    "hint": "Anonimitzar = eliminar tota possibilitat d’identificació."
  },
  {
    "guid": "f46f0730-52cb-4c74-9c0f-9a5ef0d321b3",
    "subjectId": "T66",
    "difficulty": 3,
    "origin": "OPOS24_gpt",
    "type": "truefalse",
    "question": "El Delegat de Protecció de Dades és responsable directe del compliment del RGPD dins l’organització.",
    "answerOptions": [
      {
        "text": "Cert",
        "isCorrect": false,
        "rationale": "Fals. El responsable del tractament és qui respon legalment. El DPD només assessora i supervisa."
      },
      {
        "text": "Fals",
        "isCorrect": true,
        "rationale": "Correcte. El DPD no té responsabilitat jurídica directa, sinó funció d’assessorament."
      }
    ],
    "hint": "El DPD guia i vigila, però no decideix ni respon legalment."
  },
  {
    "guid": "4e5e84f1-3b73-4235-8f68-6a44e3a3cf48",
    "subjectId": "T66",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "truefalse",
    "question": "Les administracions públiques poden ser sancionades amb multes econòmiques pel RGPD igual que les empreses privades.",
    "answerOptions": [
      {
        "text": "Cert",
        "isCorrect": false,
        "rationale": "Fals. Les administracions no reben multes econòmiques, sinó advertiments o mesures correctores."
      },
      {
        "text": "Fals",
        "isCorrect": true,
        "rationale": "Correcte. El RGPD exclou les sancions econòmiques a les AAPP, però sí poden ser amonestades."
      }
    ],
    "hint": "El RGPD preveu mesures no econòmiques per a les entitats públiques."
  },
  {
    "guid": "23ab89e0-984a-47a8-962b-4b541a777e7b",
    "subjectId": "T66",
    "difficulty": 3,
    "origin": "OPOS24_gpt",
    "type": "truefalse",
    "question": "La pseudonimització elimina totalment la possibilitat d’identificar una persona.",
    "answerOptions": [
      {
        "text": "Cert",
        "isCorrect": false,
        "rationale": "Fals. La pseudonimització pot revertir-se si es conserva la clau d’identificació."
      },
      {
        "text": "Fals",
        "isCorrect": true,
        "rationale": "Correcte. Només l’anonimització elimina completament la possibilitat d’identificar l’individu."
      }
    ],
    "hint": "La pseudonimització redueix el risc, però no el suprimeix."
  },
  {
    "guid": "2a7b7dce-19e9-4a24-b66e-82f8a0bce50e",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "OPOS24_gpt",
    "type": "truefalse",
    "question": "El RGPD estableix que les dades personals han de ser exactes i estar actualitzades.",
    "answerOptions": [
      {
        "text": "Cert",
        "isCorrect": true,
        "rationale": "Correcte. L’exactitud és un dels principis bàsics de l’article 5."
      },
      {
        "text": "Fals",
        "isCorrect": false,
        "rationale": "Fals. Les dades inexactes han de ser rectificades o suprimides."
      }
    ],
    "hint": "El principi d’exactitud garanteix la fiabilitat del tractament."
  },
  {
    "guid": "cf9d20e7-9b5a-4ce1-bcf4-cff18f63af2e",
    "subjectId": "T66",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "truefalse",
    "question": "Una transferència internacional de dades pot realitzar-se lliurement sempre que les dades estiguin xifrades.",
    "answerOptions": [
      {
        "text": "Cert",
        "isCorrect": false,
        "rationale": "Fals. El xifrat és una mesura tècnica, però no substitueix les garanties legals exigides pel RGPD."
      },
      {
        "text": "Fals",
        "isCorrect": true,
        "rationale": "Correcte. Només es poden fer transferències internacionals si hi ha nivell adequat de protecció o clàusules tipus."
      }
    ],
    "hint": "El xifrat millora la seguretat, però no eximeix del compliment legal."
  },
  {
    "guid": "14d1ce6e-4046-4c90-9d2d-798c013efbf5",
    "subjectId": "T66",
    "difficulty": 3,
    "origin": "OPOS24_gpt",
    "type": "truefalse",
    "question": "El principi de minimització estableix que s’han de recollir només les dades necessàries per a la finalitat declarada.",
    "answerOptions": [
      {
        "text": "Cert",
        "isCorrect": true,
        "rationale": "Correcte. És el principi de minimització de dades segons l’article 5.1.c."
      },
      {
        "text": "Fals",
        "isCorrect": false,
        "rationale": "Fals. La recollida excessiva vulnera el RGPD."
      }
    ],
    "hint": "Només el mínim necessari per complir la finalitat."
  },
  {
    "guid": "02de769c-ff43-402e-b44f-0e17b573ce79",
    "subjectId": "T66",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "truefalse",
    "question": "El responsable del tractament pot delegar completament la seva responsabilitat legal en l’encarregat del tractament.",
    "answerOptions": [
      {
        "text": "Cert",
        "isCorrect": false,
        "rationale": "Fals. El responsable mai pot transferir la seva responsabilitat legal, encara que delegui funcions tècniques."
      },
      {
        "text": "Fals",
        "isCorrect": true,
        "rationale": "Correcte. L’encarregat actua per compte del responsable, però no l’exonera de responsabilitat."
      }
    ],
    "hint": "El responsable sempre respon davant l’autoritat de control."
  },



  {
    "guid": "ad247b7e-4c3b-4c7e-bbaf-4a7eae9bbac0",
    "subjectId": "T66",
    "difficulty": 2,
    "origin": "OPOS24_gpt",
    "type": "truefalse",
    "question": "En un ajuntament, el responsable del tractament de les dades del padró municipal és l’empresa subcontractada que gestiona el sistema informàtic.",
    "answerOptions": [
      {
        "text": "Cert",
        "isCorrect": false,
        "rationale": "Fals. El responsable és l’Ajuntament, que decideix la finalitat i els mitjans del tractament. L’empresa és l’encarregada."
      },
      {
        "text": "Fals",
        "isCorrect": true,
        "rationale": "Correcte. El responsable del tractament és l’administració titular de les dades, no el proveïdor tècnic."
      }
    ],
    "hint": "Recorda: el responsable decideix el 'què' i 'per què', l’encarregat només el 'com'."
  },
  {
    "guid": "f5cb82a8-80df-49f4-b4a4-6a6e7a89bce3",
    "subjectId": "T66",
    "difficulty": 3,
    "origin": "OPOS24_gpt",
    "type": "truefalse",
    "question": "Els contractes amb encarregats del tractament dins l’Administració pública han de formalitzar-se sempre per escrit o en un altre format jurídicament vàlid.",
    "answerOptions": [
      {
        "text": "Cert",
        "isCorrect": true,
        "rationale": "Correcte. L’article 28 del RGPD exigeix que el contracte sigui formal i documentat, fins i tot entre entitats públiques."
      },
      {
        "text": "Fals",
        "isCorrect": false,
        "rationale": "Fals. Els acords verbals o tàcits no són vàlids segons el RGPD."
      }
    ],
    "hint": "Els acords amb encarregats sempre han de constar per escrit o suport digital signat."
  },
  {
    "guid": "eb9d88b9-ecf9-46c9-98fa-43b1f045cc16",
    "subjectId": "T66",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "truefalse",
    "question": "Si una càmera de videovigilància municipal grava una àrea pública, no és necessari senyalitzar-ho amb cartells informatius, ja que la finalitat és de seguretat.",
    "answerOptions": [
      {
        "text": "Cert",
        "isCorrect": false,
        "rationale": "Fals. Encara que la finalitat sigui legítima, el RGPD exigeix informar mitjançant cartells visibles sobre la captació d’imatges."
      },
      {
        "text": "Fals",
        "isCorrect": true,
        "rationale": "Correcte. La transparència és un principi bàsic i obliga a informar sempre."
      }
    ],
    "hint": "Tot tractament de dades, inclosa la videovigilància, ha de complir el principi de transparència."
  },
  {
    "guid": "bc4b41ed-8ea5-47e7-a8b7-1b26d0db0193",
    "subjectId": "T66",
    "difficulty": 3,
    "origin": "OPOS24_gpt",
    "type": "truefalse",
    "question": "Una Avaluació d’Impacte (EIPD) només és obligatòria si l’autoritat de control així ho sol·licita expressament.",
    "answerOptions": [
      {
        "text": "Cert",
        "isCorrect": false,
        "rationale": "Fals. L’article 35 RGPD estableix que el responsable ha d’avaluar el risc i fer l’EIPD quan el tractament sigui d’alt risc, sense esperar requeriment."
      },
      {
        "text": "Fals",
        "isCorrect": true,
        "rationale": "Correcte. L’obligació és proactiva, no reactiva."
      }
    ],
    "hint": "L’EIPD és part del principi de responsabilitat proactiva."
  },
  {
    "guid": "b54d9831-44da-4dd6-8e47-1ef78b8995f7",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "OPOS24_gpt",
    "type": "truefalse",
    "question": "Les dades del personal municipal es consideren dades personals i estan subjectes al RGPD.",
    "answerOptions": [
      {
        "text": "Cert",
        "isCorrect": true,
        "rationale": "Correcte. Qualsevol dada que identifiqui una persona física, inclosos empleats públics, està protegida pel RGPD."
      },
      {
        "text": "Fals",
        "isCorrect": false,
        "rationale": "Fals. No hi ha excepció per a empleats o funcionaris."
      }
    ],
    "hint": "El RGPD protegeix totes les persones físiques, també dins de l’àmbit laboral."
  },
  {
    "guid": "81cd219e-c319-45e7-a4f4-08b2889a5124",
    "subjectId": "T66",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "truefalse",
    "question": "En l’àmbit públic, és possible fer servir el consentiment com a base legal principal per al tractament de dades.",
    "answerOptions": [
      {
        "text": "Cert",
        "isCorrect": false,
        "rationale": "Fals. En l’àmbit públic el consentiment rarament és base legal vàlida; normalment la base és l’exercici de poders públics o interès públic."
      },
      {
        "text": "Fals",
        "isCorrect": true,
        "rationale": "Correcte. El consentiment només s’utilitza en casos excepcionals en administracions públiques."
      }
    ],
    "hint": "En l’àmbit públic preval la base de 'missió d’interès públic'."
  },
  {
    "guid": "aee287b9-dff5-4c1b-a00e-9081a4c820e8",
    "subjectId": "T66",
    "difficulty": 3,
    "origin": "OPOS24_gpt",
    "type": "truefalse",
    "question": "El DPD d’un ajuntament pot ser el mateix per a totes les entitats públiques del municipi si es garanteix la seva independència.",
    "answerOptions": [
      {
        "text": "Cert",
        "isCorrect": true,
        "rationale": "Correcte. El RGPD permet un DPD comú per a diverses entitats públiques si es pot accedir-hi fàcilment i es manté la seva independència."
      },
      {
        "text": "Fals",
        "isCorrect": false,
        "rationale": "Fals. No és necessari que cada organisme tingui un DPD exclusiu."
      }
    ],
    "hint": "Diverses entitats poden compartir DPD, però amb garanties d’independència i accessibilitat."
  },
  {
    "guid": "cfc12407-47e3-4e03-a3ab-72d2a2b1b6a0",
    "subjectId": "T66",
    "difficulty": 2,
    "origin": "OPOS24_gpt",
    "type": "truefalse",
    "question": "Un ciutadà pot exercir el dret de rectificació directament davant de qualsevol treballador municipal.",
    "answerOptions": [
      {
        "text": "Cert",
        "isCorrect": false,
        "rationale": "Fals. Els drets han d’exercir-se a través dels canals establerts, com l’oficina de protecció de dades o el registre oficial."
      },
      {
        "text": "Fals",
        "isCorrect": true,
        "rationale": "Correcte. Cal fer-ho mitjançant el procediment formal establert per l’Ajuntament."
      }
    ],
    "hint": "Els canals d’exercici de drets han d’estar definits i oficials."
  },
  {
    "guid": "ae4e4e23-54a9-403e-aac3-93a8e2f0d2d4",
    "subjectId": "T66",
    "difficulty": 3,
    "origin": "OPOS24_gpt",
    "type": "truefalse",
    "question": "Una entitat pública pot compartir dades personals amb una altra administració sense consentiment si existeix una base legal o obligació normativa.",
    "answerOptions": [
      {
        "text": "Cert",
        "isCorrect": true,
        "rationale": "Correcte. El RGPD permet la cessió entre administracions si hi ha base jurídica o obligació legal."
      },
      {
        "text": "Fals",
        "isCorrect": false,
        "rationale": "Fals. No sempre cal consentiment quan hi ha una base legal expressa."
      }
    ],
    "hint": "El consentiment no és necessari si la llei ja ho autoritza."
  },
  {
    "guid": "ef2cfbc8-76b8-4a8f-b1b0-1679d1a266c7",
    "subjectId": "T66",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "truefalse",
    "question": "Quan un ajuntament externalitza un servei que implica tractament de dades, és l’empresa contractada qui ha de notificar a l’AEPD una bretxa de seguretat.",
    "answerOptions": [
      {
        "text": "Cert",
        "isCorrect": false,
        "rationale": "Fals. L’obligació de notificar la bretxa recau en el responsable del tractament, encara que l’encarregat hagi detectat l’incident."
      },
      {
        "text": "Fals",
        "isCorrect": true,
        "rationale": "Correcte. L’encarregat informa el responsable, i aquest és qui notifica a l’autoritat competent."
      }
    ],
    "hint": "Només el responsable pot fer la notificació formal a l’autoritat de control."
  },


  {
    "guid": "2cfcf14a-7232-40f4-89c5-1f1572f41980",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "OPOS24_gpt",
    "type": "flashcard",
    "question": "Quin és l’objectiu principal del RGPD?",
    "answerOptions": [
      {
        "text": "Aquesta me la sé",
        "isCorrect": true,
        "rationale": "Garantir la protecció de les persones físiques en el tractament de dades personals i la lliure circulació d’aquestes dades."
      },
      {
        "text": "Encara no me la sé",
        "isCorrect": false,
        "rationale": "No passa, cada intent suma experiència."
      }
    ],
    "hint": "Article 1 del RGPD: protecció i lliure circulació de dades."
  },
  {
    "guid": "49e6e7c7-4a0b-47f0-b6c2-f37e90ab987f",
    "subjectId": "T66",
    "difficulty": 2,
    "origin": "OPOS24_gpt",
    "type": "flashcard",
    "question": "Quin principi obliga el responsable del tractament a poder demostrar el compliment del RGPD?",
    "answerOptions": [
      {
        "text": "Aquesta me la sé",
        "isCorrect": true,
        "rationale": "Principi de responsabilitat proactiva (accountability)."
      },
      {
        "text": "Encara no me la sé",
        "isCorrect": false,
        "rationale": "No passa, cada intent suma experiència."
      }
    ],
    "hint": "Aquest principi implica evidenciar el compliment davant l’autoritat."
  },
  {
    "guid": "ecb70e56-66a3-4b7b-9b1b-90b5b9b27b43",
    "subjectId": "T66",
    "difficulty": 3,
    "origin": "OPOS24_gpt",
    "type": "flashcard",
    "question": "Quina diferència hi ha entre dades anonimitzades i pseudonimitzades?",
    "answerOptions": [
      {
        "text": "Aquesta me la sé",
        "isCorrect": true,
        "rationale": "Les dades anonimitzades no poden identificar ningú; les pseudonimitzades poden reidentificar-se amb informació addicional."
      },
      {
        "text": "Encara no me la sé",
        "isCorrect": false,
        "rationale": "No passa, cada intent suma experiència."
      }
    ],
    "hint": "Només l’anonimització és irreversible."
  },
  {
    "guid": "cbd90a60-31e9-4b3e-9e0e-5dbad5a26a4a",
    "subjectId": "T66",
    "difficulty": 2,
    "origin": "OPOS24_gpt",
    "type": "flashcard",
    "question": "Quin és el termini màxim per notificar una violació de seguretat segons el RGPD?",
    "answerOptions": [
      {
        "text": "Aquesta me la sé",
        "isCorrect": true,
        "rationale": "72 hores des que el responsable té coneixement de la bretxa."
      },
      {
        "text": "Encara no me la sé",
        "isCorrect": false,
        "rationale": "No passa, cada intent suma experiència."
      }
    ],
    "hint": "Recorda el número 72: tres dies com a màxim."
  },
  {
    "guid": "b238e60b-5528-47bc-9872-139f0da5d1b8",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "OPOS24_gpt",
    "type": "flashcard",
    "question": "Quins són els drets ARCO-POL reconeguts pel RGPD?",
    "answerOptions": [
      {
        "text": "Aquesta me la sé",
        "isCorrect": true,
        "rationale": "Accés, Rectificació, Supressió, Limitació, Portabilitat i Oposició."
      },
      {
        "text": "Encara no me la sé",
        "isCorrect": false,
        "rationale": "No passa, cada intent suma experiència."
      }
    ],
    "hint": "Recorda: ARCO + POL = els sis drets fonamentals."
  },
  {
    "guid": "9a74147a-0d87-4a93-a3c0-d8f153004e61",
    "subjectId": "T66",
    "difficulty": 3,
    "origin": "OPOS24_gpt",
    "type": "flashcard",
    "question": "Quan és obligatori designar un Delegat de Protecció de Dades (DPD)?",
    "answerOptions": [
      {
        "text": "Aquesta me la sé",
        "isCorrect": true,
        "rationale": "Quan el responsable és una autoritat pública o quan el tractament és massiu o d’alt risc."
      },
      {
        "text": "Encara no me la sé",
        "isCorrect": false,
        "rationale": "No passa, cada intent suma experiència."
      }
    ],
    "hint": "L’article 37 RGPD estableix els casos obligatoris."
  },
  {
    "guid": "e9cbcc40-2f7f-46b7-8bcb-b102f564aadc",
    "subjectId": "T66",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "flashcard",
    "question": "Qui és responsable de notificar una bretxa de seguretat a l’autoritat competent?",
    "answerOptions": [
      {
        "text": "Aquesta me la sé",
        "isCorrect": true,
        "rationale": "El responsable del tractament, encara que l’encarregat hagi detectat l’incident."
      },
      {
        "text": "Encara no me la sé",
        "isCorrect": false,
        "rationale": "No passa, cada intent suma experiència."
      }
    ],
    "hint": "El responsable és qui comunica formalment a l’AEPD."
  },
  {
    "guid": "1c9671a1-59b7-4d65-bf36-9d229a60aef8",
    "subjectId": "T66",
    "difficulty": 3,
    "origin": "OPOS24_gpt",
    "type": "flashcard",
    "question": "Quina diferència hi ha entre responsable i encarregat del tractament?",
    "answerOptions": [
      {
        "text": "Aquesta me la sé",
        "isCorrect": true,
        "rationale": "El responsable decideix la finalitat i mitjans del tractament; l’encarregat actua per compte del responsable."
      },
      {
        "text": "Encara no me la sé",
        "isCorrect": false,
        "rationale": "No passa, cada intent suma experiència."
      }
    ],
    "hint": "El responsable decideix el 'què' i 'per què'; l’encarregat, el 'com'."
  },
  {
    "guid": "ca4cb700-9e3e-49e7-8e28-48c783e9d1ee",
    "subjectId": "T66",
    "difficulty": 4,
    "origin": "OPOS24_gpt",
    "type": "flashcard",
    "question": "Quin és el nivell màxim de sanció previst pel RGPD?",
    "answerOptions": [
      {
        "text": "Aquesta me la sé",
        "isCorrect": true,
        "rationale": "Fins a 20 milions d’euros o el 4% del volum global de negoci, la quantitat més alta."
      },
      {
        "text": "Encara no me la sé",
        "isCorrect": false,
        "rationale": "No passa, cada intent suma experiència."
      }
    ],
    "hint": "Recorda la fórmula: 20 milions o 4%."
  },
  {
    "guid": "7c03d34c-404d-49cf-9b36-72e1e05a6cc3",
    "subjectId": "T66",
    "difficulty": 2,
    "origin": "OPOS24_gpt",
    "type": "flashcard",
    "question": "Quan és necessària una Avaluació d’Impacte relativa a la Protecció de Dades (EIPD)?",
    "answerOptions": [
      {
        "text": "Aquesta me la sé",
        "isCorrect": true,
        "rationale": "Quan el tractament pot suposar un alt risc per als drets i llibertats de les persones."
      },
      {
        "text": "Encara no me la sé",
        "isCorrect": false,
        "rationale": "No passa, cada intent suma experiència."
      }
    ],
    "hint": "Per exemple, en casos de biometria, videovigilància o perfilatge."
  },
  {
    "guid": "a58a8411-143b-4fec-bea9-61a07f69890b",
    "subjectId": "T66",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 1,
    "question": "Una administración pública española, ¿puede ser sancionada con una multa económica por infringir el RGPD?",
    "answerOptions": [
      {
        "text": "Sí, con las mismas multas que el sector privado, hasta 20 millones de euros.",
        "isCorrect": false,
        "rationale": "El régimen sancionador distingue entre el sector público y el privado en cuanto a las multas económicas."
      },
      {
        "text": "No, las administraciones públicas están totalmente exentas de cualquier medida correctora por parte de la AEPD.",
        "isCorrect": false,
        "rationale": "Aunque no se les aplican multas económicas, sí están sujetas a la supervisión y a otras medidas por parte de la autoridad de control."
      },
      {
        "text": "No, no se imponen multas económicas, pero sí pueden recibir requerimientos, advertencias o medidas de corrección.",
        "isCorrect": true,
        "rationale": "La LOPDGDD especifica que, en lugar de multas pecuniarias, a las administraciones públicas se les aplican otras medidas coercitivas como advertencias o la exigencia de cese de la conducta infractora."
      },
      {
        "text": "Sí, pero las multas son simbólicas y no pueden superar los 100.000 euros.",
        "isCorrect": false,
        "rationale": "No existe un régimen de multas simbólicas; la ley opta por un tipo de medidas correctoras diferente para el sector público."
      }
    ],
    "hint": "Recuerda que la LOPDGDD adapta ciertos aspectos del RGPD al ordenamiento jurídico español, incluyendo el régimen sancionador para el sector público."
  },
  {
    "guid": "9b280116-26b4-42fe-9a15-bc0e26ea6f46",
    "subjectId": "T66",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 1,
    "question": "En el contexto de una administración pública que gestiona un trámite obligatorio como el padrón municipal, ¿cuál es la base jurídica principal que legitima el tratamiento de los datos personales de los ciudadanos?",
    "answerOptions": [
      {
        "text": "El consentimiento expreso de cada ciudadano al empadronarse.",
        "isCorrect": false,
        "rationale": "Aunque el ciudadano realiza la acción, la base legal para este tipo de trámite no suele ser el consentimiento, ya que no es una elección libre sino una obligación."
      },
      {
        "text": "El interés legítimo de la administración para una mejor organización.",
        "isCorrect": false,
        "rationale": "El interés legítimo es una base jurídica más común en el sector privado y debe ponderarse con los derechos del interesado, mientras que las AAPP actúan en base a competencias atribuidas por ley."
      },
      {
        "text": "La ejecución de un contrato entre el ciudadano y el ayuntamiento.",
        "isCorrect": false,
        "rationale": "Un trámite como el padrón no constituye un contrato en el sentido que el RGPD contempla para esta base jurídica."
      },
      {
        "text": "El cumplimiento de una misión de interés público o el ejercicio de poderes públicos.",
        "isCorrect": true,
        "rationale": "La gestión del padrón es una competencia otorgada por ley a los ayuntamientos, lo que encaja directamente en el cumplimiento de una misión en interés público."
      }
    ],
    "hint": "Piensa en por qué una administración realiza ciertos tratamientos de datos. ¿Es por elección del ciudadano o por una competencia que le atribuye la ley?"
  },
  {
    "guid": "97013a0a-e91e-45ae-9129-683c8013c0af",
    "subjectId": "T66",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 1,
    "question": "Un usuario de una red social solicita la portabilidad de todas sus fotos. La empresa le entrega las fotos que él subió, pero no las fotos en las que fue etiquetado por otros. ¿Actúa correctamente la empresa según el RGPD?",
    "answerOptions": [
      {
        "text": "No, el derecho a la portabilidad cubre todos los datos personales, incluyendo aquellos generados por terceros como las etiquetas.",
        "isCorrect": false,
        "rationale": "El derecho a la portabilidad tiene un alcance específico sobre el origen de los datos."
      },
      {
        "text": "Sí, porque el derecho a la portabilidad se limita a los datos que el interesado ha facilitado al responsable del tratamiento.",
        "isCorrect": true,
        "rationale": "Este derecho está diseñado para que el usuario pueda recuperar los datos que él mismo proporcionó, ya sea activa o pasivamente, pero no los generados por otros."
      },
      {
        "text": "No, porque la empresa está obligada a facilitar una copia de todos los datos que posee sobre el usuario, sin excepción.",
        "isCorrect": false,
        "rationale": "Esta descripción corresponde más al derecho de acceso que al de portabilidad, y aun así, el derecho de acceso tiene limitaciones."
      },
      {
        "text": "Sí, pero solo si el tratamiento de las fotos etiquetadas no estaba automatizado.",
        "isCorrect": false,
        "rationale": "Si bien el tratamiento automatizado es una condición para la portabilidad, el factor clave en este caso es quién facilitó los datos."
      }
    ],
    "hint": "El derecho a la portabilidad tiene dos condiciones clave relacionadas con el origen de los datos y la forma en que se tratan."
  },
  {
    "guid": "64630da3-78e5-4440-83cc-133223dac804",
    "subjectId": "T66",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 1,
    "question": "Una empresa sufre una brecha de seguridad que resulta en el acceso no autorizado a su base de datos de clientes. Se da cuenta del incidente un viernes a las 17:00. ¿Cuál es el plazo máximo para notificarlo a la Agencia Española de Protección de Datos (AEPD)?",
    "answerOptions": [
      {
        "text": "Antes del lunes a las 17:00.",
        "isCorrect": true,
        "rationale": "El plazo de 72 horas es natural, no distingue entre días hábiles o festivos, por lo que empieza a contar desde que se tiene conocimiento del incidente."
      },
      {
        "text": "Antes del miércoles a las 17:00, ya que las 72 horas son hábiles.",
        "isCorrect": false,
        "rationale": "El reglamento establece un plazo de horas naturales, no hábiles, para garantizar una respuesta rápida ante el riesgo."
      },
      {
        "text": "Dispone de 24 horas desde que tiene conocimiento.",
        "isCorrect": false,
        "rationale": "El plazo es más amplio que 24 horas para permitir una evaluación inicial del alcance de la brecha."
      },
      {
        "text": "No hay un plazo fijo, debe hacerse 'sin dilación indebida'.",
        "isCorrect": false,
        "rationale": "Aunque debe hacerse 'sin dilación indebida', el RGPD sí establece un plazo máximo concreto en horas."
      }
    ],
    "hint": "El RGPD establece un plazo muy específico en horas, y este no distingue entre días laborables y fines de semana."
  },
  {
    "guid": "b4604b17-9137-4ee4-ba25-7b7057e73cb1",
    "subjectId": "T66",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 1,
    "question": "¿Cuál es la diferencia fundamental entre datos 'anonimizados' y datos 'pseudonimizados' según el RGPD?",
    "answerOptions": [
      {
        "text": "Ambos conceptos son sinónimos y se refieren a datos cifrados.",
        "isCorrect": false,
        "rationale": "El cifrado es una medida de seguridad, pero la anonimización y la pseudonimización son técnicas de disociación con efectos jurídicos diferentes."
      },
      {
        "text": "Los datos anonimizados ya no se consideran datos personales, mientras que los pseudonimizados sí lo son.",
        "isCorrect": true,
        "rationale": "La anonimización es un proceso irreversible que impide la reidentificación, sacando los datos del ámbito del RGPD. La pseudonimización es reversible y, por tanto, los datos siguen siendo personales."
      },
      {
        "text": "Los datos pseudonimizados no pueden ser revertidos a su estado original, mientras que los anonimizados sí.",
        "isCorrect": false,
        "rationale": "Esta afirmación invierte los conceptos. La clave de la pseudonimización es que se puede revertir con información adicional."
      },
      {
        "text": "La pseudonimización solo se aplica a datos no sensibles, mientras que la anonimización se usa para datos de salud.",
        "isCorrect": false,
        "rationale": "Ambas técnicas pueden aplicarse a diferentes categorías de datos, no están restringidas de esta manera."
      }
    ],
    "hint": "Piensa en si es posible, de alguna manera, volver a identificar a la persona a partir de los datos tratados."
  },
  {
    "guid": "7b32825a-e072-49aa-b022-b6e1c1d872b8",
    "subjectId": "T66",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 1,
    "question": "El Delegado de Protección de Datos (DPD) de un ayuntamiento detecta un incumplimiento grave de la normativa. ¿Cuál es su función principal en esta situación?",
    "answerOptions": [
      {
        "text": "Sancionar al departamento responsable del incumplimiento.",
        "isCorrect": false,
        "rationale": "El DPD no tiene potestad sancionadora; su rol es de supervisión y asesoramiento, no ejecutivo."
      },
      {
        "text": "Asumir la responsabilidad legal final por el incumplimiento ante la AEPD.",
        "isCorrect": false,
        "rationale": "La responsabilidad final recae siempre en el responsable del tratamiento (el ayuntamiento), no en el DPD, que actúa como asesor."
      },
      {
        "text": "Informar al más alto nivel jerárquico de la organización y asesorar sobre las medidas a adoptar.",
        "isCorrect": true,
        "rationale": "El DPD debe reportar directamente al nivel directivo superior y recomendar las acciones correctivas, manteniendo su independencia y función asesora."
      },
      {
        "text": "Decidir y ejecutar directamente las medidas técnicas para solucionar el problema.",
        "isCorrect": false,
        "rationale": "El DPD asesora sobre las medidas, pero la responsabilidad de implementarlas recae en el responsable y en los departamentos técnicos correspondientes."
      }
    ],
    "hint": "El rol del DPD es de supervisión y asesoramiento, no de ejecución o responsabilidad final. Debe mantener su independencia."
  },
  {
    "guid": "b600abd0-9f1c-489b-897d-a83f97bdd1b3",
    "subjectId": "T66",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 1,
    "question": "Una empresa de EEUU ofrece una app en España que monitoriza el comportamiento de los usuarios para mostrarles publicidad. La empresa no tiene oficinas ni servidores en la UE. ¿Está sujeta al RGPD?",
    "answerOptions": [
      {
        "text": "No, porque el RGPD solo aplica a empresas con establecimiento físico en la Unión Europea.",
        "isCorrect": false,
        "rationale": "El ámbito de aplicación del RGPD se extiende más allá de la presencia física, basándose en el mercado al que se dirige la actividad."
      },
      {
        "text": "Sí, por el criterio de aplicación extraterritorial, al ofrecer servicios o monitorizar el comportamiento de personas en la UE.",
        "isCorrect": true,
        "rationale": "El artículo 3.2 del RGPD establece claramente su aplicación a responsables o encargados no establecidos en la UE si sus actividades se relacionan con la oferta de bienes/servicios o el control del comportamiento de interesados en la UE."
      },
      {
        "text": "Solo si los datos de los usuarios españoles se almacenan en servidores ubicados dentro de la UE.",
        "isCorrect": false,
        "rationale": "La ubicación del servidor no es el factor determinante para la aplicación del reglamento; lo es la ubicación de las personas cuyos datos se tratan."
      },
      {
        "text": "No, porque las empresas de EEUU se rigen exclusivamente por la legislación estadounidense.",
        "isCorrect": false,
        "rationale": "Cuando una empresa opera en el mercado europeo y trata datos de sus ciudadanos, debe cumplir con las normativas de dicho mercado, como el RGPD."
      }
    ],
    "hint": "El ámbito de aplicación del RGPD tiene un criterio 'territorial' que va más allá de la ubicación física de la empresa."
  },
  {
    "guid": "8360bb03-4908-479c-bdef-f0a227eb5bb8",
    "subjectId": "T66",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 1,
    "question": "La LOPDGDD complementa al RGPD en España. ¿Cuál de los siguientes aspectos es una regulación específica introducida por la LOPDGDD y no se encuentra de forma explícita en el RGPD?",
    "answerOptions": [
      {
        "text": "El derecho de acceso a los datos personales.",
        "isCorrect": false,
        "rationale": "El derecho de acceso es uno de los derechos fundamentales ya establecidos y regulados en el propio RGPD."
      },
      {
        "text": "La obligación de nombrar un Delegado de Protección de Datos en las administraciones públicas.",
        "isCorrect": false,
        "rationale": "Esta obligación ya viene impuesta directamente por el artículo 37 del RGPD."
      },
      {
        "text": "La regulación del derecho a la desconexión digital en el ámbito laboral.",
        "isCorrect": true,
        "rationale": "La LOPDGDD introduce un título completo sobre 'Garantía de los derechos digitales', donde se desarrollan derechos como la desconexión digital, que no están detallados en el RGPD."
      },
      {
        "text": "El principio de minimización de datos.",
        "isCorrect": false,
        "rationale": "La minimización de datos es uno de los principios clave del tratamiento, definidos en el artículo 5 del RGPD."
      }
    ],
    "hint": "Piensa en los 'derechos digitales' que se han añadido específicamente para adaptar la normativa al entorno laboral y digital español."
  },
  {
    "guid": "705bf6e9-cfbd-4727-a9ac-fa2f4bb72f61",
    "subjectId": "T66",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 1,
    "question": "¿En qué se basa el principio de 'responsabilidad proactiva' (accountability)?",
    "answerOptions": [
      {
        "text": "En que el responsable debe reaccionar rápidamente solo cuando se produce una denuncia o una brecha de seguridad.",
        "isCorrect": false,
        "rationale": "Este enfoque es reactivo, mientras que el principio de 'accountability' exige una actitud constante y preventiva."
      },
      {
        "text": "En la obligación del responsable de demostrar activamente que cumple con el RGPD, mediante políticas internas, registros y análisis de riesgos.",
        "isCorrect": true,
        "rationale": "La esencia de este principio es que no basta con cumplir, sino que hay que ser capaz de evidenciar y demostrar dicho cumplimiento en todo momento."
      },
      {
        "text": "En que la responsabilidad por cualquier incumplimiento recae siempre sobre el Delegado de Protección de Datos.",
        "isCorrect": false,
        "rationale": "La responsabilidad recae sobre el responsable del tratamiento, no sobre el DPD, que tiene un rol asesor."
      },
      {
        "text": "En que los interesados son los únicos responsables de proteger sus propios datos.",
        "isCorrect": false,
        "rationale": "Este principio traslada la carga de la prueba y la responsabilidad principal a quien trata los datos, no a los individuos."
      }
    ],
    "hint": "Este principio implica un cambio de enfoque: no es suficiente con 'ser' conforme a la norma, sino que hay que 'poder demostrarlo'."
  },
  {
    "guid": "37535df2-5cd0-41e3-9ca7-6d0fbb29ef90",
    "subjectId": "T66",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 1,
    "question": "Un ayuntamiento y una diputación provincial crean un consorcio para gestionar un servicio de teleasistencia. Ambas entidades deciden conjuntamente para qué se usarán los datos de los usuarios y qué medios técnicos se emplearán. ¿Qué figura define su relación según el RGPD?",
    "answerOptions": [
      {
        "text": "El ayuntamiento es el responsable y la diputación es la encargada del tratamiento.",
        "isCorrect": false,
        "rationale": "Esta relación se daría si la diputación actuara por cuenta y bajo las instrucciones del ayuntamiento, pero en este caso, deciden conjuntamente."
      },
      {
        "text": "Son corresponsables del tratamiento.",
        "isCorrect": true,
        "rationale": "Cuando dos o más responsables determinan conjuntamente los fines y los medios del tratamiento, el RGPD los define como corresponsables."
      },
      {
        "text": "Son dos responsables del tratamiento independientes, cada uno con su propio fichero.",
        "isCorrect": false,
        "rationale": "Al tomar decisiones conjuntas sobre un mismo tratamiento, su responsabilidad está entrelazada, no es independiente."
      },
      {
        "text": "El consorcio se convierte en el único responsable, y las administraciones quedan exentas.",
        "isCorrect": false,
        "rationale": "Aunque el consorcio tenga personalidad jurídica, las entidades que lo componen y deciden conjuntamente sobre el tratamiento son las que asumen la corresponsabilidad."
      }
    ],
    "hint": "El RGPD tiene una figura específica para cuando la toma de decisiones sobre los fines y medios del tratamiento es compartida."
  },
  {
    "guid": "247fbc8d-609b-49ca-a3ce-7ccc55bef65d",
    "subjectId": "T66",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 1,
    "question": "Una tienda online utiliza un algoritmo para decidir automáticamente si concede o no un crédito a un cliente para financiar una compra, sin intervención humana. ¿Qué derecho del RGPD es particularmente relevante en esta situación?",
    "answerOptions": [
      {
        "text": "El derecho de supresión ('derecho al olvido').",
        "isCorrect": false,
        "rationale": "El derecho de supresión se aplica a la eliminación de datos, no al proceso de toma de decisiones."
      },
      {
        "text": "El derecho a la portabilidad de los datos.",
        "isCorrect": false,
        "rationale": "La portabilidad se refiere a la capacidad de mover los datos a otro proveedor, no a impugnar una decisión."
      },
      {
        "text": "El derecho a no ser objeto de decisiones individuales automatizadas.",
        "isCorrect": true,
        "rationale": "Este derecho protege a las personas de decisiones tomadas únicamente por medios automatizados que produzcan efectos jurídicos o les afecten significativamente, garantizando el derecho a obtener intervención humana."
      },
      {
        "text": "El derecho de rectificación.",
        "isCorrect": false,
        "rationale": "La rectificación permite corregir datos inexactos, pero no aborda el proceso de decisión en sí mismo."
      }
    ],
    "hint": "El RGPD contempla un derecho específico para situaciones donde una máquina toma una decisión importante sobre una persona."
  },
  {
    "guid": "3705cd0e-9ef3-4886-bfd3-0418194ca2dc",
    "subjectId": "T66",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 1,
    "question": "Para cumplir con el principio de 'limitación del plazo de conservación', ¿qué debe hacer una entidad con los datos personales?",
    "answerOptions": [
      {
        "text": "Conservarlos indefinidamente 'por si fueran necesarios en el futuro'.",
        "isCorrect": false,
        "rationale": "Esta práctica es contraria al principio, que exige que los datos no se conserven más tiempo del necesario para los fines para los que fueron recogidos."
      },
      {
        "text": "Establecer un plazo máximo de conservación de 5 años para todos los datos, por defecto.",
        "isCorrect": false,
        "rationale": "El plazo no es genérico; debe estar justificado en función de la finalidad del tratamiento y las obligaciones legales aplicables."
      },
      {
        "text": "Eliminarlos o anonimizarlos una vez que haya expirado la finalidad para la cual se recogieron.",
        "isCorrect": true,
        "rationale": "La correcta aplicación del principio implica que, una vez cumplido el objetivo, los datos deben ser suprimidos de forma segura o convertidos en anónimos para que dejen de ser datos personales."
      },
      {
        "text": "Cifrarlos después de un año para que se consideren 'conservados de forma segura'.",
        "isCorrect": false,
        "rationale": "El cifrado es una medida de seguridad, pero no sustituye la obligación de eliminar los datos cuando ya no son necesarios."
      }
    ],
    "hint": "Este principio se relaciona con el 'ciclo de vida' de los datos. ¿Qué ocurre cuando los datos ya no son necesarios para su propósito original?"
  },
  {
    "guid": "5a05daa5-b666-43e3-9aad-2381da8f1268",
    "subjectId": "T66",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 1,
    "question": "¿Es válido el consentimiento para el tratamiento de datos si se obtiene mediante una casilla pre-marcada en un formulario web?",
    "answerOptions": [
      {
        "text": "No, el consentimiento debe ser una declaración o una clara acción afirmativa, y la inacción o el silencio no son válidos.",
        "isCorrect": true,
        "rationale": "El RGPD exige una manifestación de voluntad 'inequívoca', lo que excluye las casillas pre-marcadas, ya que el usuario no realiza una acción afirmativa para consentir."
      },
      {
        "text": "Sí, si el usuario tiene la opción de desmarcar la casilla.",
        "isCorrect": false,
        "rationale": "Aunque exista la opción de desmarcar, el punto de partida (la casilla ya marcada) no cumple con el requisito de una acción afirmativa por parte del usuario."
      },
      {
        "text": "Sí, se considera consentimiento tácito, que es una de las formas válidas.",
        "isCorrect": false,
        "rationale": "El RGPD eliminó la validez del consentimiento tácito; debe ser expreso e inequívoco."
      },
      {
        "text": "Solo si la finalidad del tratamiento es para marketing directo.",
        "isCorrect": false,
        "rationale": "La exigencia de una acción afirmativa clara se aplica a cualquier tratamiento basado en el consentimiento, sin importar la finalidad."
      }
    ],
    "hint": "El RGPD cambió las reglas sobre cómo debe manifestarse el consentimiento. Piensa si la 'no acción' puede considerarse una manifestación de voluntad."
  },
  {
    "guid": "f7ab71b4-3ca1-416a-aa1a-f85b4d82546f",
    "subjectId": "T66",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 1,
    "question": "¿Cuándo es obligatorio realizar una Evaluación de Impacto relativa a la Protección de Datos (EIPD)?",
    "answerOptions": [
      {
        "text": "Siempre que se vaya a realizar cualquier tratamiento de datos personales.",
        "isCorrect": false,
        "rationale": "La EIPD no es necesaria para todos los tratamientos, sino para aquellos que presentan un riesgo específico."
      },
      {
        "text": "Únicamente cuando lo solicite expresamente la AEPD.",
        "isCorrect": false,
        "rationale": "La obligación de realizarla es proactiva y recae en el responsable del tratamiento antes de iniciar el tratamiento, no es una medida reactiva."
      },
      {
        "text": "Cuando es probable que un tratamiento entrañe un alto riesgo para los derechos y libertades de las personas.",
        "isCorrect": true,
        "rationale": "El RGPD vincula la obligatoriedad de la EIPD a la existencia de un 'alto riesgo' potencial, como en tratamientos a gran escala de datos sensibles o vigilancia sistemática."
      },
      {
        "text": "Solo para las administraciones públicas, nunca para el sector privado.",
        "isCorrect": false,
        "rationale": "La obligación aplica a cualquier responsable del tratamiento, público o privado, siempre que se cumplan las condiciones de alto riesgo."
      }
    ],
    "hint": "La clave para esta obligación no es el tipo de organización, sino el nivel de amenaza potencial para los derechos de los individuos."
  },
  {
    "guid": "23f33ecf-8c76-46f4-9e0c-22349b38b70a",
    "subjectId": "T66",
    "origin": "notebooklm",
    "type": "test",
    "difficulty": 1,
    "question": "¿Cómo se relaciona el Esquema Nacional de Seguridad (ENS) con el RGPD en el ámbito de las administraciones públicas españolas?",
    "answerOptions": [
      {
        "text": "El ENS sustituye completamente las obligaciones de seguridad del RGPD para el sector público.",
        "isCorrect": false,
        "rationale": "El RGPD es de aplicación directa y sus obligaciones no pueden ser sustituidas por una norma nacional, sino complementadas."
      },
      {
        "text": "El cumplimiento del ENS sirve como marco para aplicar las medidas técnicas y organizativas de seguridad que exige el RGPD.",
        "isCorrect": true,
        "rationale": "El ENS proporciona un sistema detallado de políticas y medidas de seguridad que ayuda a las AAPP a cumplir con la obligación más genérica del RGPD de garantizar una seguridad adecuada al riesgo."
      },
      {
        "text": "El RGPD y el ENS son normativas incompatibles y una administración debe elegir cuál de las dos aplicar.",
        "isCorrect": false,
        "rationale": "Ambas normativas son complementarias: el RGPD se centra en la protección del dato personal y el ENS en la seguridad de la información y los sistemas en general."
      },
      {
        "text": "El ENS se aplica a los datos y el RGPD se aplica a los sistemas de información.",
        "isCorrect": false,
        "rationale": "Esta afirmación invierte los focos principales; el RGPD se centra en la protección de los datos personales y el ENS en la seguridad de los sistemas que los tratan."
      }
    ],
    "hint": "Piensa en el ENS como el 'cómo' se implementan en el sector público las medidas de seguridad que el RGPD ('el qué') exige."
  },




  
  {
    "guid": "b312a491-d774-4881-ab3b-290dd2c047f7",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Quin és el nom complet i el número del Reglament General de Protecció de Dades?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Reglament (UE) 2016/679 del Parlament Europeu i del Consell, de 27 d’abril de 2016."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "ce3bb710-aeca-4a5e-9175-d1c74eed9c95",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿A partir de quina data va ser d'aplicació el RGPD?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "A partir del 25 de maig de 2018."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "2ca3b0cb-f344-40d2-ad6f-a1296beae72f",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Quina llei orgànica adapta el RGPD a l'ordenament jurídic espanyol?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "La Llei Orgànica 3/2018, de 5 de desembre (LOPDGDD)."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "6450dbdc-e486-4e63-b08a-cf8367f04a50",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "El principi de _____ exigeix que les dades siguin tractades de manera legal, equitativa i clara per a l'interessat.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "llicitud, lleialtat i transparència"
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "77d4d9b1-a515-4c58-b8e2-4df8dc2f2917",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Què implica el principi de limitació de la finalitat en el tractament de dades?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Que les dades només es poden recollir per a finalitats determinades, explícites i legítimes, i no tractar-les posteriorment de manera incompatible."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "95772740-746e-44fe-ab7b-a4a035965b18",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "Segons el principi de minimització de dades, quines dades es poden tractar?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Només les dades adequades, pertinents i limitades al que és estrictament necessari en relació amb les finalitats del tractament."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "d96a6618-074f-464a-ab45-8442e0b5b40b",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Què estableix el principi d'exactitud del RGPD?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Que les dades personals han de ser exactes i, si cal, estar actualitzades."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "22193e7e-0aa0-48e6-b95c-af69894e1b9d",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "El principi de limitació del termini de conservació estableix que les dades no s'han de conservar més temps del _____.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "necessari per a les finalitats del tractament"
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "64f87cc8-f425-4cb0-b66d-852a748dc377",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Quina obligació imposa el principi d'integritat i confidencialitat?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Garantir una seguretat adequada de les dades personals per protegir-les contra el tractament no autoritzat, la pèrdua o la destrucció."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "f44f5cfc-bb46-4ef6-82d0-c1a0ab03c7ff",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "Concepte: Responsabilitat proactiva (accountability)",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "És el principi pel qual el responsable del tractament ha de ser capaç de demostrar el compliment de tots els principis del RGPD."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "1a1719f3-4e4f-4a81-8807-42d12d5dcca4",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "Anomena una de les sis bases jurídiques que legitimen el tractament de dades segons l'article 6 del RGPD.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "El consentiment exprés de l'interessat (o execució d'un contracte, obligació legal, interessos vitals, missió d'interès públic, interès legítim)."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "5ba67647-60f9-47f7-a778-a6c065f84311",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "Perquè el consentiment sigui vàlid sota el RGPD, ha de ser lliure, específic, _____ i inequívoc.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "informat"
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "ba97dc3f-5bcd-4ae1-9023-ed6543ddbc00",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿El consentiment obtingut mitjançant caselles pre-marcades és vàlid segons el RGPD?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "No, el consentiment ha de ser una acció afirmativa i inequívoca, no pot ser tàcit o per omissió."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "da64c840-532a-4149-93fb-1d1de6bd40c3",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Quin dret permet a una persona saber quines dades seves es tracten, amb quina finalitat i per qui?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "El dret d'accés."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "a7232de5-a49f-492a-9b78-361bf8ff810d",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Com es coneix popularment el dret de supressió?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "El dret a l'oblit."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "3c266762-509a-4301-91ca-824904926101",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿En què consisteix el dret a la portabilitat de les dades?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "En rebre les dades personals en un format estructurat i de lectura mecànica per a transmetre-les a un altre responsable."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "4414ab4c-ec6f-449e-9ad6-d8a511a1b15d",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Quin dret tenen les persones per evitar ser avaluades únicament per algoritmes sense intervenció humana?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "El dret a no ser objecte de decisions individuals automatitzades, inclosa l'elaboració de perfils."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "3e1cea71-c1aa-434b-966c-63ea5b39e6b7",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "Rol: Responsable del tractament",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "La persona física o jurídica que decideix sobre la finalitat i els mitjans del tractament de dades personals."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "a611a508-f0c6-4010-b96f-42dadd2a99c0",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "Rol: Encarregat del tractament",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "La persona física o jurídica que tracta dades personals per compte del responsable del tractament."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "432d2795-b742-4734-9633-d8c235d87631",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Quan es considera que existeixen corresponsables del tractament?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Quan dos o més responsables determinen conjuntament els fins i els mitjans del tractament."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "b4c45cd6-cb76-4339-b64b-f2123d4767ce",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿En quins tres casos és obligatori designar un Delegat de Protecció de Dades (DPD)?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Administracions públiques, empreses que tractin dades a gran escala o empreses que facin una observació habitual i sistemàtica d'interessats."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "27683245-769d-4702-a4b8-0ba336155a43",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "Anomena una de les funcions principals del Delegat de Protecció de Dades (DPD).",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Assessorar i supervisar el compliment del RGPD (o cooperar amb l'autoritat de control, o ser el punt de contacte)."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "42d25d4d-9838-408f-a3da-54135dff2473",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "L'enfocament del RGPD pel que fa a les mesures de seguretat està basat en el _____.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "risc"
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "adbe66d8-eed1-40d6-a31a-8521251196c1",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Què és una Avaluació d'Impacte relativa a la Protecció de Dades (EIPD o DPIA)?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Una anàlisi prèvia que s'ha de realitzar per a tractaments de dades que puguin suposar un risc alt per als drets i llibertats de les persones."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "8d07338e-d864-475a-8728-859a53e971aa",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "Anomena un exemple de mesura tècnica o organitzativa de seguretat mencionada al material.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "La pseudonimització, el xifrat, les còpies de seguretat o el control d'accés."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "d937fb2b-297f-4696-8cd5-44e2cfe86d1b",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Quin és el termini màxim per notificar una violació de seguretat de dades a l'autoritat de control (AEPD)?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "En un màxim de 72 hores des que se'n té coneixement."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "c043eafc-45b9-459b-b325-0125ab88e6bd",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿En quines circumstàncies s'ha de comunicar una violació de seguretat directament a les persones afectades?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Quan la violació suposi un alt risc per als seus drets i llibertats."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "6c6688f2-8376-45cf-a8ac-e505826baa75",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Quina és la condició principal per poder realitzar una transferència internacional de dades fora de la UE?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Que es garanteixi un nivell adequat de protecció de les dades."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "63c64c8e-a466-4d5e-8b9b-07ac0aa5e15e",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "Anomena un dels mecanismes vàlids per a realitzar transferències internacionals de dades.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Una decisió d'adequació de la Comissió Europea, clàusules contractuals tipus o normes corporatives vinculants (BCR)."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "eaeabcc5-fb5e-4fbc-a191-f4a073c8d974",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Com es diu l'autoritat de control de protecció de dades a Espanya?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Agència Espanyola de Protecció de Dades (AEPD)."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "2a0218e5-f6b9-471e-b3f1-6a5f2bafa863",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Quina és la sanció màxima per a les infraccions molt greus segons el RGPD?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Fins a 20 milions d'euros o el 4% del volum de negoci anual global."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "d6d81fa4-93e0-4971-8ca7-df58b664ac00",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Quina és la sanció màxima per a les infraccions greus segons el RGPD?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Fins a 10 milions d'euros o el 2% del volum de negoci anual global."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "8fdfe500-ff8c-4ab8-a227-fe748e595f7b",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Se'ls apliquen multes econòmiques a les Administracions Públiques per infraccions del RGPD?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "No, però se'ls poden imposar altres mesures correctores com advertiments o requeriments."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "7aef905b-d851-492a-a190-4543ba28482c",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "Les administracions públiques tenen l'obligació de mantenir un _____ actualitzat on constin totes les operacions de tractament de dades.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Registre d'Activitats de Tractament (RAT)"
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "91bcf4b4-fcfb-4551-97e8-1f216e163e89",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "A part del RGPD, quin marc normatiu espanyol han de complir les Administracions Públiques per garantir la seguretat de la informació?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "L'Esquema Nacional de Seguretat (ENS)."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "0353e817-7014-492d-8830-423eddbfb6d2",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Quina llei espanyola desenvolupa aspectes específics del RGPD com els drets digitals dels treballadors?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "La Llei Orgànica 3/2018 de Protecció de Dades i garantia dels drets digitals (LOPDGDD)."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "fed3b33b-f113-446b-9096-5a3be9ec0796",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "La LOPDGDD complementa el RGPD, però no el _____.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "substitueix"
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "b887fa1d-24bd-420d-835f-27bfbbcd6dfd",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿A partir de quina edat estableix la LOPDGDD que els menors poden prestar el seu consentiment per al tractament de dades?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "A partir dels 14 anys."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "f0df834a-33d8-432a-94a2-faaeb05665ed",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "Concepte: Protecció de dades des del disseny i per defecte.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Principi que obliga a incorporar les garanties de privacitat des de les fases inicials de qualsevol projecte o sistema."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "996eba8a-aaaa-4547-a1e9-607bfd4ab6d4",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "Una adreça IP o una imatge facial són considerades dades personals?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Sí, ja que són informació que pot identificar una persona física."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "c2408643-a911-43c6-be66-aa1121a9cb2a",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "Una empresa de fora de la UE que ofereix serveis a ciutadans europeus, ha de complir el RGPD?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Sí, l'àmbit d'aplicació territorial del RGPD s'estén a aquests casos."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "7116a2f2-092b-4a55-9bb9-1fbe7b557d5e",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "El RGPD s'aplica a activitats exclusivament personals o domèstiques?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "No, aquest tipus d'activitats estan excloses del seu àmbit d'aplicació."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "60ea3688-36ee-4c1c-ba38-cf27be6a0078",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Quina és la base legal més comuna per al tractament de dades per part de les administracions públiques?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "El compliment d'una missió realitzada en interès públic o l'exercici de poders públics."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "e373eefc-c314-4b86-9e5b-646c8be6d847",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "Error comú: Pensar que els drets ARCO encara són només quatre.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Realitat: Amb el RGPD s'amplien a ARCO-POL (Accés, Rectificació, Supressió, Limitació, Oposició i Portabilitat)."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "b3a73da1-4b81-4beb-bd1e-de787fd6a016",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿El Delegat de Protecció de Dades (DPD) és el responsable final del compliment del RGPD en una organització?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "No, el DPD assessora i supervisa, però el responsable final del compliment és el responsable del tractament."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "eebcbcd5-4880-4101-9780-c32e80401923",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "Error comú: Creure que el RGPD estableix un catàleg tancat i obligatori de mesures de seguretat.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Realitat: Exigeix mesures adequades i proporcionals al risc de cada tractament."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "fb481d23-c149-4d4c-8dc5-b56736660223",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿S'ha de notificar a l'AEPD qualsevol incident de seguretat, per petit que sigui?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "S'han de notificar les violacions de seguretat de les dades personals, tret que sigui improbable que constitueixin un risc per als drets."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "78b2abc7-3626-469c-8444-df6f7f628d01",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "Dades _____ són aquelles de les quals s'ha eliminat totalment la possibilitat d'identificar l'interessat.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "anònimes"
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "aeb9eedd-ec72-43ca-b442-a948a42be26c",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "Les dades pseudonimitzades, on els identificadors han estat substituïts, segueixen sent considerades dades personals?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Sí, perquè la identificació és possible mitjançant informació addicional (el procés és reversible)."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "e982cefd-3516-4e13-a614-165208020e4f",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Té algun cost per al ciutadà exercir els seus drets de protecció de dades?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "No, l'exercici dels drets és gratuït, excepte si les sol·licituds són manifestament infundades o excessives."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "0cf9c6c7-1cfa-4885-8545-d941b7424046",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿El RGPD és una directiva europea que necessita transposició?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "No, és un reglament europeu d'aplicació directa i obligatòria a tots els estats membres."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "2376272a-703e-4595-bbd8-6fccb57a6058",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "Una empresa externa que gestiona les nòmines d'un ajuntament actua com a _____ del tractament.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "encarregat"
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "e2e0ec8f-3d27-4392-9867-b6a33f106f15",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "Si un ajuntament i una diputació gestionen conjuntament un servei i decideixen sobre el tractament de dades, actuen com a _____.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "corresponsables"
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "4a1137c6-469f-49be-8f81-1f07ba1df4d8",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "El Comitè Europeu de Protecció de Dades (CEPD) té com a funció garantir la _____ en l'aplicació del RGPD entre els estats membres.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "cooperació i coherència"
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "effc9f51-f035-4ba1-9e5e-04d5ac444f13",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿El dret a la desconnexió digital és un dret reconegut pel RGPD o per la LOPDGDD?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Està reconegut i desenvolupat a la LOPDGDD espanyola."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "1f80fd5f-ebe3-4045-ab95-f34cd5bafa85",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "En un formulari de sol·licitud d'un tràmit municipal, quina seria la base jurídica del tractament?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "El compliment d'una missió realitzada en interès públic o l'exercici de poders públics."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "72ac6261-7d45-410f-b3d3-161f359d0639",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "L'accés a dades mèdiques d'una persona inconscient per part dels serveis d'emergència es legitima per la base jurídica de protecció d'_____.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "interessos vitals"
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "444987e3-95a9-40bc-a18c-e4e257d993d4",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Quina informació bàsica s'ha d'incloure en la notificació d'una violació de seguretat a l'AEPD?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "La naturalesa de la violació, les dades afectades, les conseqüències probables i les mesures adoptades."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "132686fe-bc7d-4b02-9409-764fca9c2612",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "Un exemple de tractament que requeriria una Avaluació d'Impacte (EIPD) seria la instal·lació d'un sistema de _____ massiva.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "videovigilància"
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "3d3bebb1-4c18-4e62-a5f0-9953a2b4a3da",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Quin organisme assessora els governs i les empreses, investiga i sanciona en matèria de protecció de dades a Espanya?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "L'Agència Espanyola de Protecció de Dades (AEPD)."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "872c47de-7419-41d8-a17d-fe1a8b0c48cc",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "L'accés remot a una base de dades a Espanya per part d'un proveïdor situat a l'Índia es considera una transferència internacional de dades?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Sí, l'accés des d'un país tercer ja es considera una transferència internacional."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "6d8abf4a-db96-409b-91c4-d7e4f8e8b9b7",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "El principi de responsabilitat proactiva exigeix que el responsable no només compleixi la norma, sinó que també pugui _____.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "demostrar-ho"
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "0a5e7bf6-02a3-4df6-a5f5-20cabebef5ff",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "El dret a la portabilitat de les dades s'aplica a dades tractades manualment?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "No, només s'aplica a les dades tractades per mitjans automatitzats."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "6bcbe970-21bf-4b78-83d1-74813b97695f",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "La LOPDGDD regula el tractament de dades per part dels partits polítics durant els períodes electorals.",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Cert, estableix normes específiques per a la recopilació d'opinions polítiques."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "eb240db5-25df-4f6d-86c4-6deb34d47378",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "En el context del RGPD, què significa \"tractament\" de dades?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "Qualsevol operació realitzada sobre dades personals, com la recollida, registre, organització, consulta o supressió."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "12368738-719c-40ba-84c4-bc6d4609f0cb",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿És el RGPD una llei espanyola?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "No, és un reglament europeu d'aplicació directa a tots els estats membres de la UE."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "6c63adda-c267-4cdd-a611-cee573ccbb33",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Pot una Administració Pública utilitzar les dades d'una sol·licitud d'ajuda per enviar propaganda d'actes culturals?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "No, violaria el principi de limitació de la finalitat, tret que tingués una altra base legal per fer-ho, com el consentiment exprés."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "3108f731-a411-4eec-98cc-529d1e151f0c",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿El dret a l'oblit és absolut i permet esborrar qualsevol dada en qualsevol circumstància?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "No, té limitacions, com quan el tractament és necessari per complir una obligació legal o per a l'exercici de la llibertat d'expressió."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "2574d49f-479b-485c-8562-65c216a4cdfa",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿El DPD d'una administració pública ha de ser un funcionari de la mateixa?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "No necessàriament, pot ser personal intern o un servei extern contractat."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  },
  {
    "guid": "27057178-7ba7-4361-a71a-d16ae5439c2e",
    "subjectId": "T66",
    "difficulty": 1,
    "origin": "notebooklm",
    "type": "flashcard",
    "question": "¿Quina és la relació entre l'Esquema Nacional de Seguretat (ENS) i el RGPD?",
    "answerOptions": [
      {
        "text": "Me la sé ✅",
        "isCorrect": true,
        "rationale": "L'ENS complementa el RGPD, proporcionant un marc de mesures de seguretat concretes per al sector públic."
      },
      {
        "text": "🤔 Ara no recordo",
        "isCorrect": false,
        "rationale": "C ada intent suma experiència!"
      }
    ],
    "hint": ""
  }
]