[
  {
    "guid": "b72f234e-06ef-49f9-bf52-2474b67422b4",
    "subjectId": "T72",
    "difficulty": 2,
    "origin": "OPOS19_preguntes_especific.pdf",
    "type": "opos19",
    "question": "En relació al dret dels treballadors i treballadores a la protecció davant els riscos laborals que estableix l’art. 14 de la Llei 31/1995, de 8 de novembre, de Prevenció de Riscos Laborals, indica quina afirmació és FALSA:",
    "answerOptions": [
      {
        "text": "A. Existeix el dret a la informació i formació en matèria preventiva.",
        "isCorrect": false,
        "rationale": "Aquesta afirmació és correcta segons l'article 18 i 19 de la LPRL, que estableixen el dret dels treballadors a ser informats i formats sobre els riscos i les mesures preventives."
      },
      {
        "text": "B. Existeix el dret a la paralització de l'activitat en cas de risc greu i imminent.",
        "isCorrect": false,
        "rationale": "És correcte segons l'article 21 de la LPRL, que reconeix el dret a interrompre l'activitat laboral davant un risc greu i imminent."
      },
      {
        "text": "C. Existeix el dret a la vigilància de l’estat de salut.",
        "isCorrect": false,
        "rationale": "També és correcte segons l'article 22 de la LPRL, que regula la vigilància periòdica de la salut dels treballadors."
      },
      {
        "text": "D. Existeix el dret a la participació i consulta només si es forma part del Comitè de Seguretat i Salut (delegats de prevenció).",
        "isCorrect": true,
        "rationale": "Aquesta és la resposta falsa. Tots els treballadors tenen dret a la consulta i participació, no només els membres del Comitè. Ho estableix l'article 33 de la LPRL."
      }
    ],
    "hint": "Recorda que els drets preventius afecten a tot el personal treballador, no només als representants sindicals o comitès."
  },
  {
    "guid": "b72f234e-06ef-49f9-bf52-2474b67422b4",
    "subjectId": "T72",
    "difficulty": 2,
    "origin": "OPOS19_preguntes_especific.pdf",
    "type": "opos19",
    "question": "En relació al dret dels treballadors i treballadores a la protecció davant els riscos laborals que estableix l’art. 14 de la Llei 31/1995, de 8 de novembre, de Prevenció de Riscos Laborals, indica quina afirmació és FALSA:",
    "answerOptions": [
      {
        "text": "A. Existeix el dret a la informació i formació en matèria preventiva.",
        "isCorrect": false,
        "rationale": "Correcte segons els articles 18 i 19 de la LPRL, que garanteixen el dret a ser informat i format en prevenció."
      },
      {
        "text": "B. Existeix el dret a la paralització de l'activitat en cas de risc greu i imminent.",
        "isCorrect": false,
        "rationale": "Correcte segons l’article 21 de la LPRL, que reconeix aquest dret."
      },
      {
        "text": "C. Existeix el dret a la vigilància de l’estat de salut.",
        "isCorrect": false,
        "rationale": "Correcte segons l’article 22 de la LPRL, que regula la vigilància periòdica de la salut."
      },
      {
        "text": "D. Existeix el dret a la participació i consulta només si es forma part del Comitè de Seguretat i Salut (delegats de prevenció).",
        "isCorrect": true,
        "rationale": "Falsa. Tots els treballadors tenen dret a participar i ser consultats, no només els delegats. Art. 33 LPRL."
      }
    ],
    "hint": "La participació i consulta preventiva és un dret general per a tot el personal."
  },
  {
    "guid": "f083cf39-55ef-4c5a-90aa-bd1d25b1ec5d",
    "subjectId": "T72",
    "difficulty": 3,
    "origin": "OPOS21_preguntes_especific.pdf",
    "type": "opos21",
    "question": "El Comitè de Seguretat i Salut en el Treball, en l’exercici de les seves competències, estarà facultat per:",
    "answerOptions": [
      {
        "text": "A. Realitzar la memòria de l’empresa i la programació anual del Departament de Recursos Humans i del Servei de prevenció.",
        "isCorrect": false,
        "rationale": "No és funció del comitè; aquesta tasca correspon a la direcció i al servei de prevenció."
      },
      {
        "text": "B. Realitzar obligatòriament i sempre les visites als centres de treball per tal de tenir un coneixement objectiu de la prevenció de riscos.",
        "isCorrect": false,
        "rationale": "Les visites es fan quan es considera necessari, no sempre ni obligatòriament."
      },
      {
        "text": "C. Conèixer i analitzar els danys produïts per la salut o a la integritat física dels treballadors/ores per valorar-ne les causes i proposar les adequades mesures preventives.",
        "isCorrect": true,
        "rationale": "Correcte segons l’article 39.2 de la LPRL, que atorga aquesta funció al Comitè de Seguretat i Salut."
      },
      {
        "text": "D. Participar en l’elaboració i avaluació dels programes de prevenció només quan s’ha produït un accident laboral greu per tal de proposar mesures preventives.",
        "isCorrect": false,
        "rationale": "El comitè participa en els programes preventius de forma regular, no només davant accidents greus."
      }
    ],
    "hint": "El Comitè de Seguretat i Salut és un òrgan col·legiat de consulta i participació, no d’execució directa."
  },
  {
    "guid": "cd223f17-72d1-4f6e-9c91-bc90b13e4b2a",
    "subjectId": "T72",
    "difficulty": 3,
    "origin": "OPOS23_preguntes_especific.pdf",
    "type": "opos23",
    "question": "La Comissió Nacional de Seguretat i Salut en el Treball estarà integrada per:",
    "answerOptions": [
      {
        "text": "A. Un/a representant de cadascuna de les Comunitats Autònomes, un membre de l'Administració General de l'Estat i dos membres de cadascuna de les organitzacions empresarials i sindicals més representatives.",
        "isCorrect": false,
        "rationale": "No reflecteix la composició equilibrada i paritària prevista per la llei."
      },
      {
        "text": "B. Dos membres en representació de les Comunitats Autònomes, dos membres en representació de l'Administració General de l'Estat i quatre membres en representació de cadascuna de les organitzacions empresarials i sindicals amb més afiliats.",
        "isCorrect": false,
        "rationale": "La llei no fixa aquest nombre concret de representants."
      },
      {
        "text": "C. Un/a representant de cadascuna de les Comunitats Autònomes i per igual nombre de membres de l'Administració General de l'Estat i, paritàriament amb tots els anteriors, per representants de les organitzacions empresarials i sindicals més representatives.",
        "isCorrect": true,
        "rationale": "Correcte segons l’article 13 de la LPRL, que estableix aquesta composició paritària."
      },
      {
        "text": "D. Un/a representant de les Comunitats Autònomes, un/a representant de l'Administració General de l'Estat i un/a representant de cadascuna de les organitzacions empresarials i sindicals.",
        "isCorrect": false,
        "rationale": "No compleix el principi de paritat ni la representació prevista legalment."
      }
    ],
    "hint": "Recorda que la Comissió Nacional és un òrgan col·legiat amb representació paritària entre Estat, CCAA, empresaris i sindicats."
  }
]
